/**
 * @name CeL data for era calendar.
 * @fileoverview 本檔案包含了東亞傳統曆法/中國傳統曆法 (traditional civil
 *               calendar)，農曆、夏曆、陰曆的各紀年期間曆數資料。
 * 
 * @summary <code>

TODO:

任意線圖階層，不只(紀年名稱索引值)所示。


https://cs.wikipedia.org/wiki/Seznam_p%C5%99edstavitel%C5%AF_%C4%8Desk%C3%A9ho_st%C3%A1tu

https://en.wikipedia.org/wiki/Lists_of_rulers_of_Greece

https://en.wikipedia.org/wiki/Ancient_history
https://en.wikipedia.org/wiki/Lists_of_ancient_kings
https://en.wikipedia.org/wiki/Middle_chronology
https://en.wikipedia.org/wiki/Chronology_of_the_ancient_Near_East
https://zh.wikipedia.org/wiki/%E5%80%AD%E9%A9%AC%E4%BA%9A%E7%8E%8B%E6%9C%9D
https://zh.wikipedia.org/wiki/%E7%8E%B0%E4%BB%BB%E4%B8%BB%E6%9D%83%E5%9B%BD%E5%AE%B6%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8

https://en.wikipedia.org/wiki/List_of_kings_of_Axum


中國君主列表 (地方政權)
https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9C%8B%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8_%28%E5%9C%B0%E6%96%B9%E6%94%BF%E6%AC%8A%29


http://www.lib.nankai.edu.cn/gj/showwords.asp?airid=251
先秦古籍所據曆法較為混亂。一般說，《春秋》、《孟子》多用周曆，《楚辭》、《呂氏春秋》用夏曆，《詩經》要看具體詩篇而定。若不瞭解這種情況，而以現行夏曆的時間概念去閱讀古籍，有時就難以理解某些記載，或者會懷疑古人搞錯了時間。如《春秋‧成公八年》記載著「二月無冰」這一現象，因為該書用周曆，二月即夏曆的十二月，是最冷的月份，無冰在當時是罕見的，因而才載入史冊。


唐以後帝王避諱名表
http://140.111.1.40/fulu/fu8/newpage1.htm


拓本文字データベース
http://coe21.zinbun.kyoto-u.ac.jp/djvuchar
墓誌數據庫-浙大墓誌庫
http://csid.zju.edu.cn/tomb/stone


bug:
同慶乙酉年



// ----------------------------------//

閩越
https://zh.wikipedia.org/wiki/%E6%B1%89%E6%9C%9D%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8


大天興（興源國）（928年-929年）
https://zh.wikipedia.org/wiki/%E5%A4%A7%E5%A4%A9%E8%88%88
年號尊聖。
大理國
https://zh.wikipedia.org/wiki/%E9%9B%B2%E5%8D%97%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8
https://zh.wikipedia.org/wiki/%E5%A4%A7%E7%90%86%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8

私年号
https://ja.wikipedia.org/wiki/%E7%A7%81%E5%B9%B4%E5%8F%B7

関東の三島暦では天正10年に閏12月がありますが、京暦では天正11年に閏1月 があり、年初が1か月ずれています[7]。これも京暦に拠りました (1990年ＮＨＫ「歴史誕生」で話題になりました)。
木場明志	本能寺の変と天正10年の暦	雑誌『文明のクロスロード』第45号(1993)pp.29-37

九州年号


韓國君主列表
https://ko.wikipedia.org/wiki/%ED%95%9C%EA%B5%AD%EC%9D%98_%EA%B5%B0%EC%A3%BC_%EB%AA%A9%EB%A1%9D

http://www.math.snu.ac.kr/~kye/others/lunar.html
음양력 변환 陰陽曆轉換
http://astro.kasi.re.kr/Life/ConvertSolarLunarForm.aspx?MenuID=115
http://astro.kasi.re.kr/Life/Knowledge/solar2lunar/convert_daily_l2s.php


宋、金時期存在的君主制國家與藩鎮等


+藏曆

+蒙古曆

+印度年表
+寮國年表


+Ab urbe condita (AUC)


+敦煌曆



+蘭芳
	Lanfang : [
			{
				a : {
					T : '蘭芳'
				},
				R : '蘭芳大統制共和國（1777年—1884年），別稱蘭芳共和國，1777年當年定為「蘭芳元年」。蘭芳一百零八年(西元1884年) 滅亡。',
				href : 'https://zh.wikipedia.org/wiki/%E8%98%AD%E8%8A%B3%E5%85%B1%E5%92%8C%E5%9C%8B'
			}, Year_numbering(-1776) ]



俄國曆法 （Pycckий kaπeHдapb） 俄國古代採用「Byzantine calendar」。最初記載曆法的《編年史》將公元前5508年定為「Byzantine calendar」的元年，新年從3月1日開始。
公元1492年以後改為從9月1日開始。1699年12月15日彼得一世下令採用儒略曆（舊曆），將「Byzantine calendar」7208年12月31日之次日改為1700年1月1日。儒略曆每年平均為365.25日，比回歸年長11分14秒。這一微小誤差導致每128年節氣日期提前1天。1582年，教皇格列高利十三世實行曆法改革，將當年春分由舊曆3月11日，將日期後移10天。並規定新曆除能用400整除的世紀年（如1600年，2000年）置閨外，其他世紀年（如1700年、1800年、1900年）不置閨。從而使新曆每400年較舊曆少3天。曆法改革造成了舊曆和新曆在日期上的差距。18世紀舊曆日期比新曆日期早11天，19世紀早12天，20世紀早13天。1918年1月26日，蘇俄政府宣佈停止使用舊曆，採用新曆（即公曆）。





 </code>
 * @since 2013/2/13 12:45:44
 */

'use strict';

// console.info('Starting to load era data.');

// node 中, 此處 this === undefined

/** {Object}為了不汙染 global，在 loading 時傳遞的暫時工作空間 temporary working space */
CeL.era.pass_on = {
	countries : Object.create(null),
	last_day : '2101/1/29'
};

// era.精=:歷史上這個時期曆法與公元的對照本來就無法追溯得精準至日，甚至曆法本身就不夠精準。
// era.準=:歷史上這個時期曆法與公元的對照應該非常精準，但是本數據庫的資料準確程度不足。
// era.疑=:歷史上這個時期曆法與公元的對照應該非常精準，本數據庫的資料尺度標示也很精準，但是本數據庫的資料實際上存在疑問、可能不準確。

/**
 * data from <a href="http://sinocal.sinica.edu.tw/" accessdate="2013/3/17
 * 19:23">中央研究院 兩千年中西曆轉換</a>
 */
// gettext_config:{"id":"china"}
(CeL.era.pass_on.countries["中國"] = [
		// Chinese: 中國傳統曆法。

		// 共和元年(841 BCE)是中國歷史上有確切紀年的開始。
		'西周/共伯和/共和|-841~||精=年|朝代=周',
		'=/宣王|-827~||君主名=姬靜;姬靖|精=年|卒=前782年|在位=前828年~前782年|注=姬姓，名靜，一作靖。|注=张培瑜《逨鼎的月相纪日和西周年代》2003年《文物》6期：《史紀》周宣王紀年應移後一年。宣王元年應是公元前826年。宣王46年應是公元前781年。惟2012年 叶正渤《逨鼎铭文历法解疑》：<q>逨鼎诸器属于厉王时期器物。厉王在位37年，厉王纪年包括共和行政14年在内。共和行政既没有改元，也没有单独纪年。</q>',
		'/幽王|-781~||君主名=姬宮涅;姬宮湦|精=年|據=史記|君主名=姬宮涅;姬宮湦|生=前795年? (前795年？)|卒=前771年|在位=前781年~前771年',
		'東周/攜王|-770~-750||精=年|朝代=周|君主=攜惠王|君主名=姬余臣|據=《清華大學藏戰國竹簡（貳）·繫年·第二章》：周幽王取（娶）妻於西申，生坪（平）王，王或（又）取（娶）孚（褒）人之女，是孚（褒）姒，生白（伯）盤。孚（褒）姒辟（嬖）於王，王與白（伯）盤迖（逐）坪（平）王，坪（平）王走西申。幽王起師，回（圍）坪（平）王於西申，申人弗畀，曾（繒）人乃降西戎，以攻幽王，幽王及白（伯）盤乃滅，周乃亡。邦君、者（諸）正乃立幽王之弟余臣於虢（攜?），是攜惠王。立廿（二十）又一年，晉文侯仇乃殺惠（攜?）王於虢（攜?）。周亡王九年，邦君者（諸）侯焉始不朝於周，晉文侯乃逆坪（平）王於少鄂，立之於京師。三年，乃東徙，止於成周，晉人焉始啟於京師，奠（鄭）武公亦政（正）東方之者（諸）侯。武公即世，莊公即立（位）。|卒=前750年|在位=前771年~前750年',
		'/平王|-770~||精=年|據=史記|君主名=姬宜臼|卒=前720年|在位=前770年~前720年',
		'/桓王|-719~||精=年|君主名=姬林|卒=前697年|在位=前719年~前697年',
		'/莊王|-696~||君主名=姬佗;姬仲|精=年|卒=前682年',
		'/僖王|-681~||精=年|君主名=姬胡齊|君主=釐王|卒=前677年|在位=前681年~前677年',
		'/惠王|-676~||精=年|君主名=姬閬|卒=前653年或前652年|在位=前673年~前653年或前652年',
		'/襄王|-651~||精=年|君主名=姬鄭|卒=前619年',
		'/頃王|-618~||精=年|君主名=姬壬臣|卒=前613年',
		'/匡王|-612~||精=年|君主名=姬班|卒=前607年',
		'/定王|-606~||精=年|君主名=姬瑜|卒=前586年',
		'/簡王|-585~||精=年|君主名=姬夷|卒=前572年',
		'/靈王|-571~||君主名=姬泄心|精=年|卒=前545年|在位=前571年~前545年',
		'/景王|-544~||精=年|君主名=姬貴|卒=前520年|在位=前544年~前520年',
		'/敬王|-519~||精=年|君主名=姬匄|生=前6世紀?|卒=前477年|在位=前519年~前477年',
		'/元王|-475~||精=年|君主名=姬仁|卒=前469年',
		'/貞定王|-468~||精=年|君主名=姬介|卒=前441年',
		'/考王|-440~||精=年|君主名=姬嵬|卒=前426年',
		'/威烈王|-425~||精=年|君主名=姬午|卒=前402年',
		'/安王|-401~||精=年|君主名=姬驕|卒=前376年',
		'/烈王|-375~||精=年|君主名=姬喜|卒=前369年',
		'/顯王|-368~||精=年|君主名=姬扁|卒=前321年',
		'/慎靚王|-320~||精=年|君主名=姬定|卒=前315年',
		'/赧王|-314~-256||精=年|君主=周隱王|君主名=姬延|卒=前256年|注=《竹書紀年》作周隱王|注=王五十九年，駕崩。是年，秦遷九鼎，占王畿，滅東周。',

		// ----------------------------------//
		// 中國周朝春秋十二諸侯國 / 戰國七雄
		// https://zh.wikipedia.org/wiki/%E5%91%A8%E6%9C%9D%E8%AB%B8%E4%BE%AF%E5%9C%8B%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8
		// https://zh.wikipedia.org/wiki/%E6%88%B0%E5%9C%8B%E6%AD%B7%E5%8F%B2%E5%B9%B4%E8%A1%A8

		'宋國/僖公|-858~||精=年|君主名=子舉|君主=釐公|諸侯國=宋|時期=周諸侯國|卒=前831年',
		'/惠公|-830~||精=年|君主名=子覵|卒=前800年',
		'/戴公|-799~||精=年|卒=前766年|在位=前799年~前766年',
		'/武公|-765~||精=年|卒=前748年',
		'/宣公|-747~||精=年|卒=前729年',
		'/穆公|-728~||精=年|卒=前720年',
		'/殤公|-719~||精=年|卒=前710年',
		'/溤|-710~||精=年',
		'/愍公|-691~||精=年',
		'/桓公|-681~||精=年',
		'/襄公|-650~||精=年|卒=前637年|在位=前650年~前637年',
		'/成公|-636~||精=年|君主名=茲甫;茲父|卒=前620年',
		'/昭公|-619~||精=年',
		'/文公|-610~||精=年|卒=前589年|在位=前610年~前589年',
		'/共公|-588~||精=年|卒=前576年',
		'/平公|-575~||精=年|卒=前532年',
		'/元公|-531~||精=年|卒=前517年|在位=前531年~前517年',
		'/景公|-516~-476||精=年|卒=前469年|在位=前516年~前469年',

		// https://zh.wikipedia.org/wiki/%E6%99%8B%E5%9B%BD%E5%90%9B%E4%B8%BB
		'晉國/靖侯|-858~||精=年|時期=周諸侯國',
		'/釐侯|-840~||精=年|卒=前823年',
		'/獻侯|-822~||精=年',
		'/穆侯|-811~||精=年|君主=穆侯弗生|卒=前785年|在位=前812年~前785年',
		'/殤叔|-784~||精=年|卒=前781年|在位=前785年~前781年',
		'/文侯|-780~||精=年|生=前805年|卒=前746年|在位=前781年~前746年',
		'/昭侯|-745~||精=年|在位=前745年~前740年',
		'/孝侯|-739~||精=年|在位=前739年~前724年',
		'/鄂侯|-723~||精=年',
		'/哀侯|-717~||精=年|在位=前718年~前709年',
		'/小子|-709~||精=年',
		'/緡|-706~-679||精=年',
		// 晉昭侯把曲沃封給晉文侯的弟弟桓叔。晉國分裂為翼和曲沃。
		'/桓叔|-744~||精=年|在位=前745年－前731年|君主=曲沃桓叔',
		'/莊伯|-730~||精=年|在位=前731年－前716年|君主=曲沃莊伯',
		'/武公|-715~||精=年|在位=前716年－前677年|君主=曲沃武公',
		'/獻公|-676~||精=年|在位=前676年~前651年',
		'/惠公|-650~||精=年|君主名=姬夷吾|卒=前637年|在位=前650年~前637年',
		'/文公|-636~||精=年|生=前672年|卒=前628年|在位=前636年夏曆二月~前628年夏曆9月9日(儒略曆10月27日)',
		'/襄公|-627~||精=年|在位=前627年~前621年',
		'/靈公|-620~||精=年',
		'/成公|-606~||精=年|在位=前606年~前600年',
		'/景公|-599~||精=年',
		'/厲公|-580~||精=年|在位=前580年~前573年',
		'/悼公|-572~||精=年',
		'/平公|-557~||精=年|在位=前557年~前532年',
		'/昭公|-531~||精=年|在位=前531年~前526年',
		'/頃公|-525~||精=年|在位=前525年~前512年',
		'/定公|-511~||精=年',
		'/出公|-474~||精=年|卒=前452年|在位=前474年~前452年',
		'/敬公|-451~||精=年|卒=前434年|在位=前451年~前434年',
		'/幽公|-433~||精=年',
		'/烈公|-415~||精=年',
		'/桓公|-388~-369||精=年',

		'齊國/胡公|-862~||精=年|諸侯國=姜齊|時期=周諸侯國|君主名=姜靜;呂靜|卒=前860年|在位=前862年~前860年',
		'/獻公|-859~||精=年|君主名=姜山;呂山|卒=前851年|在位=前859年~前851年',
		'/武公|-850~||精=年|卒=前825年|在位=前850年~前825年',
		'/厲公|-824~||精=年|卒=前816年|在位=前824年~前816年',
		'/文公|-815~||精=年|卒=前804年|在位=前815年~前804年',
		'/成公|-803~||精=年|卒=前795年',
		'/莊公姜購|-794~||精=年|君主名=姜購|君主=齊莊公|卒=前731年|在位=前794年~前731年',
		'/釐公|-730~||精=年|卒=前698年|在位=前730年~前698年',
		'/襄公|-697~||精=年|卒=前686年|在位=前697年~前686年',
		'/桓公姜小白|-685~||精=年|君主名=姜小白|君主=齊桓公|卒=前643年10月7日|在位=前685年~前643年',
		'/孝公|-642~||精=年|卒=前633年|在位=前642年~前633年',
		'/昭公|-632~||精=年|在位=前632年~前613年',
		'/懿公|-612~||精=年|卒=前609年|在位=前612年~前609年',
		'/惠公|-608~||精=年|卒=前599年|在位=前608年~前599年',
		'/頃公|-598~||精=年|卒=前582年|在位=前598年~前582年',
		'/靈公|-581~||精=年|卒=前554年|在位=前581年~前554年',
		'/莊公姜光|-553~||精=年|君主名=姜光|君主=齊莊公|卒=前548年|在位=前553年~前548年',
		'/景公|-547~||精=年|在位=前547年~前490年',
		'/晏孺子|-489~||精=年|在位=前489年',
		'/悼公|-488~||精=年|在位=前488年~前485年',
		'/簡公|-484~||精=年|在位=前484年~前481年',
		'/平公|-480~||精=年|卒=前456年|在位=前480年~前456年',
		'/宣公|-455~||精=年|卒=前405年|在位=前455年~前405年',
		'/康公|-404~-379||精=年|卒=前379年|在位=前404年~前386年',

		'田齊/田悼|-410~||精=年|時期=周諸侯國',
		'/田和|-404~||精=年',
		'/太公|-386~||精=年|君主名=田和|卒=前384年|在位=前404年~前384年，前386年改年稱元年',
		'/田剡|-383~||精=年',
		'/桓公|-374~||精=年',
		'/威王|-356~||精=年',
		'/宣王|-319~||精=年',
		'/愍王|-300~||精=年',
		'/襄王|-283~||精=年',
		'/田建|-264~-221||精=年',

		'蔡國/武侯|-863~||精=年|時期=周諸侯國',
		'/夷侯|-837~||精=年',
		'/釐侯|-809~||精=年',
		'/共侯|-761~||精=年',
		'/戴侯|-759~||精=年',
		'/宣侯|-749~||精=年',
		'/桓侯|-714~||精=年',
		'/哀侯|-694~||精=年',
		'/穆侯|-674~||精=年',
		'/莊侯|-645~||精=年',
		'/文侯|-611~||精=年',
		'/景侯|-591~||精=年|在位=前541年~前510年',
		'/靈侯|-542~||精=年',
		'/平侯|-530~||精=年',
		'/悼侯|-521~||精=年',
		'/昭侯|-518~||精=年',
		'/成侯|-490~-476||精=年',

		'陳國/幽公|-854~||精=年|時期=周諸侯國',
		'/釐公|-831~||精=年',
		'/武公|-795~||精=年',
		'/夷公|-780~||精=年',
		'/平公|-777~||精=年',
		'/文公|-754~||精=年',
		'/桓公|-744~||精=年',
		'/厲公|-706~||精=年',
		'/莊公|-699~||精=年',
		'/宣公|-692~||精=年',
		'/穆公|-647~||精=年',
		'/共公|-631~||精=年',
		'/靈公|-613~||精=年',
		'/成公|-598~||精=年',
		'/哀公|-568~||精=年',
		'/惠公|-533~||精=年',
		'/懷公|-505~||精=年',
		'/愍公|-501~-479||精=年',

		/**
		 * 孔子《春秋》曲循經傳曆日
		 * 
		 * @see https://zh.wikipedia.org/wiki/%E9%B2%81%E5%9B%BD
		 *      http://blog.sina.com.cn/s/blog_bdbfa6720102wm31.html
		 * @seealso 杜預《春秋長曆》，原書已佚，今本是清四庫館臣從《永樂大典》中輯出的，附於杜預《春秋釋例》之後。按此書主要以《乾度曆》推算朔閏，凡與經傳不符者則附以作者考證
		 */
		'魯春秋|-722/1/16~-479/12/19|-722/=591 3qsc49u 4i9 3gb048a 3a8s445 3mn046i 5d1 49u 4pl85as 3rf052k 505 3pt847e 5e1 3st84i0 4t983q1 3os 505 4fvg576 5s9 3sws4a9 3ep83u2 3ot 3me 4m7058y 55bg5uq 40984ic 3rd850a 46l 3poc47d 5ac 57d85uw 5as 48a 3mwc505 46i 4of05ag 57h84a0 4plo3px 3my 4mgc591 3sd84gy 5e9 4a9 3px 3my 4g4s579 47e 4sh84sp85es 3t584ac 446 42y 4o185d1 3z4s4h4 5es 48k 44a 3mng3mng4zu 5sa 4h0 5es 3t7052s 4wq 4bzg4f3g56y 554c5sh 4i9 3ep83u2 3p1 380s42e 58z 3qrw5uq 5ea 3eq448a 3p1 380s42y 4o1859e 5us 40b05as 3rd850q 4z9 3pss47e 5ah 3sws4a0 4ppo3q1 3fu 505 3pss47m 4soc5ea 4aa 3q1 325o3n1 37wc3o5 4gi 4sp84sr05ec 4ac 44a 3mp842z 3mi45s9 4h0 4t585ew 59w 4g9o3fe 4yz 3prg5s9 3z8c4i9 3u1 3hx 31p83mi 571 3ql83qrw5uq 4ia 3eq448a 3p1 381842y 4o1859h 49w 5as 3rd848c 3mwc4z9 46i 4ofg5e1 4a0 4pl85ax 32583n0 505 47e 4ros5e9 3sx84aa 3q1 325o3ot 37wc3o5 4gi 4sp85es 4ac 3qz03nt850a 4yz 42t 4h0 4sr04sr05ew 52s 50a 4bzg4z1 3prw47d 4i0 4t983u1 33xo3p1 3mi 4mgc591 47m 408c4ia 3eq448a 439 3knw42y 59h 3sd849w 5as 3rd8|參照用',
		'魯國/伯禽|-1042~||精=年|疑|時期=周諸侯國|諸侯國=東魯|君主=禽父|卒=前998年|在位=約前1043年~前998年|注=周公旦長子|注=江少华 从《畯簋》历日探讨西周年代: 周公摄政七年而反正成王，在这七年期间，伯禽只是代父治鲁，并没有真正受封，直到成王亲政元年，“此命伯禽俾侯于鲁之岁 也”（《汉书·律历志》），《史记集解》记载：“成王元年封，四十六年，康王十六年卒”。所以伯禽作为鲁侯的实际时间应该是7+46=53年。',
		'/考公|-996~||精=年|疑|君主名=姬酋;姬就;姬遒|卒=前994年|在位=前997年~前994年',
		'/煬公|-992~||精=年|疑|君主名=姬熙;姬怡|卒=前988年|在位=前993年~前988年|注=江少华 从《畯簋》历日探讨西周年代: 关于炀公年数，《鲁世家》记为“六年”，这应该是本文脱落所误。历代史志大体遵从炀公60年一说，如《帝王世纪》、《皇极经世》、《通鉴外纪》、《通志》、《通考》等等。',
		'/幽公|-986~||精=年|君主名=姬宰|卒=前974年|在位=前987年~前974年',
		'/魏公|-973/7~||精=年|君主名=姬沸|君主=魏微公|卒=前924年|在位=前973年~前924年|注=史記/卷033: 幽公十四年。幽公弟沸殺幽公而自立，是為魏公。當年改元??',
		'/厲公|-923~||精=年|卒=前887年|在位=前923年~前887年',
		'/獻公|-886~||精=年|君主名=姬具|卒=前855年|在位=前886年~前855年 (史記: 在位32年)/漢書: 在位50年',
		'/真公|-854~||精=年|疑|據=史記魯世家|君主名=姬濞;姬摯;姬鼻|君主=慎公|卒=前825年|在位=前854年-前825年（史記魯世家）/前855年-前826年（史記十二諸侯表）|注=《漢書》作「慎公」',
		'/武公|-824~||精=年|疑|據=史記魯世家|君主名=姬敖|卒=前816年|在位=前824年（史記魯世家: 在位）/前825年（史記十二諸侯表）~前816年夏季; 9年（史記魯世家）, 10年（史記十二諸侯表）, 2年（漢書）',
		'/懿公|-815~||精=年|卒=前807年|君主名=姬戲|在位=前815年~前807年',
		'/伯御|-806~||精=年|君主=魯公伯御|注=前796年，周宣王伐魯，殺伯御。魯孝公沿用伯御紀年。',
		'/孝公|-795~|12/=:CE|精=年|君主名=姬稱|卒=前769年|在位=前795年~前769年|注=前796年，周宣王率領諸侯軍隊討伐魯國，殺死伯御後擁立為魯國君主。史記魯周公世家記27年。史記十二諸侯年表：(前806年)魯孝公稱元年；則在位27年，紀年38年。實沿用伯御紀年。',
		'/惠公|-768~-723||精=年|君主名=姬弗湟;姬弗皇;姬弗生|卒=前723年|在位=前768年~前723年',
		'/隱公|魯春秋-722~|:魯春秋|準=2日|君主名=姬息;姬息姑|卒=前712年|在位=前722年正月~前712年魯曆11月15日',
		'/桓公|魯春秋-711~|:魯春秋|準=2日|君主名=姬允|生=約前731年10月7日|卒=10月前694年|在位=前711年魯曆11月15日~前694年4月10日',
		'/莊公|魯春秋-693~|:魯春秋|準=2日|君主名=姬同|君主=嚴公|生=前706年10月7日|卒=10月前662年|在位=前693年正月~前662年魯曆8月5日|注=《漢書》避漢諱作魯嚴公',
		'/湣公|魯春秋-661~|:魯春秋|準=2日|君主名=姬啟|君主=閔公;愍公|在位=前661年~前660年|注=《春秋》作「閔公」',
		'/釐公|魯春秋-659~|:魯春秋|準=2日|君主名=姬申|君主=僖公;魯僖公|在位=前659年~前627年|注=《史記》作「釐公」。《春秋》作「僖公」。',
		'/文公|魯春秋-626~|:魯春秋|準=2日|君主名=姬興|在位=前626年~前609年',
		'/宣公|魯春秋-608~|:魯春秋|準=2日|君主名=姬餒;姬倭|在位=前608年~前591年',
		'/成公|魯春秋-590~|:魯春秋|準=2日|君主名=姬黑肱;姬黑股|在位=前590年~前573年',
		'/襄公|魯春秋-572~-542/11/26|:魯春秋|準=2日|君主名=姬午|生=前575年|卒=前542年|在位=前572年~前542年',
		'/子野|魯春秋-542/5/31~|:魯春秋|準=2日|君主名=姬野|注=《春秋·襄公三十一年》：夏六月辛巳，公薨于楚宮。..秋九月癸巳，子野卒。|注=前542年六月二十八日，魯襄公去世，魯國人擁立太子子野即位，住在季氏那裡。九月十一日，子野由於哀痛過度而死。',
		'/昭公|魯春秋-541~|:魯春秋|準=2日|君主名=姬稠;姬袑|卒=前510年|在位=前541年~前510年',
		'/定公|魯春秋-509~|:魯春秋|準=2日|君主名=姬宋|在位=前509年~前495年',
		'/哀公|魯春秋-494~-479/12/19|:魯春秋|準=2日|君主名=姬將;姬蔣|卒=前468年|在位=前494年~前468年',
		'/哀公|-478~-467|17/=:CE|精=年|卒=前468年|在位=前494年~前468年|注=魯哀公27年，魯哀公通過邾國逃到越國。《左傳·哀公二十七年》：公患三桓之侈也，欲以諸侯去之。|注=此後《史記》與楊寬《戰國史料編年輯證》有出入。',
		// 之後的 楊寬《戰國史料編年輯證》與 史記 不同
		// http://blog.sina.com.cn/s/blog_bdbfa6720102w5zz.html

		// 資料出處: 《史記·蔡世家》
		// https://zh.wikipedia.org/wiki/%E6%9B%B9%E5%9C%8B
		'曹國/叔振鐸|-1041~||精=年',
		'/太伯|-1015~||精=年',
		'/仲君|-991~||精=年',
		'/宮伯|-924~||精=年',
		'/孝伯|-884~||精=年',
		'/夷伯|-864~||精=年|時期=周諸侯國',
		'/幽伯|-834~||精=年',
		'/戴伯|-825~||精=年',
		'/惠公|-795~||精=年',
		'/穆公|-759~||精=年',
		'/桓公|-756~||精=年',
		'/莊公|-701~||精=年',
		'/釐公|-670~||精=年',
		'/昭公|-661~||精=年',
		'/共公|-652~||精=年',
		'/文公|-617~||精=年',
		'/宣公|-594~||精=年',
		'/成公|-577~||精=年',
		'/武公|-554~||精=年',
		'/平公|-527~||精=年',
		'/悼公|-523~||精=年',
		'/襄公|-514~||精=年',
		'/隱公|-509~||精=年',
		'/靖公|-505~||精=年',
		'/伯陽|-501~-487||精=年',

		'吳國/壽夢|-585~||精=年|時期=周諸侯國',
		'/諸樊|-560~||精=年',
		'/餘祭|-547~||精=年',
		'/餘眛|-530~||精=年',
		'/僚|-526~||精=年',
		'/闔閭|-514~||精=年',
		'/夫差|-495~-473||精=年|注=吳越爭霸史事繫年考辨（俞志慧）《學燈》第二十六期:句踐二十四年（前473）夏曆九月丁卯這一天，越滅吳，過了二十天後的夏曆九月丁未，范蠡在越軍回國途中，辭別句踐。',

		// 《清華大學藏戰國竹簡（貳）·繫年》
		// https://zh.wikipedia.org/wiki/%E6%A5%9A%E5%9B%BD
		// http://blog.sina.com.cn/s/blog_b7e66ce701016a9y.html
		'楚國/熊勇|-847~||精=年|時期=周諸侯國',
		'/熊嚴|-837~||精=年',
		'/熊霜|-827~||精=年',
		'/熊徇|-821~||精=年',
		'/熊咢|-799~||精=年|姓=羋',
		'/若敖|-790~||精=年|君主名=熊儀',
		'/宵敖|-763~||精=年',
		'/蚡冒|-757~||精=年',
		'/武王|-740~||精=年|卒=前690年|在位=前740年~前690年三月',
		'/文王|-689~||精=年|卒=前675年|在位=前689年~前675年',
		'/堵敖|-676~||精=年|君主名=熊囏;莊敖',
		'/成王|-671~||精=年|生=前?年|卒=前626年|在位=前671年~前626年',
		'/穆王|-625~||精=年|卒=前614年|在位=前625年~前614年',
		'/莊王|-613~||精=年|卒=前591年|在位=前613年~前591年',
		'/共王|-590~||精=年|生=前600年|卒=前560年|在位=前590年~前560年',
		'/康王|-559~||精=年|在位=前559年~前545年',
		'/郟敖|-544~||精=年|在位=前544年~前541年|君主=孺子王',
		'/靈王|-540~-529||精=年|在位=前540年~前529年五月',
		'/訾敖|-529~||精=年|在位=前529年春~前529年五月|君主=楚王比|注=羋姓，熊氏，名比，字子干，也被稱為公子比、右尹子干。未改元',
		'/平王|-528~||精=年|在位=前528年~前516年|君主=景平王',
		'/昭王|-515~||精=年|卒=前489年|在位=前515年~前489年',
		'/惠王|-488~||精=年|卒=前432年|在位=前489年~前432年|君主=獻惠王',
		'/簡王|-431~||精=年|卒=前408年|在位=前431年~前408年|君主=簡大王',
		'/聲王|-407~||精=年|卒=前402年|在位=前407年~前402年|君主=聲桓王',
		'/悼王|-401~||精=年|卒=前381年|在位=前401年~前381年|君主=悼哲王',
		'/肅王|-380~||精=年|卒=前370年|在位=前381年~前370年',
		'/宣王|-369~||精=年|卒=前340年',
		'/威王|-339~||精=年|卒=前329年|在位=前339年~前329年',
		'/懷王|-328~||精=年|卒=前299年|在位=前328年~前299年',
		'/頃王|-298~||精=年|君主=楚頃襄王',
		'/考烈王|-262~||精=年|卒=前238年',
		'/幽王|-237~||精=年',
		'/哀王|-228~||精=年|注=未改元',
		'/負芻|-227~-223||精=年|君主名=負芻|君主=楚王負芻',
		'/昌平君|-223~-223||精=年|君主名=熊啟',

		'燕國/惠侯|-864~||精=年|時期=周諸侯國|卒=前827年',
		'/釐侯|-826~||精=年',
		'/頃侯|-790~||精=年',
		'/哀侯|-766~||精=年',
		'/鄭侯|-764~||精=年',
		'/穆侯|-728~||精=年',
		'/宣侯|-710~||精=年',
		'/桓侯|-697~||精=年|卒=前691年|在位=前697年~前691年',
		'/莊公|-690~||精=年',
		'/襄公|-657~||精=年',
		'/前桓公|-617~||精=年',
		'/宣公|-601~||精=年',
		'/昭公|-586~||精=年',
		'/武公|-573~||精=年|卒=前555年',
		'/前文公|-554~||精=年',
		'/懿公|-548~||精=年',
		'/惠公|-544~||精=年',
		'/悼公|-535~||精=年',
		'/共公|-528~||精=年',
		'/平公|-523~||精=年',
		'/前簡公|-504~||精=年|卒=前493年|在位=前504年~前493年',
		'/孝公|-497~||精=年|卒=前455年|在位=前492年~前455年',
		'/成公|-454~||精=年',
		'/閔公|-438~||精=年|卒=前415年|在位=前438年~前415年',
		'/後簡公|-414~||精=年',
		'/後桓公|-372~||精=年|君主=燕獻公',
		'/後文公|-361~||精=年',
		'/易王|-332~||精=年',
		'/燕王噲|-320~||精=年',
		'/昭襄王|-313~||精=年|卒=前279年|在位=前313年~前279年',
		'/惠王|-278~||精=年|卒=前271年|在位=前278年~前271年',
		'/武成王|-271~||精=年|卒=前258年',
		'/孝王|-257~||精=年|卒=前255年|在位=前257年~前255年',
		'/燕王喜|-254~-222||精=年',

		'衛國/頃侯|-866~||精=年|時期=周諸侯國',
		'/僖侯|-854~-813||精=年|君主=釐侯',
		'/共伯|-813~||精=年|注=在位兩年，未改元',
		'/武公|-812~||精=年|生=前852年|卒=前758年|在位=前812年~前758年',
		'/莊公姬揚|-757~||精=年|君主名=姬揚|君主=衛莊公',
		'/桓公|-734~-719||精=年',
		'/州吁|-719~||精=年|注=在位一年。未改元',
		'/宣公|-718~||精=年|在位=前718年~前700年',
		'/惠公|-699~||精=年|注=前699年 - 前697年（史記）',
		'/黔牟|-696~||精=年|注=前696年 - 前687年（史記）',
		'/惠公|-688~||精=年|注=前686年 - 前669年（史記）未改元|注=復位',
		'/懿公|-668~-660||精=年|卒=前660年|在位=前668年~前660年',
		'/戴公|-660~||精=年|注=當年改元',
		'/文公|-659~||精=年|卒=前635年|在位=前659年~前635年',
		'/成公|-634~||精=年',
		'/穆公|-599~||精=年',
		'/定公|-588~||精=年|卒=前577年|在位=前588年~前577年',
		'/獻公|-576~||精=年|君主名=姬衎|卒=前544年|在位=前576年~前559年',
		'/殤公|-558~||精=年|卒=前546年|在位=前558年~前547年',
		'/獻公|-546~||精=年|在位=前546年~前544年（復位）|注=復位',
		'/襄公|-543~||精=年|卒=前535年|在位=前543年~前535年',
		'/靈公|-534~||精=年|生=前540年|卒=前493年|在位=前534年~前493年',
		'/出公|-492~||精=年|卒=前456年|在位=前493年~前481年/前477年~前470年（復位）',
		'/莊公姬蒯聵|-480~||精=年|君主名=姬蒯聵|君主=衛莊公',
		'/斑師|-478~||精=年|君主名=姬般師|君主=公孫般師|在位=前477年|注=《史記》作斑師',
		'/君起|-477~||精=年|君主=公子起',
		'/出公|-476~||精=年|注=前476年 - 前456年（史記）|注=復位',
		'/悼公|-469~||精=年|卒=前465年|在位=前469年~前465年|注=前455年 - 前451年（史記）',
		'/敬公|-464~||精=年|卒=前432年|在位=前465年~前432年|注=前450年 - 前432年（史記）',
		'/昭公|-431~||精=年|卒=前426年|在位=前432年~前426年',
		'/懷公|-425~||精=年|卒=前415年|在位=前426年~前415年',
		'/慎公|-414~||精=年|卒=前373年|在位=前415年~前373年|注=前414年 - 前373年（史記）',
		'/聲公|-382~||精=年|卒=前362年|在位=前373年~前362年|注=前372年 - 前362年（史記）',
		'/成侯|-371~||精=年|卒=前343年|在位=前371年~前343年|注=前361年 - 前333年（史記）',
		'/平侯|-342~||精=年|卒=前335年|在位=前342年~前335年|注=前332年 - 前325年（史記）',
		'/嗣君|-334~||精=年|卒=前293年|在位=前334年~前293年|注=前324年 - 前383年（史記）',
		'/懷君|-292~||精=年|卒=前252年|在位=前292年~前252年|注=前282年 - 前253年（史記）',
		'/元君|-254~||精=年|卒=前230年|在位=前252年~前230年|注=前252年 - 前230年（史記）',
		'/君角|-241~-209||精=年|在位=前241年~前209年|注=前229年 - 前209年（史記）',

		'趙氏/成子|-636~||精=年|注=趙氏宗主|時期=周諸侯國',
		'/宣子|-621~||精=年',
		'/莊子|-600~||精=年',
		'/文子|-583~||精=年',
		'/景叔|-540~||精=年',
		'/簡子|-517~||精=年',
		'/襄子|-475~||精=年',
		'/桓子|-424~||精=年',
		'/獻子|-423~||精=年',
		'趙國/烈侯|-408~||精=年|時期=周諸侯國|卒=前400年|在位=前408年~前400年|注=趙烈侯六年（前403年），與韓、魏並立為諸侯。',
		'/武侯|-399~||精=年|卒=前387年|在位=前399年~前387年',
		'/敬侯|-386~||精=年|生=約前410年左右|卒=前375年|在位=前386年~前375年',
		'/成侯|-374~||精=年|卒=前350年|在位=前374年~前350年',
		'/肅侯|-349~||精=年|卒=前326年|在位=前349年~前326年',
		'/武靈王|-325~||精=年|生=約前340年|卒=前295年|在位=前326年~前298年農曆5月1日',
		'/惠文王|-298~||精=年|生=前310年|卒=前266年|在位=前298年5月1日~前266年',
		'/孝成王|-265~||精=年|卒=前245年|在位=前265年~前245年',
		'/悼襄王|-244~||精=年|卒=前236年|在位=前244年~前236年',
		'/幽繆王|-235~||精=年|君主=趙王遷|君主名=趙遷|在位=前235年~前228年',
		'/代王嘉|-227~-222||精=年|君主名=趙嘉',

		'鄭國/桓公|-806~||精=年|君主名=姬友|時期=周諸侯國|卒=前771年',
		'/武公|-770~||精=年|君主名=姬掘突|卒=前744年',
		'/莊公|-743~||精=年|君主名=姬寤生|生=前757年|卒=前701年|在位=前744年~前701年',
		'/昭公|-701~||精=年|君主名=姬忽|卒=前695年|在位=前696年~前695年',
		'/厲公|-700~||精=年|君主名=姬突|卒=前673年|在位=前700年~前673年',
		'/昭公|-696~||精=年|注=復位',
		'/子亹|-694~||精=年|君主名=姬子亹|卒=前694年|在位=前694年~前694年',
		'/子嬰|-693~||精=年|君主名=姬嬰;鄭子;鄭子儀|君主字=子儀|卒=前680年|在位=前693年~前680年',
		'/厲公|-679~||精=年|注=復位',
		'/文公|-672~||精=年|君主名=姬踕|卒=前628年|在位=前672年~前628年',
		'/穆公|-627~||精=年|君主名=姬蘭|生=前647年|卒=前606年|在位=前627年~前606年',
		'/靈公|-605~||精=年|君主名=姬夷|卒=前572年',
		'/襄公|-604~||精=年|君主名=姬堅|卒=前587年|在位=前604年~前587年',
		'/悼公|-586~||精=年|君主名=姬沸|卒=前585年|在位=前586年~前585年',
		'/成公|-584~||精=年|君主名=姬睔|卒=前571年|在位=前584年~前571年',
		'/釐公|-570~||精=年|君主名=姬惲|卒=前566年|在位=前570年~前566年',
		'/簡公|-565~||精=年|君主名=姬嘉|卒=前107年',
		'/定公|-529~||精=年|君主名=姬寧',
		'/獻公|-513~||精=年|君主名=姬躉|卒=前501年|在位=前513年~前501年',
		'/聲公|-500~||精=年|君主名=姬勝',
		'/哀公|-462~||精=年|君主名=姬易|卒=前455年',
		'/共公|-455~||精=年|君主名=姬丑|卒=前424年|注=鄭共公在位年數據楊寬《戰國史料編年輯証》作了修正。',
		'/幽公|-423~||精=年|君主名=姬已|卒=前423年',
		'/繻公|-422~||精=年|君主名=姬駘|卒=前396年',
		'/康公|-395~-375||精=年|君主名=姬乙|注=前375年為韓國所滅。',

		'韓氏/武子|-424~||精=年|君主名=韓啟章|據=《史記·六國年表》|時期=周諸侯國|卒=前409年|在位=前424年~前409年|注=韓康子之子',
		'韓國/景侯|-408~||精=年|君主名=韓虔|據=《史記·韓世家》|時期=周諸侯國|卒=前400年|在位=前408年~前400年|注=韓武子之子。三家分晉之後，韓國建都於平陽。',
		'/烈侯|-399~||精=年|君主名=韓取|據=《史記·韓世家》 吳鎮鋒《金文人名匯編》|卒=前387年|在位=前399年~前387年|注=韓景侯之子',
		'/文侯|-386~||精=年|據=《史記·韓世家》|卒=前377年|在位=前386年~前377年|注=韓列侯之子',
		'/哀侯|-376~-374||精=年|據=《史記·韓世家》《戰國史料編年輯証》|卒=前374年|在位=前376年~前374年|注=韓文侯之子',
		'/懿侯|-374~||精=年|君主名=韓若山|據=《史記·韓世家》《漢書·古今人表》《戰國史料編年輯証》|卒=前363年|在位=前374年~前363年|注=韓哀侯之子',
		'/昭侯|-362~||精=年|君主名=韓武|據=《史記·韓世家》《呂氏春秋》《韓非子》《戰國史料編年輯証》|卒=前333年|在位=前362年~前333年|注=韓懿侯之子',
		'/宣惠王|-332~||精=年|據=《史記·韓世家》《古本竹書紀年輯証》|卒=前312年|在位=前332年~前312年|注=韓昭侯之子',
		'/襄王|-311~||精=年|據=《史記·韓世家》《史記·留侯世家》|卒=前296年|在位=前311年~前296年|注=韓宣惠王之子',
		'/釐王|-295~||精=年|君主名=韓咎|據=《史記·韓世家》|卒=前273年|在位=前295年~前273年|注=韓襄王之子',
		'/桓惠王|-272~||精=年|據=《史記·韓世家》《史記·留侯世家》|卒=前239年|在位=前272年~前239年|注=韓釐王之子',
		'/韓王安|-238~-230||精=年|君主名=韓安|據=《史記·韓世家》|卒=前226年|在位=前238年~前230年|注=韓桓惠王之子',

		'魏國/文侯|-445~||精=年|君主名=魏斯|據=《史記·六國年表》 楊寬《戰國史》|時期=周諸侯國|卒=前396年|在位=前445年~前396年，前424年稱侯立元年',
		'/武侯|-395~||精=年|君主名=魏擊|據=《史記·韓世家》 楊寬《戰國史》|卒=前370年|在位=前395年~前370年',
		'/惠王|-369~||精=年|君主名=魏罃|據=《史記·韓世家》 吳鎮鋒《金文人名匯編》 楊寬《戰國史》|生=前400年|卒=前319年|在位=前369年~前319年，前334年改年稱後元年',
		'/惠王/後|-334~||精=年|君主名=魏罃|據=《史記·韓世家》 吳鎮鋒《金文人名匯編》 楊寬《戰國史》|生=前400年|卒=前319年|在位=前369年~前319年，前334年改年稱後元年|注=前334年稱王並改元，改侯年為王年',
		'=/襄王|-318~||精=年|君主名=魏嗣|據=《史記·韓世家》|卒=前296年|在位=前318年~前296年',
		'/昭王|-295~||精=年|君主名=魏遫|據=《史記·韓世家》《戰國史料編年輯証》|卒=前277年|在位=前295年~前277年',
		'/安釐王|-276~||精=年|君主名=魏圉|據=《史記·韓世家》《漢書·古今人表》《戰國史料編年輯証》|卒=前243年|在位=前276年~前243年',
		'/景湣王|-242~||精=年|君主名=魏午|據=《史記·韓世家》《呂氏春秋》《韓非子》《戰國史料編年輯証》|卒=前228年|在位=前242年~前228年',
		'/魏假|-227~-225||精=年|君主名=魏王假|君主名=魏假|據=《史記·韓世家》《古本竹書紀年輯証》|卒=前225年?|在位=前227年~前225年',

		// ----------------------------------//

		// -721年12月17日至-479年11月春秋戰國曆採用19年7閏，閏年的末月置閏並取名閏十三。年首為正月。
		// 秦昭王時期顓頊曆實施至-104年11月秦漢歷同樣採用19年7閏，閏年的末月置閏並取名後九月。年首為十月。

		// 顓頊曆實施至漢初古曆數。朱桂昌以秦獻公十九年（前366年）作為假定顓頊曆實施年（《顓頊日曆表》，中華書局，2012年），但據文物1982年第1期《四川省青川縣戰國墓發掘簡報》引秦牘「〔秦武王〕二年十一月己酉朔」，秦武王時期仍舊使用周曆，故顓頊曆實施時間當在秦昭王時期。
		'秦漢歷|-291/11/12~-104/11/14|-290/=505 3ql847o 59m 4g4s591 3qu447p 3oq 4o1859h 47p 39zw46i 59h 3quk47p 3mn047e 59m 3quk505 47e 4oj059m 4g4s591 47m 4okc3oq 579 3qsc47p 3oq 4mgc59h 3qu447p 42y 4ofg59l 47p 3mn046i 3pss47e 59m 3quk505 47e 4ojw59m 505 3ql847m 4okc3oq 591 3qsc47p 3oq 4mgc59h 3quk47p 42y 4ofg59l 47p 3mn047e 59l 3quk505 3pss47m 59m 4g4s579 47m 4ojw59m 4mgc59h 47o 4okc42y 59h 3quk579 47e 4ojw59m 4g4s591 47o 4okc3oq 591 3qsc47p 39zw46i 59h 3quk47p 42y 4ofg59m 47p 3mn047e 4oj059m 505 3ql847m 59m 4g4s579 3qsc47p 3oq 4mgc59h 47o 4okc42y 4ofg59m 47p 3mn047e 59l 3quk505 47e 4oj059m 4g4s579 47m 4okc3oq 579 3qsc47o 4okc42y 59h 3qu447p 42y 4o1859l 47p 3mn046i 4oj059m 47p 3pss47m 59m 3quk579 3qsc47o 59m 4mgc591 47o 4okc42y 591 3qu447p 39zw46i 59l 3quk47p 46i 4ofg59m 3quk579|歲首=10|閏月名=後|參照用|曆法=顓頊曆',

		'秦國/秦侯|-857~||精=年|時期=周諸侯國|卒=前848年|在位=前858年~前848年',
		'/公伯|-847~||精=年|卒=前845年|在位=前848年~前845年',
		// 史記 十二諸侯年表: 前841, 秦仲四年
		'/秦仲|-844~||精=年|卒=前822年|在位=前845年~前822年',
		'/莊公|-821~||精=年|卒=前778年|在位=前822年~前778年',
		'/襄公|-777~||精=年|卒=前766年|在位=前778年~前766年',
		'/文公|-765~||精=年|卒=前716年|在位=前766年~前716年',
		'/寧公|-715~||精=年|生=前725年|卒=前704年|在位=前716年~前704年',
		'/出公|-703~||精=年|生=前389年或前388年|卒=前385年|在位=前386年~前385年',
		'/武公|-697~||精=年|卒=前678年|在位=前697年~前678年',
		'/德公|-677~||精=年|生=前710年|卒=前676年|在位=前678年~前676年',
		'/宣公|-675~||精=年|卒=前664年|在位=前676年~前664年',
		'/成公|-663~||精=年|卒=前660年|在位=前664年~前660年',
		'/穆公|-659~||精=年|卒=前621年|在位=前659年~前621年',
		'/康公|-620~||精=年|卒=前609年|在位=前620年~前609年',
		'/共公|-608~||精=年|卒=前605年|在位=前608年~前605年',
		'/桓公|-603~||精=年|卒=前577年|在位=前604年~前577年',
		'/景公|-576~||精=年|卒=前537年|在位=前576年~前537年',
		'/哀公|-536~||精=年|卒=前501年|在位=前536年~前501年',
		'/惠公|-500~||精=年|卒=前492年',
		'/悼公|-490~||精=年|卒=前477年|在位=前491年~前477年',
		'/厲共公|-476~||精=年|生=前771?|卒=前443年|在位=前476年~前443年',
		'/躁公|-442~||精=年|卒=前429年|在位=前442年~前429年',
		'/懷公|-428~||精=年|卒=前425年|在位=前428年~前425年',
		'/靈公|-424~||精=年|卒=前415年|在位=前424年~前415年',
		'/簡公|-414~||精=年|生=前428年)|卒=前400年|在位=前415年~前400年',
		'/惠公(戰國)|-399~||精=年',
		'/出子|-386~||精=年|生=前708年|卒=前698年|在位=前703年~前698年',
		'/獻公|-384~||精=年',
		'/孝公|-361~||精=年|生=前381年|卒=前338年|在位=前361年~前338年',
		'/惠文君|-337~||精=年|君主名=嬴駟|生=前356年|卒=前311年|在位=前337年~前311年',
		'/惠文王|-324~||精=年|君主名=嬴駟|君主=秦惠王|生=前356年|卒=前311年|在位=前337年~前311年|注=改侯年為王年',
		'/武王|-310~||精=年|生=前329年 (《史记·卷六·秦始皇本纪》：悼武王生十九年而立。)|卒=前307年|在位=前310年~前307年|注=秦武王二年十一月己酉朔，年始寅正',
		'/=|-309/2/9~|2/=47m|疑|準=年|據=[http://www.bsm.org.cn/show_article.php?id=2372 許名瑲:青川郝家坪秦牘《田律》曆日考釋]|注=以漢傳古《顓頊曆》為基礎，進其月朔餘分470，所得曆日合于牘文“十一月己酉朔”。',
		'/=|-308/1/29~|3/=:CE|精=年',
		'/昭襄王|-306~||君主=秦昭王|君主名=嬴則;嬴稷|精=年|生=前325年|卒=前251年|注=秦昭襄王，簡稱秦昭王。',

		// 朱桂昌(2012/6 中華書局)顓頊日曆表
		'/昭襄王|秦漢歷-290~|17/=:秦漢歷|準=2日',
		'/孝文王|秦漢歷-250~|:秦漢歷|準=2日|君主名=嬴柱|生=前302年 (《史记·卷六·秦始皇本纪》：孝文王生五十三年而立。)|卒=前250年11月14日|在位=前250年11月12日~前250年11月14日',
		'/莊襄王|秦漢歷-249~|:秦漢歷|準=2日|君主名=嬴楚|表字=異人|生=前281年 (《史记·卷六·秦始皇本纪》：庄襄王生三十二年而立。)|卒=前247年7月6日|在位=前250年11月14日~前247年7月6日',

		// 李忠林(2012)秦至汉初(前246至前104)历法研究———以出土历简为中心
		'/秦王政|秦漢歷-246~|:秦漢歷|朝代=東周;戰國|君主名=嬴政;趙政|君主=秦始皇|生=前259年正月|卒=前210年七月丙寅|在位=前247年五月丙午~前210年七月',
		// 秦始皇帝
		'秦/秦始皇|秦漢歷-221~|26/=:秦漢歷|君主=始皇帝|君主名=嬴政;趙政|生=前259年正月|卒=前210年七月丙寅|在位=前247年五月丙午~前210年七月|注=始皇三十一年十二月更名臘曰嘉平。',
		'/秦二世|秦漢歷-209~-207/11/13|:秦漢歷|君主=二世皇帝|君主名=嬴胡亥|生=前230年|卒=前207年 (在世年從《秦始皇本紀》後引《秦記》)|在位=前210年八月~前207年八月|注=秦二世可能改正月為端月。黃一農(2001)秦漢之際（前220-前202年）朔閏考。',
		'/秦王嬰|秦漢歷-207/10~|:秦漢歷|君主=秦王子嬰|君主名=嬴嬰|注=漢元年十月，沛公兵遂先諸侯至霸上。|注=子嬰為秦王四十六日，楚將沛公破秦軍入武關，遂至霸上，使人約降子嬰。',

		// 辛德勇 2008-7-3 重谈中国古代以年号纪年的启用时间
		// 辛德勇 2011-9-5 改订西汉新莽纪年表, 2012-2-20 汉宣帝地节改元事发微
		// "君主=漢高祖" 將會導致搜尋"南漢高祖乾亨1年"時，先符合"漢高祖"，結果就找不到了。
		'西漢/高帝|秦漢歷-206~|:秦漢歷|朝代=漢|廟號=太祖|諡=高皇帝|君主=沛公|君主名=劉邦|表字=季|時期=兩漢|生=前256年10月30日|卒=前195年6月1日|在位=前202年2月28日(改订西汉新莽纪年表:西漢高帝元年二月爲漢王,五年二月即皇帝位)~前195年6月1日',
		'/惠帝|秦漢歷-194~|:秦漢歷|君主名=劉盈|生=前211年|卒=前188年9月26日|在位=前195年6月23日~前188年9月26日',
		'/高后|秦漢歷-187~-180/11/14|:秦漢歷|君主=呂后|君主名=呂雉|表字=娥姁|生=前241年|卒=前180年8月18日|君主性別=女|在位=改订西汉新莽纪年表：西漢惠帝7年8月呂后親政',
		'/前少帝|秦漢歷-187~|:秦漢歷|君主名=劉恭|生=前199年7月|卒=前184年6月15日|在位=前188年九月~前184年八月|注=名不詳，錢穆《國史大綱》作劉恭',
		'/後少帝|秦漢歷-184/5/11~|4/=:秦漢歷|君主名=劉弘|生=前195年3月|卒=前180年11月14日|在位=前184年八月~前180年九月|注=五月丙辰，立常山王義為帝，更名曰弘。不稱元年者，以太后制天下事也。',
		'/文帝/前元|秦漢歷-179~|:秦漢歷|廟號=太宗|諡=孝文帝|君主名=劉恆|生=前203年|卒=前157年7月6日|在位=前180年11月14日~前157年7月6日|注=當時未用年號，年號為後世史籍追記。',
		'/後元|秦漢歷-163~|:秦漢歷|注=孝文本紀:	十七年，得玉杯，刻曰「人主延壽」。於是天子始更為元年，令天下大酺。|注=重谈中国古代以年号纪年的启用时间: 當時未用年號，僅稱改元。目的可能是圖重啟國祚、延年益壽。年號為後世史籍追記。',
		'/景帝/前元|秦漢歷-156~|:秦漢歷|諡=孝景帝|君主名=劉啟|生=前188年|卒=前141年3月9日|在位=前157年7月14日~前141年3月9日|注=當時未用年號，年號為後世史籍追記。',
		'/中元|秦漢歷-149~|:秦漢歷|注=當時未用年號，僅稱改元。年號為後世史籍追記。',
		'/後元|秦漢歷-143~|:秦漢歷|注=當時未用年號，僅稱改元。年號為後世史籍追記。',
		// 西漢於武帝及之後，新王初上常採逾年改元。任內多間隔固定年數改元以示天運，但常於改元當年方詔書今年改元。詔書需花費一二個月傳遞全國，因之此年間不同地公文書兩年號偶並存。之後添補之文書常會回溯新年號至年首，事先已寫就之計畫性文書則可能沿用舊年號。事後歸納總結性文書可能全年或整案件採單一年號，多為新年號。
		'/武帝/建元|秦漢歷-140~|:秦漢歷|廟號=世宗|諡=孝武帝|君主名=劉徹|生=前157年7月14日或前156年春|卒=前87年3月29日|在位=前141年3月9日~前87年3月29日|注=重谈中国古代以年号纪年的启用时间: 當時未用年號，年號為武帝太初後追記往事用。',
		'/元光|秦漢歷-134~|:秦漢歷|注=重谈中国古代以年号纪年的启用时间: 當時未用年號，年號為武帝太初後追記往事用。',
		'/元朔|秦漢歷-128~|:秦漢歷|注=重谈中国古代以年号纪年的启用时间: 當時未用年號，年號為武帝太初後追記往事用。',
		'/元狩|秦漢歷-122~|:秦漢歷|注=重谈中国古代以年号纪年的启用时间: 十月尚未改元。當時未用年號，年號為武帝太初後追記往事用。',
		'/元鼎|秦漢歷-116~|:秦漢歷|注=改订西汉新莽纪年表: 正月以後改元。當時未用年號，年號為武帝太初後追記往事用。',
		'/元封|秦漢歷-110~-104/11/14|:秦漢歷|注=元封七年五月改曆，使用太初曆。|注=雷宝, 詹石窗. 太岁系统差异形成考:以太初曆計算，太初元年前一年(元封七年)歲名當為子，為丙子年，同元封六年。|注=重谈中国古代以年号纪年的启用时间: 當時未用年號，年號為武帝太初後追記往事用。',
		// '/太初|秦漢歷-104~-104/11/14|:秦漢歷',

		'/太初|-104/2/22~|59m 4g4s591 47m|曆法=太初曆|注=太初元年五月改曆，使用太初曆，以建寅之月為歲首。|注=改订西汉新莽纪年表: 改元之初可能還沒使用年號紀年，而是在太初元年五月與改正朔、易服色的改制措施同時實行。|注=據陳久金「敦煌、居延漢簡中的曆譜」說法，太初歷初期依三統曆規定三年一閏，六年二閏，九年三閏的的機械規定，因而出現錯誤，後來發現不符無中氣置閏原則而改正，但之後置閏仍有錯誤。經過二百年的發展，逐步走向完善和嚴格。（見中國古代天文文物論集，文物出版社，1989年）',
		'/天漢|-100/2/8~|59m 4g4j579 47m',
		'/太始|-96/1/25~|4okc3oq 4mg959h|注=陳來瘋: 陳久金《敦煌居延漢簡中的曆譜》相關考証: 《漢書五行志》太始四年十月甲寅晦，日有食之。劉次沅《諸史天象記錄考証謂》謂後世所推曆表與當時實行曆不符。',
		'/征和|-92/2/9~-88/10/18|47o 4ok542y 59h 3qtt|年號=延和|注=改订西汉新莽纪年表: 居延漢簡有征和五年正月庚申朔庚、（後元）元年九月丙戌朔丙戌。',
		'/後元|-88/1/26~|3qtt47p|注=西漢武帝後元二年二月戊辰，太子即皇帝位。明年改元始元。|注=改订西汉新莽纪年表: 當時未用年號，僅稱改元。年號為後世史籍追記。',
		'/昭帝/始元|-86/2/3~|3mmy46i 59l 3quf505 46i 4oiq|諡=孝昭帝|君主名=劉弗陵|生=前94年|卒=前74年6月5日|在位=前87年3月30日~前74年6月5日|注=漢昭帝始元七年置閏新研: 始元七年八月，改始元為元鳳。始元七年置閏未定。亦可能閏三月。',
		'/元鳳|-80/9/21~|8=4oiq59m 3quj579 47m 4ojs',
		'/元平|-74/2/21~|59m|注=昭帝元平元年四月癸未，昭帝於未央宮暴病而死。七月漢宣帝即位沿用',
		'/昌邑王/=|-74/7/18~|6=59m|君主名=劉賀|君主=海昏侯|生=前92年7月25日|卒=前59年|在位=昭帝元平元年六月丙寅即天子位~昭帝元平元年六月癸巳廢黜',
		'/宣帝/=|-74/9/10~|/7/25=59m|廟號=中宗|諡=孝宣帝|君主名=劉詢;劉病巳|表字=次卿|生=前91年|卒=前48年1月10日|在位=前74年9月10日~前48年1月10日|注=西漢元平元年七月庚申，武帝曾孫病已即皇帝位。明年改元本始。',
		'/本始|-73/2/10~-68/6/25|579 3ql147o 59m 4mg1591|注=汉宣帝地节改元事发微: 漢宣帝在本始六年五月追改本始五年爲地節元年、本始六年爲地節二年',
		'/地節|-69/1/27~-65/6/8|4mg1591 3qu147p 3oq|注=應劭曰：「以先者地震，山崩水出，於是改年曰地節，欲令地得其節。」本始四年夏四月壬寅，郡國四十九地震，或山崩水出|注=汉宣帝地节改元事发微: “地節二年五月乙亥造”錢範是行用“地節”年號最早的實物證據，而且出自京師城垣之內。',
		// 羅振玉和王國維在《流沙墜簡》一書中最先將這類殘簡稱為“曆譜”，計有“元康三年曆譜”、“神爵三年曆譜”、“五鳳元年八月曆譜”
		// 47e 4ojs59m 579 3ql147o 59m 4g4h47e 4oju59m 505 3ql447m 59m 4g4l591
		// 47m 4ok13oq 4mg959h
		'/元康|-65/2/11~-61/7/23|3oq 4o1359l 47p 39zn|注=汉宣帝地节改元事发微: 元年3月下詔，4月改元行用，慶霍氏亂去，天下歸小康。|注=《元康五年詔書》（居延漢簡10.27）有「元康五年五月二日壬子日夏至」',
		'/神爵|-61/3/28~|3=39zn46i 4ofg59m|注=Wikipedia: 元康五年二月改元，三月使用神爵年號。',
		// 甘肅肩水金關遺址所出五鳳三年曆譜
		'/五鳳|-57/2/13~-53/6/25|47p 3pso47e 59m 3qud|注=冊府元龜卷15: 東漢應劭: 先者鳳凰五至，因以改元云',
		'/甘露|-53/1/30~-49/4/13|3qud505 47e 4ojm59m|注=汉宣帝地节改元事发微: 元年4~5月改元',
		'/黃龍|-49/2/15~|59m|注=冊府元龜卷15: 此年二月黃龍見廣漢郡故改元',
		'/元帝/初元|-48/2/3~-43/3/8|4g4q591 47m 4ok63oq 591|廟號=高宗|諡=孝元帝|君主名=劉奭|生=前76年|卒=前33年|在位=改订西汉新莽纪年表：黃龍1年12月~竟寧1年6月|注=後除廟號',
		'/永光|-43/2/8~-38/10/6|591 3qs347p 39zw42y 59h|注=汉宣帝地节改元事发微: 張德芳文只提供有初元六年正月的用例，而西漢銅器中有一件銅弩 機郭，上面銘文鐫作“永光元年七月廿日右尚方造”改元永光的時間，至遲不得晚于七月。|注=《永光五年曆譜》釋文：永光五年 正月乙巳朔大 二月乙亥朔小二日丙子春分 三月甲辰朔大十九日壬辰立夏 四月申戌朔大（以上為簡A面第一欄） 五月甲辰朔小四日丁未夏至 六月癸酉朔大八日庚辰初伏十八日庚寅中伏廿一日癸已   立秋 七月癸卯朔小八日庚戌後伏 八月壬申朔大八日己卯秋分（以上為簡A面第二欄）］［九月壬寅朔小廿三日甲子立冬  □高五尺 十月辛未朔大 十一月辛丑朔小十日庚戌冬至 十二月庚午朔大十七日丙戌臘廿七日丙申立春己亥晦（《敦煌》1560A/B）;《永元六年曆譜》釋文：十二月大 □日癸丑建大寒 □日甲寅除八魁 …□（以上為簡A面第一欄） 十六日戊辰平全 十七日己巳平全八魁 十八日庚午定反支□ 十九日辛未執（以上為簡A面第二欄） 七月廿七日壬午開天李  廿八日癸未閉反支 廿九日甲申建□ 卅日乙酉除（以上為簡A面第三欄）］［十日癸巳執□□  廿二日乙巳 十一日甲午破血忌天李  廿三日丙 □二日乙未危白□□□《敦煌》1968A/B',
		'/建昭|-38/2/13~|59h 3qug47p 42y 4of8|注=汉宣帝地节改元事发微: 元年7~8月改元',
		'/竟寧|-33/2/18~|59l|注=六月漢成帝即位沿用',
		'/成帝/建始|-32/2/6~-28/6/19|47p 3mmp47e 4oiy59m|廟號=統宗|諡=孝成帝|表字=太孫|君主名=劉驁|生=前51年|卒=綏和2年4月|在位=改订西汉新莽纪年表：竟寧元年六月~成帝綏和二年四月|注=汉宣帝地节改元事发微: 可能是在竟寧元年七月“大赦天下”的時候頒布詔書，宣布預定翌年改元爲建始，不然僻在居延，不可能這麽快就接到朝廷詔命。|注=後除廟號',
		'/河平|-28/2/22~|59m 505 3psm47m|注=汉宣帝地节改元事发微: 成帝建始五年三月因“河决東郡，流漂二州，校尉王延世塞輒平”，下詔改元，張文謂建始五年簡最晚見于是年四月',
		'/陽朔|-24/2/8~-20/7/20|59m 4g4j579 3qsc47o',
		'/鴻嘉|-20/2/23~-16/8/4|47o 59m 4mg859h 47o|注=汉宣帝地节改元事发微: 元年4~5月改元',
		'/永始|-16/2/9~-12/9/18|47o 4ok542y 591 3qtt|注=汉宣帝地节改元事发微: 元年5~6月改元，七月之後永始|據=[http://blog.sina.com.cn/s/blog_a2e8e3c60102y7hz.html 陳來瘋: 陳久金《敦煌居延漢簡中的曆譜》相關考証]|注=據《中國簡牘集成》（敦煌文藝出版社，2001年）第9冊頁38「永始二年五月乙酉朔丙午」、頁75「永始二年六月甲申」及第10冊頁25「永始二年七月癸丑朔庚辰」來推算，漢成帝永始二年應為閏五月，陳的閏四月說顯然有誤。',
		'/元延|-12/1/26~-8/6/8|3qtt47p 3mmy46i 59l|注=汉宣帝地节改元事发微: 元年6~7月改元',
		'/綏和|-8/2/11~|59l 3qug|注=二年四月漢哀帝即位沿用|注=汉宣帝地节改元事发微: 元年4月改元|注=陳來瘋: 陳久金《敦煌居延漢簡中的曆譜》相關考証: 《天象》為綏和二年閏七月。未找到相關竹簡朔日',
		'/哀帝/建平|-6/2/19~-1/3/23|47p 46i 4oir59m 3quk579|諡=孝哀帝|君主名=劉欣|生=前27年|卒=元壽2年9月|在位=改订西汉新莽纪年表：綏和2年4月~元壽2年9月|注=二年六月改元太初元將，同年八月又改回建平二年|注=汉宣帝地节改元事发微: 簡牘最晚建平六年正月',
		'/太初元將|-5/7/5~-5/10/1|6=46i|據=改订西汉新莽纪年表|注=汉宣帝地节改元事发微: 哀帝建平二年六月甲子改元爲太初元將，未幾復於八月下詔廢止太初元將，重稱建平二年',
		'/元壽|-2/2/5~|3quk579|年號=元受|注=二年九月漢平帝即位沿用|注=改订西汉新莽纪年表: 元年12月~閏12月改元. 汉宣帝地节改元事发微: 陳垣等過去推算元壽元年閏十一月，陳夢家則依據漢簡所反映的實際情况，確定本年閏十二月，故張氏新增的材料，應是進一步加大了在閏十二月改元元壽的可能性。',
		'/平帝/元始|1/2/12~6/3/18|47e 4ojs59m 579 3ql147o|廟號=元宗|諡=孝平帝|君主名=劉衎;劉箕子|生=前9年|卒=6年2月3日|在位=前1年10月17日~6年1月4日|注=居延漢簡中這個年號被用至元始二十六年|注=改订西汉新莽纪年表: 元始5年12月王莽攝政，稱假皇帝或攝皇帝. 汉宣帝地节改元事发微: 居延新簡有“元始六年二月丁亥居延甲渠候放免冠叩頭死罪死罪敢言之”云云，應屬奉詔改元之前的文牘|注=後除廟號',
		'/孺子嬰/居攝|6/2/17~|47o 59m 4g4h|年號=居聑|君主名=劉嬰|生=5年|卒=25年|在位=6年~8年十一月|注=《肩水金關漢簡（貳）》：居聑（攝）三年十月甲戌朔壬午...|注=改订西汉新莽纪年表: 3月立劉嬰爲皇太子，號孺子。|注=肩水金關漢簡《元始六年(居攝元年)磿日》簡冊再復原: 天正子月入甲子統壬午章第15年',
		'/初始|9/1/6~|/11/21=9|年號=始初|注=张小锋(2006)“初始”年号始用时间辨析；認為初始年號始於居攝三年十一月廿一日（9年1月6日），只使用了9天。|注=汉宣帝地节改元事发微: 敦煌簡牘中另有題作“●居攝三年十一月 ”者，顯示出直到本月，敦煌還沒有奉召改元。',

		'新/王莽/始建國|9/1/15~14/4/18|47e 4ojv59m 505 3ql447m|君主名=王莽|君主=新莽|表字=巨君|年號=建國|時期=兩漢|生=前45年|卒=23年10月6日|在位=8年~23年',
		'/始建國天鳳|14/1/20~|47m 59m 4g4l591 47m 4ok1|年號=天鳳;始建國天鳳上戊|注=汉宣帝地节改元事发微: 陳夢家推斷在始建國天鳳元年正、二月間， 但《漢書·王莽傳》明確記載這次改元確定于始建國五年年末，翌年從正月元旦起即行用始建國天鳳年號，...新莽簡所見之“始建國六年二月”，應該屬正常的現象',
		'/始建國地皇|20/1/14~23/11/1|3oq 4mg959h 47o|年號=地皇;始建國地皇上戊',

		'更始朝/淮陽王/更始|23/3/11~25/11/9|2=3oq 3qud500|諡=武順王|君主名=劉玄|表字=聖公|君主=更始帝|朝代=玄漢|時期=兩漢|卒=25年|在位=23年二月~25年九月|注=更始二年復寅正。',

		// 玄漢時期建立的其他政權的年號, 新朝之後，更始至東漢初建立的各政權年號
		'東漢/盧芳|25/11/10~|:東漢|疑|君主=西平王;上將軍;漢皇帝|君主名=盧芳|字=君期|注=更始政權滅亡後，三水的豪傑擁立自稱漢朝皇族的盧芳為上將軍、西平王，與西羌、匈奴締結和約。',
		'/代王|40/2/2~42/2/8|:東漢|疑|君主名=盧芳|注=建武十六年，盧芳入居代郡高柳縣，以閔堪之兄閔林為使者，向光武帝表示投降。光武帝封盧芳為代王，閔堪為代相，閔林為代國太傅，盧芳負責漢朝與匈奴修好的事務。十七年，盧芳入朝，在向洛陽途中，光武帝下詔命盧芳延期至明年（十八年）入朝。盧芳疑心皇帝猜忌，在代地再反漢朝，與閔堪、閔林在高柳縣互相攻打數月，匈奴派兵將其與妻室接走，盧芳入匈奴十數年病死。',

		'赤眉/劉盆子/建世|25/7/15~27/3/26|:東漢|疑|生=10年|君主名=劉盆子|時期=兩漢|年號=建始|注=赤眉軍議立皇帝時，首領樊崇將劉盆子立為皇帝. 後漢書/卷11: 六月，遂立盆子為帝，自號建世元年。',

		'成家/公孫帝/龍興|25/5/17~37/1/5|:兩漢|疑|卒=成家龍興12年11月|君主名=公孫述|字=子陽|時期=兩漢|注=後漢書/卷13: 文曰『公孫帝』。建武元年四月，遂自立為天子，號成家。色尚白。建元曰龍興元年。',
		'東漢/西州大將軍/漢復|23/8/6~|:兩漢|疑|君主=朔寧王|君主名=隗囂|卒=建武九年春|字=季孟|年號=復漢;朔寧|注=建武七年，隗囂稱臣於述，公孫述以囂為朔寧王|注=十一年隗純沿用',
		'成家/朔寧王/漢復|33/2/18~34/11/29|:東漢|疑|君主名=隗純|卒=42年|注=後漢書/卷13: 建武九年春，囂病且餓，出城餐糗糒，恚憤而死。 王元、周宗、行巡、高峻、苟宇、趙恢等人立囂少子純為朔寧王。 建武十年十月，來歙在落門聚（天水郡冀縣）大敗隗純，隗純投降，漢朝平定隴右。',

		'東漢/光武帝/建武|25/7/15~|6=385 47e 4oip59m 4g4q591 47m 4ok63oq 579 3qs347p 39zw42y 59h 3qu047p 42y 4of859l 47p 3mmp46i 4oiy59m 505 3psm47m 59m 3qub579 3y8|廟號=世祖|君主名=劉秀|表字=文叔|朝代=漢|時期=兩漢|生=前5年1月15日|卒=57年3月29日|在位=25年8月5日~57年3月29日',
		'/建武中元|56/5/4~|4=31i447o|年號=中元|注=二年二月漢明帝即位沿用',
		'/明帝/永平|58/2/13~|59m 4mg9591 47o 4ok542y 591 3qtt47p 39zu46i 59l 3quf47p 46i 4of759m 3quj|廟號=顯宗|諡=孝明帝|君主名=劉莊;劉陽|表字=子麗|生=28年6月15日|卒=75年9月5日|在位=57年3月29日~75年9月5日|注=十八年八月漢章帝即位沿用',
		'/章帝/建初|76/2/24~|579 47e 4ojs59m 505 3ql147o 59m 4g01|廟號=肅宗|諡=孝章帝|君主名=劉炟|生=57年|卒=88年4月9日|在位=75年9月5日~88年4月9日',
		'/元和|84/9/19~|8=362 5sl 3mmy474|注=漢章帝元和2年1月依 太初元年至元和二年朔闰表 改壬午朔。',
		'/章和|87/8/17~|7=362 59l|注=二年二月漢和帝即位沿用',
		'/和帝/永元|89/1/30~|3quf505 46i 4oir59m 4g4r579 47m 4ojs59m 579 3qs547o 59m 4mg15dx 3y8|廟號=穆宗|諡=孝和帝|君主名=劉肇|生=79年|卒=106年2月13日|在位=88年4月9日~106年2月13日',
		'/元興|105/5/2~|4=31jt',
		'/殤帝/延平|106/2/21~|47p|諡=孝殤帝|君主名=劉隆|生=105年|卒=106年9月21日|在位=106年2月13日~9月21日|注=八月漢安帝即位沿用',
		'/安帝/永初|107/2/10~|42y 4o1359l 47p 39zo46i 4oj0|廟號=恭宗|諡=孝安帝|君主名=劉祜|生=94年|卒=125年4月30日|在位=106年9月21日~125年4月30日',
		'/元初|114/2/23~|59m 47p 3pso47e 59m 3qud54w',
		'/永寧|120/5/15~|4=385 474|年號=永甯|注=三國志：年號永甯',
		'/建光|121/8/1~|7=362 4kci',
		'/延光|122/4/24~125/5/19|3=3f8 59m 4g4q54w|注=四年三月北鄉侯劉懿即位沿用；同年十一月漢順帝即位沿用',
		'/北鄉侯/延光|125/4/21~|4/3/=3o5|君主=前少帝|君主名=劉懿;劉犢|在位=125年5月18日~125年12月10日',
		'/順帝/永建|126/2/10~|47o 4ok63oq 591 3qs347p 35s|廟號=敬宗|諡=孝順帝|君主名=劉保|生=115年|卒=144年9月20日|在位=125年12月16日~144年9月20日',
		'/陽嘉|132/4/4~|3=39zw46i 59h 3qug',
		'/永和|136/2/20~|47p 42y 4of859m 47p 3mmp',
		'/漢安|142/2/13~|47e 4oiy54w',
		'/建康|144/5/20~|4=3ai|注=八月漢沖帝即位沿用',
		'/沖帝/永憙|145/2/10~|505|諡=孝沖帝|君主名=劉炳|生=143年|卒=145年2月15日|在位=144年9月20日~145年2月15日|年號=元嘉;永嘉;永熹|注=正月漢質帝即位沿用|注=《後漢書》作「永嘉」；《後漢紀》作「元嘉」。何焯考證應為永憙。',
		'/質帝/本初|146/1/30~|3ql2|諡=孝質帝|君主名=劉纘;劉續|注=閏六月漢桓帝即位沿用',
		'/桓帝/建和|147/2/18~|47m 59m 4g4j|廟號=威宗|諡=孝桓帝|君主名=劉志|生=132年|卒=168年1月25日|在位=146年8月1日~168年1月25日',
		'/和平|150/2/15~|591',
		'/元嘉|151/2/4~|3qsc47p 3k0',
		'/永興|153/6/10~|5=3ai 4mg9',
		'/永壽|155/2/20~|59h 47p 39zp41s',
		'/延熹|158/7/14~|6=36y 59h 3qtt47p 3mmy47e 59l 3quf505 45c',
		'/永康|167/7/5~|6=36y',
		'/靈帝/建寧|168/1/28~|4oir59m 4g4r579 45c|諡=孝靈帝|君主名=劉宏|生=156年|卒=189年5月13日|在位=168年2月17日~189年5月13日',
		'/熹平|172/6/9~|5=382 4ojs59m 579 3qs547o 4qo',
		'/光和|178/4/6~|3=3oq 4mg1591 3qu147p 42y 4o13',
		'/中平|185/1/19~|12=35s 59l 47p 39zo46i 54w|注=中平元年黃巾軍起事後，韓遂、馬騰據涼州大亂，宋建據枹罕自號「河首平漢王」，改年號，置百官，割據三十餘年。建安十九年十月，曹操派遣夏侯淵自興國討宋建，屠枹罕，斬宋建。',
		'/少帝/光熹|189/5/3~|4=3a8|諡=懷王|君主=弘農王;弘農懷王|君主名=劉辯|生=176年|卒=190年3月6日|在位=189年5月15日~189年9月28日',
		'/昭寧|189/8/29~|8=35s',
		'/獻帝/永漢|189/9/28~|9=360|諡=孝獻帝;孝愍帝|君主名=劉協|表字=伯和|生=181年|卒=234年4月21日|在位=189年9月27日~220年11月25日',
		'/中平|189/12/26~|6/12/=2t64|注=後漢書獻帝紀 十二月，詔除光熹、昭寧、永漢三號，復稱中平六年',
		'/初平|190/2/23~|59m 47p 3pso47e',
		'/興平|194/2/9~|59m 3qud',
		'/建安|196/2/17~|579 47e 4ojm59m 4g4q591 47o 4ok63oq 591 3qs347p 39zw46i 59h 3qug47p 42y 4of859m 47p 3mmp47e 4oiy4qo',
		'/延康|220/4/21~220/11/12|3=3oo',

		// 東漢時期建立的其他政權的年號
		'東漢/張曼成/神上|184/2/29~184/7/25|:中國|疑|據=Wikipedia|注=漢靈帝光和七年二月（184年），太平教大方（總指揮官）馬元義事敗被捕於洛陽車裂，黃巾之亂時南陽黃巾軍首領張曼成聞訊立即率眾在南陽起兵。三月庚子日擊斬南陽郡守褚貢後，屯兵宛縣（南陽郡政府所在地）城下百餘日；六月，遭新任南陽郡長秦頡反攻擊斬。《後漢書》和《資治通鑒》都未言建年號之事，李兆洛《紀元編》載：「張曼成，神上。」其注云「見《類聚考》，不知所本。」',

		// 魏晉南北朝,三國兩晉南北朝/三國時期

		'蜀/昭烈帝/章武|221/5/10~|4=3f9 3ql245c|君主名=劉備|表字=玄德|朝代=蜀漢|時期=三國|生=161年|卒=223年6月10日|在位=221年四月~223年6月10日',
		'/後主/建興|223/6/16~|5=382 59m 4g4j591 3qsc47p 3oq 4mg959h 47p 39zp42y 59h 3qtt47p|君主名=劉禪|表字=公嗣|諡=思公;孝懷皇帝;懷帝|生=207年|卒=271年|在位=223年~263年',
		'/延熙|238/2/2~|3mmy47e 59l 3quf505 46i 4oir59m 4g4r579 47m 4ojs59m 579 3qs547o 59m 4mg1591 3qu1',
		'/景耀|258/2/21~|47p 42y 4o1359l 47p 39qc',
		'/炎興|263/9/21~264/1/16|8=36c',

		// 羅新：走馬樓吳簡中的建安紀年簡問題
		// 孫權與魏決裂之後，對於自己曾經奉行黃初年號一定是有所忌諱的，何況與曹魏的敵對關係也不允許再在文書中提到這一年號，因此，在追述公元220至223年之間的往事時，使用何種紀年方法，一定是經過了認真考慮的。我認為，延長建安以銜接黃武，是孫吳官方的政策，在孫吳境內要普遍遵守。這就是今天我們在文獻上看到建安二十五、二十六、二十七紀年的來歷，同樣也是吳簡中出現這些建安紀年簡的原因。
		'吳/大帝/黃武|222/11/22~|10=35x 59l 47p 39zo46i 4oj059m 4qo|廟號=太祖|君主名=孫權|表字=仲謀|朝代=孫吳|時期=三國|生=182年|卒=252年|在位=229年~252年',
		'/黃龍|229/5/11~|4=3f9 3pso47m',
		'/嘉禾|232/2/9~|59m 4g4l579 47m 4ok23oq 56o',
		'/赤烏|238/8/28~|8=2tnu59h 47p 39zq42y 59h 3qtv47p 3mn047m 59m 3qug505 45c',
		'/太元|251/6/6~|5=37u 4qo',
		'/神鳳|252/2/27~|2=3k0',
		'/會稽王/建興|252/4/26~|4=2xc459m|君主=吳廢帝|君主名=孫亮|表字=子明|生=243年|卒=260年|在位=252年~258年',
		'/五鳳|254/2/5~|579 3qkx47k',
		'/太平|256/11/5~|10=35w 4oka42w',
		'/景帝/永安|258/11/13~|10=35u 591 3qtz47p 42y 4o0z58g|君主名=孫休|表字=子烈|生=235年|卒=264年|在位=258年~264年',
		'/末帝/元興|264/8/10~|7=36x 3y8|君主=吳後主;烏程侯;歸命侯|君主名=孫皓;孫彭祖|表字=元宗;皓宗|生=242年|卒=284年|在位=264年~280年5月1日|注=幼名彭祖',
		'/甘露|265/5/3~|4=31kb4zk',
		'/寶鼎|266/9/17~|8=36d 46i 4oiw59k',
		'/建衡|269/11/11~|10=35u 505 3psl|生=1988年2月28日',
		'/鳳凰|272/2/16~|47m 59m 4g4h',
		'/天冊|275/2/13~|591 474',
		'/天璽|276/7/28~|7=2tlm',
		'/天紀|277/2/20~280/5/15|47p 3oq 4o1354w',

		// 晉書/卷017: 黃初三年十一月二十九日庚申加時西南維日蝕 疑應為"三十日"
		'魏/文帝/黃初|220/11/13~|10=35u 505 3ql247m 59m 4g4j591|廟號=世祖|君主名=曹丕|表字=子桓|朝代=曹魏|時期=三國|生=187年|卒=226年6月29日|在位=220年11月25日~226年6月29日|注=七年五月魏明帝曹叡即位沿用|注=魏武王曹操子',
		'/明帝/太和|227/2/4~|3qsc47p 3oq 4mg959h 47p 35s|廟號=烈祖|君主名=曹叡;曹睿|表字=元仲|正統=中國|生=206年|卒=239年1月22日|在位=226年~239年',
		'/青龍|233/2/27~|2=39zp42y 59h 3qtt3y8|正統=中國',
		// https://zh.wikisource.org/wiki/%E5%85%A8%E4%B8%89%E5%9C%8B%E6%96%87/%E5%8D%B711#.E5.BE.A9.E7.94.A8.E5.A4.8F.E6.AD.A3.E8.A9.94
		'/景初|237/4/13~|4=3bp 3ql7	30;29;30;29;30;29;30;29;30;29;30;30;後12=29|注=青龍五年三月改元並改用景初歷，以建丑之月為正月。因此青龍五年三月則成為景初元年四月。|注=復用夏正詔（《魏志‧齊王芳紀》，又見《冊府元龜》四）：魏少帝十二月，詔曰：「烈祖明皇帝以正月棄背天下，臣子永惟忌日之哀，其復用夏正；雖違先帝通三統之義，斯亦禮制所由變改也。又夏正於數為得天正，其以建寅之月為正始元年正月，以建丑月為後十二月。」|注=三年正月齊王曹芳即位沿用',
		'/齊王/正始|240/2/10~|47p 3mmu46i 59l 3qub505 3pss47m 59m 4qo|正統=中國|諡=厲|君主=少帝|君主名=曹芳|表字=蘭卿|君主=少帝;廢帝;邵陵厲公|生=232年|卒=274年|在位=239年~254年',
		'/嘉平|249/4/30~|4=31k9591 47m 4ok53oq 58w',
		'/高貴鄉公/正元|254/10/29~|10=35x 3qs145c|表字=彥士|君主名=曹髦|生=241年11月15日|卒=260年6月2日|在位=254年~260年',
		'/甘露|256/7/10~|6=385 39zu46i 59h 45c',
		'/元帝/景元|260/6/26~|6=2v8n47p 46i 4of754w|君主名=曹奐;曹璜|表字=景明|生=246年|卒=303年|在位=260年~265年',
		'/咸熙|264/6/12~266/2/7|5=3ai 3quj|注=泰始元年冬十二月丙寅...升壇受禪...於是大赦，改元',

		// 曹魏統治地區出現的其他割據勢力的年號
		'/燕王/紹漢|237/7/10~238/8/27|:魏|疑|君主名=公孫淵|政權=燕;燕國|據=Wikipedia|卒=238年|在位=237年~238年|注=景初元年（237年），魏派出幽州刺史毌丘儉攻公孫淵，久戰不利回師。公孫淵即自立為燕王，改元紹漢，引誘鮮卑侵擾北方。景初二年（238年）正月向東吳稱臣。同年春，魏又派司馬懿和高句麗王高位宮攻公孫淵，圍城日久，公孫淵於八月糧盡出逃被擒斬。',

		// 魏晉南北朝,三國兩晉南北朝/兩晉

		'西晉/武帝/泰始|266/2/8~|/12/17=3quj579 47e 4ojs59m 579 3ql147o 59m 4mg1|廟號=晉世祖|君主=晉武帝|君主名=司馬炎|表字=安世|時期=兩晉|生=236年|卒=290年5月16日|在位=266年2月4日~290年5月16日|建正=寅|注=泰始元年冬十二月丙寅...升壇受禪...於是大赦，改元',
		'/咸寧|275/2/13~|591 3qu147p 3oq 4o1354w',
		'/太康|280/5/16~|4=3ah 47p 3mms46i 4oj059m 505 3pso47m 59m',
		'/太熙|290/1/28~|4qo',
		'/惠帝/永熙|290/4/27~|4=31k5|君主=晉惠帝|君主名=司馬衷|表字=正度|生=259年2月13日|卒=307年1月8日|在位=290年5月16日~307年1月8日',
		'/永平|291/2/16~|4qo',
		'/元康|291/4/16~|3=3md 47m 4ok23oq 4mga59h 47p 39zq42y',
		'/永康|300/2/7~|59h 3oqr',
		'/永寧|301/5/24~|4=3ai 47o',
		'/太安|303/1/5~|12=35t 3mn0|年號=大安',
		'/永安|304/2/22~|47e',
		'/建武|304/8/17~|7=47e',
		'/永安|304/12/14~|11=47e|注=永安元年七月改元建武元年，同年十一月復稱永安，次月又改元為永興元年。',
		'/永興|305/1/12~|12=47e 59m 45c',
		'/光熙|306/6/28~|6=2v8o|注=十一月晉懷帝即位沿用',
		'/懷帝/永嘉|307/2/19~|505 47e 4ojo59m 505 3qkx47p|君主=晉懷帝;孝懷帝|君主名=司馬熾|表字=豐度',
		'/愍帝/建興|313/5/12~317/3/28|4=47p 3mmy3oq 591 3qtz|君主名=晉愍帝;司馬鄴;司馬業|表字=彥旗|生=300年|卒=318年2月7日|在位=313年6月7日~316年12月11日|注=也有只記到晉愍帝投降前趙時的建興四年。前涼多位君主沿用該年號',

		// 西晉統治地區出現過的其他年號
		'/趙廞/太平|300/12/28~301/2/24|:西晉|疑|據=Wikipedia|君主名=趙廞|注=《晉書·惠帝紀》：永康元年十二月「益州刺史趙廞與洛陽流人李庠....據成都反。」《資治通鑒》考異：「《晉春秋》云『建號太平元年』。他書無之。」',
		'/司馬倫/建始|301/1/26~6/22|:西晉|疑|據=Wikipedia|君主名=司馬倫|卒=301年4月13日|在位=301年1月~301年4月|注=《晉書·惠帝紀》記載：永寧元年正月趙王倫篡帝位。《趙王倫傳》說篡帝位，大赦，改元建始。',
		'張漢/劉尼/神鳳|303/6/2~9/27|:西晉|疑|據=Wikipedia|時期=兩晉|君主名=丘沈|君主名=張昌|注=義陽蠻首領張昌以山東縣吏丘沈為天子，更名為劉尼，稱國號「漢」。建元神鳳。',

		'東晉/元帝/建武|317/3/29~|3=3qtz47p|廟號=中宗|君主=晉元帝|君主名=司馬叡;司馬睿|表字=景文|時期=兩晉',
		'/太興|318/4/17~|3=47p 3oq 4o0z59l|年號=大興',
		'/永昌|322/2/3~|3quj3y8|注=閏十月晉明帝即位沿用',
		'/明帝/太寧|323/4/22~|3=3f9 46i 4oiw4qo|廟號=肅宗|君主=晉明帝|君主名=司馬紹|表字=道畿|生=299年|卒=325年|在位=323年~325年|注=三年閏八月晉成帝即位沿用',
		'/成帝/咸和|326/3/20~|2=3oq 47p 3psl47m 59m 3qu9579 3qsa47o|君主=晉成帝|廟號=顯宗|君主名=司馬衍|表字=世根',
		'/咸康|335/2/10~|59m 4mg759h 47o 4ok442y 4ofg59l|注=八年六月晉康帝即位沿用',
		'/康帝/建元|343/2/11~|47p 3mmw|君主=晉康帝|君主名=司馬岳|表字=世同|注=二年九月晉穆帝即位沿用',
		'/穆帝/永和|345/2/18~|47e 59l 3qud505 47e 4oiq59m 4g4q591 47m 4ok63oq|君主=晉穆帝|廟號=孝宗|君主名=司馬聃|表字=彭祖|生=343年|卒=361年|在位=344年~361年',
		'/升平|357/2/6~|591 3qs347p 39zw46i|注=五年五月晉哀帝即位沿用。前涼沿用該年號. 中華書局《晉書》第01冊第202頁:非"昇平"',
		'/哀帝/隆和|362/2/11~364/4/17|59h 3qug47p|君主名=司馬丕|表字=千齡|年號=崇和',
		'/興寧|363/1/31~|3qug47p 46i|注=興寧元年二月改元興寧。二年三月庚戌朔、庚戌土斷頒布。八月，前燕奪取洛陽。三年二月，哀帝死；廢帝司馬奕即位，沿用至明年改元太和。',
		// TODO: 海西公太和四年閏月乙亥: 閏二月25日?
		'/海西公/太和|366/1/28~|4of859m 47p 3psh47m 4oju|君主名=司馬奕|表字=延齡|君主=海西縣公;廢帝|生=342年|卒=386年|在位=365年~371年',
		'/簡文帝/咸安|371/12/23~|11=35s 59m|廟號=中宗|君主名=司馬昱|表字=道萬|注=二年七月晉孝武帝即位沿用',
		'/孝武帝/寧康|373/2/9~|579 3qs747o|廟號=烈宗|君主=晉孝武帝|君主名=司馬曜;司馬昌明|表字=昌明|注=《魏書》錯寫作康寧',
		'/太元|376/2/7~|59m 4mg359h 3qu447p 42y 4ofd59l 47p 3mmt47e 59l 3qu9505 3ql647m 59m 4g4n591 47m 4ok3|注=二十一年九月晉安帝即位沿用',
		'/安帝/隆安|397/2/13~|3oq 4o1759h 47p 39zs|君主=晉安帝|君主名=司馬德宗|表字=安德|年號=崇安|生=382年|卒=419年1月28日|在位=397年~419年',
		'/元興|402/2/18~|46i 59h 3qud|注=胡三省注《資治通鑑》：元年三月，元顯敗，復隆安年號。桓玄尋改曰大亨。玄篡，又改曰永始。',
		'/義熙|405/2/15~|47p 46i 4of659m 3qui579 47e 4ojq59m 579 3qkz47o 4okc42y',
		'/恭帝/元熙|419/2/11~420/5/27|591 45c|君主=晉恭帝|君主名=司馬德文',
		// 東晉統治地區出現的其他年號
		'/元王/建康|319/5/6~320/7/21|:東晉|疑|據=Wikipedia|君主=南陽王;晉王|諡=元王|君主名=司馬保|表字=景度|生=296年|卒=320年|注=司馬保故將陳安滅張春、楊次，將司馬保以天子之禮葬於上邽，並諡為元王。',
		'/聖王/鳳凰|370/9/7~370/11/4|:東晉|疑|據=Wikipedia|君主名=李弘|君主名=李金銀|生=652年|卒=675年|注=《晉書·廢帝紀》作九月反；《資治通鑒》作八月反，九月平。|注=李金銀指使廣漢李弘詐稱是成漢末代皇帝李勢的兒子，聚集了一萬多兵眾反晉，李弘自稱聖王，年號為鳳凰。九月，益州刺史周楚派孫子梓潼太守周虓討伐平定了李弘、李金銀之亂。',

		'/桓玄/大亨|402/4/18~403/2/7|3=:東晉|君主名=桓玄;桓靈寶|表字=敬道|諡=武悼皇帝|據=Wikipedia|生=369年|卒=404年6月19日|在位=403年~404年|注=桓玄在三月攻入建康時就廢除了元興年號，恢復隆安年號，不久又改元大亨。',
		'桓楚/=/永始|404/1/1~|/12/3=:東晉|據=Wikipedia|時期=兩晉|注=桓玄於十二月壬辰日（404年1月1日）正式登位為帝，並改元「永始」|注=根據《晉書》記載，桓玄最初改元「建始」，因為和趙王司馬倫同，改為永始。',
		'/桓謙/天康|404/6/20~405/4/14|:東晉|君主名=桓謙|表字=敬祖|據=Wikipedia|年號=天安',

		// 魏晉南北朝,三國兩晉南北朝/五胡十六國(兩晉十六國,東晉十六國)

		// 成
		// TODO: import 備註 from
		// https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9B%BD%E5%B9%B4%E5%8F%B7%E5%88%97%E8%A1%A8
		'成漢/始祖/建初|303/2/3~|:中國|疑|國號=成|時期=五胡十六國|注=李特之子李雄稱王時，追諡李特為成都景王，等到稱帝時，再追諡為景皇帝，廟號為始祖。|據=時間規範資料庫',
		'/太宗/建興|304/11/14~311/3/5|10=:中國|疑|君主=成武帝|諡=武皇帝|廟號=太宗|君主名=李雄|表字=仲雋',
		'/晏平|306/6/28~|6=:中國|疑|年號=宣平',
		'/玉衡|311/3/6~|2=:中國|疑|注=二十四年六月李班即位沿用，十月李期即位沿用',
		'/哀帝/=|334/8/11~|24/6/25=:中國|疑|諡=哀皇帝|君主名=李班|表字=世文|生=288年|卒=334年|在位=334年~334年|注=資治通鑑/卷095。(東晉成帝咸和九年六月)丁卯，雄卒，太子班即位。',
		'/幽公/玉恆|335/3/11~|2=:中國|疑|君主名=李期|表字=世運|諡=成廢帝|年號=玉恒|生=314年|卒=338年|在位=334年~338年',
		// 漢
		'/中宗/漢興|338/5/6~|4=:中國|疑|君主名=李壽|表字=考武|君主=昭文帝|諡=昭文皇帝|國號=漢|注=李壽發動兵變奪取政權，改國號為「漢」|注=《晉書》又稱之為「後蜀」，唐代以後，已基本不使用「後蜀」來指稱',
		'/末主/太和|344/1/31~|:中國|疑|君主=歸義侯;後主|君主名=李勢|表字=子仁',
		'/嘉寧|346/10/31~347/4/26|10=:中國|疑',

		'漢趙/高祖/元熙|304/11/14~|10=:中國|疑|君主=光文帝|君主名=劉淵|表字=元海|據=時間規範資料庫|時期=五胡十六國|生=約251年|卒=310年8月19日|在位=304年~310年',
		'/永鳳|308/10/31~|10=:中國|疑',
		'/河瑞|309/5/26~|閏4=:中國|疑',
		'/烈宗/光興|310/8/12~|7=:中國|疑|君主=昭武帝|君主名=劉聰;劉載|表字=玄明|卒=318年8月31日|在位=310年~318年',
		'/嘉平|311/7/3~|6=:中國|疑',
		'/建元|315/4/21~|3=:中國|疑',
		'/麟嘉|316/12/1~|11=:中國|疑',
		'/隱帝/漢昌|318/8/13~|7=:中國|疑|君主名=劉粲|諡=隱皇帝;靈皇帝|卒=318年|在位=318年',
		// 八月止
		'前趙/劉曜/光初|318/11/10~329/10/8|10=:中國|疑|君主=後主|表字=永明|年號=佐初|據=時間規範資料庫|時期=五胡十六國',
		// 前趙統治地區出現的其他勢力年號
		'大秦/句渠知/平趙|320/7/22~8/20|:東晉|據=Wikipedia|時期=五胡十六國|注=前趙將領結合部分巴氐首領謀叛，事洩皆被前趙帝劉曜所殺。於是巴氐族人皆反，推句渠知為領袖，國號「大秦」，改元平趙。',
		'後趙/趙王|319/11/29~|11=:中國|疑|君主名=石勒|政權=石趙|時期=五胡十六國|生=274年|卒=333年8月17日|在位=319年~333年|注=太興二年十一月，石勒稱大將軍、大單于、領冀州牧、趙王，於襄國即趙王位，正式建立後趙，稱趙王元年。|據=時間規範資料庫',
		'/高祖/太和|328/2/27~|2=:中國|疑|君主=明帝|表字=世龍|君主名=石勒|生=274年|卒=333年8月17日|在位=319年~333年',
		'/建平|330/9/29~|9=:中國|疑',
		'/海陽王/延熙|334/2/20~|:中國|疑|君主名=石弘|表字=大雅|生=314年|卒=335年|在位=333年~334年|注=《資治通鑑》考異：「《三十國·春秋》『虎即位，改元永熙』；《大統歷》云『石虎即位，改建平五年為延興，明年改建武。』」而《三十國春秋》並沒有記載石弘改元延熙，故《資治通鑑》考異認為「陳鴻雲虎改建平五年為延興，即是弘逾年不改元，恐鴻說誤」。「弘既號延熙，虎安肯稱永熙？」',
		'/武帝/建武|335/2/10~|:中國|疑|廟號=趙太祖|諡=武皇帝|君主名=石虎|表字=季龍|生=295年|卒=349年|在位=334年~349年',
		'/太寧|349/2/4~|:中國|疑',
		'/少帝/=|349/5/4~|4=:中國|疑|君主名=石世|生=339年|卒=349年|在位=349年',
		'/成帝/=|349/6/2~|5=:中國|疑|君主名=石遵|卒=349年|在位=349年|注=本為彭城王',
		'/石鑒/=|349/12/26~|12=:中國|疑|君主=後主|君主名=石鑒;石鑑|表字=大郎|卒=350年|在位=349年~350年|注=本為義陽王',
		'/青龍|350/1/25~|:中國|疑',
		'/石祗/永寧|350/4/23~351/6/10|3=:中國|疑|注=本為新興王',
		// 後趙統治地區出現的其他勢力的年號
		'/侯子光/龍興|337/8/13~9/10|:東晉|君主名=侯子光;李子楊|君主=大黃帝|據=Wikipedia|卒=337年',

		'前涼/太祖/永康|301/1/26~|2/=:西晉|疑|君主名=張軌|諡=武王|據=時間規範資料庫|時期=五胡十六國|生=255年|卒=314年|在位=301年~314年|注=張軌使用西晉年號',
		'/永寧|301/5/24~|4=:西晉',
		'/太安|303/1/5~|12=:西晉',
		'/永安|304/2/22~|:西晉',
		'/建武|304/8/17~|7=:西晉',
		'/永安|304/12/14~|11=:西晉',
		'/永興|305/1/12~|12=:西晉',
		'/永嘉|307/2/19~|:西晉',
		'/建興|313/5/12~|4=:西晉',
		'/高祖/=|314/10/25~|2/10/=:中國|疑|君主名=張寔|表字=安遜|君主=元公|生=271年|卒=320年|在位=314年~320年|注=建興五年前涼明王張寔襲用西晉年號，年號一作永安',
		'/太宗/=|320/7/22~|8/6/=:中國|疑|君主=成公;成王|君主名=張茂|生=277年|卒=324年|在位=320年~324年|注=年號一作永元',
		'/世祖/=|324/6/8~|12/5/=:中國|疑|君主=涼文王;忠成公|君主名=張駿|表字=公庭|生=307年|卒=346年|在位=324年~346年|注=年號一作太元',
		'/世宗/=|346/6/6~|34/5/=:中國|疑|君主=桓王|君主=敬烈公|君主名=張重華|表字=泰臨|生=327年|卒=353年|在位=346年~353年|注=年號一作永樂：346年五月-353年',
		'/威王/=|353/12/29~|41/11/18=:中國|疑|君主=長寧侯|君主名=張祚|表字=太伯|生=327年前|卒=355年|在位=353年~355年',
		'/和平|354/6/7~|5=:中國|疑',
		'/沖王/建興|355/10/22~|43/9/=:中國|疑|君主=敬悼公|君主名=張玄靚|表字=元安|生=350年|卒=363年|在位=355年~363年|注=355年閏九月-。年號或作太始。建興四十九年十二月改元升平五年（用晉穆帝年號）。也有說升平一作太始，而非建興一作太始。',
		'/升平|362/1/12~|5/12/=:中國|疑',
		'/悼公/=|363/8/26~376/9/29|7/8/=:中國|疑|君主名=張天錫|表字=純嘏|年號=太清|生=346年|卒=406年|在位=363年~376年|注=升平二十年八月被前秦戰敗投降，前涼亡。|注=《太平御覽》引《十六國春秋·前涼錄》稱「玄靖八年即位，年十八」故得生年。',
		// 前涼統治地區出現的其他勢力年號
		'/張大豫/鳳凰|386/3/17~387/8/29|2=:中國|疑|時期=五胡十六國|注=八月，廣武人押解張大豫送到姑臧，呂光斬張大豫。',

		'後涼/太祖/太安|386/11/8~|10=:中國|疑|君主=懿武帝|君主名=呂光|表字=世明|據=時間規範資料庫|時期=五胡十六國|生=338年|卒=399年|在位=386年~399年',
		'/麟嘉|389/3/13~400/1/12|2=:中國|疑',
		'/龍飛|396/7/22~|6=:中國|疑',
		// /太祖/承康: 諸史不載。
		'/靈帝/咸寧|400/1/13~|12=:中國|疑|君主名=呂纂|表字=永緒|卒=401年|在位=399年~401年',
		'/建康公/神鼎|401/3/1~403/10/1|2=:中國|疑|君主=尚書公|君主名=呂隆|表字=永基|卒=416年|在位=401年~403年',

		'前燕/烈祖/元璽|352/2/2~|:中國|疑|君主=景昭帝|君主名=慕容儁|表字=宣英|據=時間規範資料庫|時期=五胡十六國|生=319年|卒=360年正月二十一日 (360年2月23日)|在位=348年~360年正月二十一日|注=十一月丁卯，慕容儁置百官，次日(353/1/4)即位為皇帝，改年號為「元璽」。十六國春秋 卷三 前燕錄:元璽元年正月，司南車成，雋大悅...',
		'/光壽|357/3/29~|/2/23=:中國|疑',
		'/幽帝/建熙|360/2/17~371/1/2|/1/15=:中國|疑|君主名=慕容暐|表字=景茂|生=350年|卒=384年|在位=360年~370年',

		'後燕/世祖/燕元|384/2/8~|:中國|疑|君主名=慕容垂;慕容覇|表字=道明|據=時間規範資料庫|諡=燕武成帝|時期=五胡十六國|生=326年|卒=396年6月2日|在位=384年~396年|注=《十六國春秋》始稱後燕，以別於慕容氏諸燕',
		'/建興|386/4/4~|/2/19=:中國|疑',
		'/烈宗/永康|396/6/3~|/4/11=:中國|疑|君主名=慕容寳|表字=道祐|君主=惠愍帝|注=慕容寶出走後為蘭汗所誘而歸龍城，最終被其殺害。',
		'/蘭汗/青龍|398/5/27~398/8/15|/4/26=:中國|疑|諡=順文帝|注=殺死慕容寶後，改元青龍。奪位當年即為慕容盛所殺。',
		//
		'/開封公/建始|397/6/28~|/5/17=:中國|疑|君主名=慕容詳|諡=安武帝|卒=397年|注=後燕永康二年（397年），後燕不敵北魏的進攻，皇帝慕容寶等撤出都城中山（今中國河北省定縣），城內大亂，慕容詳當時不及跟隨撤退，因此被推為盟主以抵禦北魏的攻擊。然而，慕容詳為鞏固自己的地位，不斷翦除城內其他勢力，同年稍後不久並即皇帝位，改元建始。',
		'/趙王/延平|397/8/10~398/1/15|7=:中國|疑|君主名=慕容麟|諡=順武帝|生=4世紀？|卒=398年|注=由於慕容詳嗜酒好殺，不恤士民，中山城民遂迎趙王慕容麟入城，慕容麟入城後，殺慕容詳，亦稱帝，改元延平。但隨後又被北魏擊敗，南奔鄴城（今中國河南省臨漳縣）投靠范陽王慕容德，並不再稱帝。',
		//
		'/中宗/建平|398/11/9~|/10/14=:中國|疑|君主名=慕容盛|表字=道運|諡=昭武帝|生=373年|卒=401年|在位=398年~401年',
		'/長樂|399/3/19~|/1/26=:中國|疑',
		'/昭文帝/光始|401/10/17~|/閏8/24=:中國|疑|君主名=慕容熙|表字=道文|生=385年|卒=407年|在位=401年~407年',
		'/建始|407/2/23~407/9/16|2=:中國|疑',

		'前秦/高祖/皇始|351/3/4~|/1/20=:中國|疑|君主=景明帝|君主名=苻健|表字=建業|據=時間規範資料庫|時期=五胡十六國|生=317年|卒=355年7月10日|在位=351年~355年',
		'/厲王/壽光|355/7/11~|/6/16=:中國|疑|君主名=苻生|表字=長生|生=335年|卒=357年|在位=355年~357年',
		'/世祖/永興|357/7/3~|6=:中國|疑|君主=宣昭帝|君主名=苻堅|表字=永固|生=338年|卒=385年10月16日|在位=357年7月~385年10月16日',
		'/甘露|359/7/12~|6=:中國|疑',
		'/建元|365/2/7~|:中國|疑',
		'/哀平帝/太安|385/10/17~|/8/27=:中國|疑|君主名=苻丕|表字=永叔|卒=386年|在位=385年~386年',
		'/太宗/太初|386/12/8~|11=:中國|疑|君主=秦高帝|君主名=苻登|表字=文高|生=343年|卒=394年|在位=386年~394年',
		'/末主/延初|394/8/13~394/12/8|7=:中國|疑|君主名=苻崇|君主=延初帝;後主|卒=394年|在位=394年',
		// 前秦統治地區其他勢力的年號
		'/張琚/建昌|352/2/2~6/28|:東晉|疑|君主=秦王|君主名=張琚|據=Wikipedia|時期=五胡十六國|卒=352年|注=張琚自立為秦王，改年號為建昌。五月，前秦皇帝苻健在宜秋攻打張琚，將其斬殺。',
		'/張育/黑龍|374/5/27~11/20|:東晉|疑|君主=蜀王|君主名=張育|據=Wikipedia|時期=五胡十六國|卒=374年|注=寧康二年五月，張育自稱蜀王，六月，張育改元為黑龍。九月，楊安在成都以南打敗了張重、尹萬，斬殺士兵二萬三千人，張重陣亡。另一方面，張育、楊光被鄧羌攻殺於綿竹，益州又歸前秦所有。',
		'/竇衝/元光|393/6/26~394/9/11|:東晉|疑|君主=秦王|君主名=竇衝|據=Wikipedia|時期=五胡十六國|注=393年六月，竇衝自稱秦王，改年號為元光。394年七月，後秦安南將軍強熙、鎮遠將軍強多叛變，擁推竇衝為盟主。已經是後秦皇帝的姚興親自帶兵前去討伐，部隊行進到武功縣的時候，強多的侄兒強良國殺死了強多歸降。強熙則逃奔秦州，竇衝逃奔，被氐族首領仇高抓住送還給後秦。',

		'後秦/太祖/白雀|384/5/7~|4=:中國|疑|君主=武昭帝|君主名=姚萇|表字=景茂|據=時間規範資料庫|時期=五胡十六國|生=330年|卒=393年|在位=384年~394年|注=《晉書》及《資治通鑑》皆載姚萇死於太元十八年，通鑑更寫姚萇死於十二月庚子日|注=後秦用三紀曆|曆法=三紀曆',
		'/建初|386/6/13~|5=:中國|疑',
		'/高祖/=|394/2/1~|8/12/15=:中國|疑|君主=文桓帝|君主名=姚興|表字=子略|生=366年|卒=416年|在位=394年~416年',
		'/皇初|394/7/1~|/5/17=:中國|疑',
		'/弘始|399/10/16~|9=:中國|疑',
		'/後主/永和|416/3/15~417/9/20|2=:中國|疑|君主名=姚泓|表字=元子|生=388年|卒=417年|在位=416年~417年',

		'西秦/烈祖/建義|385/10/20~|9=:中國|疑|君主=宣烈王|君主名=乞伏國仁|據=時間規範資料庫|時期=五胡十六國|卒=388年|在位=385年~388年',
		'/高祖/太初|388/7/20~|6=:中國|疑|君主=武元王|君主名=乞伏乾歸|卒=412年|在位=388年~400年 409年~412年',
		'/更始|409/7/28~|7=:中國|疑',
		'/太祖/永康|412/9/22~|8=:中國|疑|君主=文昭王|君主名=乞伏熾盤|表字=安石|卒=428年|在位=412年~428年',
		'/建弘|420/1/31~|:中國|疑',
		'/後主/永弘|428/5/30~431/2/27|5=:中國|疑|君主名=乞伏暮末;乞伏慕末|表字=安石|卒=431年|在位=428年~431年',

		'南涼/烈祖/太初|397/2/13~|:中國|疑|諡=武王|廟號=烈祖|君主名=禿髮烏孤|據=時間規範資料庫|時期=五胡十六國|卒=399年|在位=397年~399年',
		'/康王/建和|400/2/11~|:中國|疑|君主名=禿髮利鹿孤|卒=402年|在位=399年~402年',
		'/景王/弘昌|402/4/18~|3=:中國|疑|諡=景王|君主名=禿髮傉檀|君主=景公|生=365年|卒=415年|在位=402年~414年',
		'/嘉平|408/12/4~409/1/31|11=:中國|疑|注=408年十一月復稱涼王，改元嘉平。',

		'西涼/太祖/庚子|400/12/2~|11=:中國|疑|君主=武昭王|君主名=李暠|表字=玄盛|據=時間規範資料庫|時期=五胡十六國|生=351年|卒=417年|在位=400年~417年',
		'/建初|405/2/15~|:中國|疑',
		'/涼公/嘉興|417/3/4~|2=:中國|疑|君主=後主|君主名=李歆|表字=士業;桐椎|卒=420年|在位=417年~420年|注=小字桐椎',
		'/李恂/永建|420/11/21~421/5/17|10=:中國|疑|君主=後主|表字=士如',

		'北涼/建康公/神璽|397/6/12~|5=:中國|疑|據=時間規範資料庫|君主名=段業|時期=五胡十六國|卒=401年|在位=397年~401年',
		'/天璽|399/3/23~|2=:中國|疑|年號=六璽',
		'/太祖/永安|401/6/27~|6=:中國|疑|諡=武宣王|君主名=沮渠蒙遜|廟號=太祖|生=368年|卒=433年|在位=401年~433年',
		'/玄始|412/12/19~|11=:中國|疑|年號=元始',
		'/承玄|428/6/28~|6=:中國|疑',
		'/義和|431/6/26~|6=:中國|疑',
		'/哀王/承和|433/5/5~|4=:中國|疑|君主名=沮渠牧犍;沮渠牧虔|諡=哀王|卒=447年|在位=433年~439年|年號=永和|注=437年起可能存在一個建平年號',
		'/沮渠無諱/承平|443/2/15~|:中國|疑|君主=拓王;酒泉王;河西王|注=關於沮渠無諱何時改元承平，晉書、宋書、魏書、南史、北史、十六國春秋、資治通鑑皆未載',
		'/沮渠安周/=|444/7/1~|2/6/=:中國|疑|君主=武拓王;河西王|君主名=沮渠安周|注=二年六月沮渠安周沿用。',
		// |時期=南北朝 @北朝時代柔然.
		// 闞氏高昌
		'高昌/闞伯周|460/12/29~|:中國|疑|君主名=闞伯周|注=柔然的附庸國。460年，柔然攻高昌，河西王沮渠安周被殺，高昌北涼滅亡。闞伯周被柔然立為高昌國王',
		'/闞義成|477/7/26~|:中國|疑|注=477年，其父闞伯周去世，闞義成即位。次年，其兄闞首歸殺害闞義成，自立為王。',
		'/闞首歸|478/8/14~|:中國|疑|君主名=闞首歸|卒=488年被高車王可至羅所殺',
		'/闞首歸/建初|489/2/16~492/2/13|:中國|疑|君主名=闞首歸|注=被認為是闞氏的最後年號',
		'=/張孟明|488/1/29~|:中國|疑|君主名=張孟明|生=460年|卒=496年|注=488年，高昌王闞首歸被高車王可至羅所殺，闞氏高昌滅亡。高昌人擁立張孟明為王',
		'/馬儒|496/1/31~|:中國|疑|君主名=馬儒|卒=501年|注=496年，高昌國人將高昌王張孟明殺害，擁立馬儒為高昌王。',
		// 麴氏高昌
		'/昭武王/承平|502/1/24/2/4~|:中國|疑|君主名=麴嘉|諡=昭武王|關係=王莽時期西遷的漢人後代|在位=501年或502年~約525年在位|注=《高昌史稿.統治篇》諡號昭武王',
		'/義熙|510/8/20~|:中國|疑|注=不知其後是否還有年號，也不知其子是否沿用該年號，暫定該年號止於麴嘉死之年',
		'/麴光/甘露|525/8/5~|:中國|疑|君主名=麴光|關係=麴嘉子|在位=約525年~約530年',
		'/麴堅/章和|531/2/3~|:中國|疑|君主名=麴堅|關係=麴嘉子、麴光弟|在位=531年~548年',
		'/麴玄喜/永平|549/2/13~|:中國|疑|君主名=麴玄喜|關係=麴堅子|在位=549年~550年|注=該年號諸史皆無，有黃文弼根據《田元初墓表》補正',
		'/和平王/和平|551/1/23~|:中國|疑|關係=麴玄喜子|在位=551年~554年|注=佚名。該年號諸史皆無，黃文弼根據《汜紹和及妻張氏墓表》及《孟宣宗墓表》補正，不知為哪位君主的年號。',
		'/麴寶茂/建昌|555/2/7~|:中國|疑|君主名=麴寶茂|關係=高昌和平王子|在位=555年~560年',
		'/麴乾固/延昌|561/2/1~|:中國|疑|君主名=麴乾固|關係=麴寶茂子|在位=561年~601年|注=該年號由黃文弼根據高昌時期的殘紙和《麴氏造寺碑》上的文字，考據出是麴乾固的年號。',
		'/麴伯雅/延和|602/1/29~|:中國|疑|君主名=麴伯雅|關係=麴乾固子|在位=602年~613年，復辟後：620年~623年|注=麴伯雅嗣位時間諸史皆無，黃文弼根據《延和二年癸亥唐元護妻令狐氏墓表》推算。',
		'/義和王/義和|614/2/15~|:中國|疑|在位=614年~619年|注=佚名，發動政變登位。該年號諸史皆無。黃文弼根據一些墓表和吐魯番出土文書補正。吳震考訂：高昌國延和十二年（613年）發生了一場政變。政變者統治高昌後，於次年改元義和。',
		'/麴伯雅/重光|620/2/9~|:中國|疑|注=復位。也有文獻認為是麴文泰的年號',
		'/麴文泰/延壽|624/1/26~|:中國|疑|君主名=麴文泰|關係=麴伯雅子|在位=624年~640年',
		'/麴智盛/|640/7/24~641/2/15|:中國|疑|君主名=麴智盛|關係=麴文泰子|在位=640年|注=640年唐朝滅麴氏高昌。',
		// 高昌統治地區其他不詳的年號:
		// 吐魯番地區曾出土高昌時期的白雀年號。至於此白雀年號為高昌本身之年號或奉後秦之年號則仍然待考

		'南燕/世宗/燕平|398/2/3~|:中國|疑|君主=獻武帝|君主名=慕容德;慕容備德|表字=玄明|據=時間規範資料庫|時期=五胡十六國|生=336年|卒=405年|在位=398年~405年|注=諸書未言燕平年號之事，所據不詳',
		'/建平|400/9/5~|:中國|疑|據=Wikipedia|注=《十六國春秋·南燕錄》記八月改元，《通鑑》繫於年末',
		'/北海王/太上|405/12/7~410/4/19|11=:中國|疑|君主=後主|君主名=慕容超|表字=祖明|生=385年|卒=410年|在位=405年~410年|據=Wikipedia|注=《十六國春秋·南燕錄》記十一月改元，《通鑑》誤作九月',
		//
		'北燕/惠懿帝/正始|407/9/15~|/7/28=:中國|疑|諡=惠懿帝|君主名=高雲;慕容雲|表字=子雨|據=時間規範資料庫|時期=五胡十六國|注=由於對慕容雲是否屬後燕慕容氏一族成員的看法不同，因此有人認為慕容雲是後燕末任君主，也有人把他視為北燕立國君主。',
		'/文成帝/太平|409/10/25~|10=:中國|疑|廟號=太祖|君主名=馮跋|表字=文起|卒=430年|在位=409年~430年',
		'/昭成帝/=|430/10/3~|22/9/=:中國|疑|君主名=馮弘|表字=文通|卒=438年|在位=430年~436年',
		'/太興|431/1/29~436/6/4|:中國|疑',

		'胡夏/世祖/龍升|407/7/21~|6=:中國|疑|君主=武烈帝|君主名=赫連勃勃|表字=屈孑|據=時間規範資料庫|時期=五胡十六國|生=381年|卒=425年|在位=407年~425年',
		'/鳳翔|413/4/17~|3=:中國|疑',
		'/昌武|418/12/14~|11=:中國|疑|君主=武烈帝',
		'/真興|419/3/12~|2=:中國|疑',
		'/秦王/承光|425/8/30~|8=:中國|疑|君主名=赫連昌;赫連折|表字=還國|年號=承陽;永光|卒=434年|在位=425年~428年',
		'/康王/勝光|428/3/2~431/7/25|2=:中國|疑|君主=後主|君主名=赫連定|卒=432年|在位=428年~431年',

		'冉魏/平帝/永興|350/3/25~|閏2=:中國|疑|君主名=冉閔;石閔|君主=武悼天王|表字=永曾;棘奴|據=Wikipedia|時期=五胡十六國|卒=352年6月1日|在位=350年~352年',
		'/惠帝/=|352/3/2~352/5/29|閏2=:中國|疑|君主名=冉智|據=Wikipedia|卒=354年',

		'代國/高祖/建國|338/11/28~377/1/25|11=:中國|疑|君主名=拓跋什翼犍|君主=昭成帝|據=時間規範資料庫|生=318年|卒=376年|注=北魏的前身。|時期=五胡十六國',

		'丁零/翟斌|330/2/5~|:東晉|疑|據=Wikipedia|部落=敕勒|時期=五胡十六國|注=讀史方輿紀要/卷三 晉咸和五年翟斌歸於石趙，趙封斌爲句町王，趙亡，歸燕。永和七年慕容雋復封翟鼠爲歸義王，居中山。秦滅燕，徙其族居新安、澠池間，斌因起兵叛秦。',
		'/翟真|384/2/8~|:東晉|疑|據=Wikipedia',
		'/翟成|385/1/27~|:東晉|疑|據=Wikipedia',
		'/翟遼|385/8/22~|:東晉|疑|據=Wikipedia',
		'翟魏/翟遼/建光|388/3/24~|2=:東晉|疑|據=時間規範資料庫|時期=五胡十六國|部落=敕勒',
		'/翟釗/定鼎|391/11/13~393/1/28|10=:東晉|疑',
		// 高車（敕勒）@北魏, 鄧至（白水羌）@北魏, 宕昌國，又稱宕昌羌@北周
		// https://zh.wikipedia.org/wiki/%E4%B8%9C%E6%99%8B%E5%8D%81%E5%85%AD%E5%9B%BD%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8
		'鮮于趙/鮮于乞|385/4/26~386/2/14|:東晉|疑|據=Wikipedia|時期=五胡十六國|注=385年四月，鮮于乞殺翟真及翟氏族人，自立為趙王。不久，鮮于乞又被丁零部眾翟真的堂弟翟成所殺。',

		'西燕/濟北王/燕興|384/5/7~|4=:中國|疑|君主名=慕容泓|據=時間規範資料庫|時期=五胡十六國|卒=384年|在位=384年',
		'/威帝/更始|385/1/27~|:中國|疑|君主名=慕容沖|生=359年|卒=386年|在位=385年~386年',
		'/段隨/昌平|386/3/17~|2=:中國|疑',
		'/慕容顗/建明|386/4/15~5/14|3=:中國|疑|君主名=慕容顗;慕容凱|卒=386年|在位=386年|注=《資治通鑒》作慕容顗，《魏書》作慕容凱。',
		'/慕容瑤/建平|386/4/15~5/14|3=:中國|疑',
		'/慕容忠/建武|386/4/15~|3=:中國|疑',
		'/慕容永/中興|386/11/8~394/10/10|10=:中國|疑',

		// 魏晉南北朝,三國兩晉南北朝/南朝
		// 時期=六朝

		'劉宋/武帝/永初|420/6/27~|6=2v8847p 42y|廟號=宋高祖|君主名=劉裕|表字=德興|朝代=前宋;南朝宋|時期=南北朝|生=363年4月16日|卒=422年6月26日|在位=420年7月10日~422年6月26日|注=三年五月劉義符即位沿用',
		'/營陽王/景平|423/1/28~|4o1059c|君主名=劉義符|表字=車兵|君主=少帝|生=406年|卒=424年8月4日|在位=422年6月26日~424年7月7日',
		'/文帝/元嘉|424/9/9~|8=361 47p 3mmp46i 4oiy59m 47p 3psm47m 59m 4g4j579 3qsc47p 3oq 4mg959h 47p 39zp42y 59h 3qud47p 42y 4of659m 3qui505 47e 4ojq|廟號=太祖|君主名=劉義隆|生=407年|卒=453年3月16日|在位=424年9月17日~453年3月16日|注=三十年四月劉駿即位沿用',
		'/孝武帝/孝建|454/2/14~|59m 505 3qkz|廟號=世祖|君主名=劉駿|表字=休龍|生=430年9月19日|卒=464年7月12日|在位=453年5月20日~464年7月12日',
		'/大明|457/2/10~|47o 4okc42y 591 3qu147p 42y 4o11|注=八年閏五月劉子業即位沿用',
		'/前廢帝/永光|465/2/12~|59c|君主=廢帝|君主名=劉子業|生=449年2月25日|卒=466年1月1日|在位=464年7月12日~466年1月1日',
		'/景和|465/9/6~|8=360',
		'/明帝/泰始|466/1/3~|12=35t 47p 3mmp46i 4oiz59m 505|廟號=太宗|君主名=劉彧|表字=休景|生=439年12月9日|卒=472年5月10日|在位=466年1月9日~472年5月10日',
		'/泰豫|472/1/26~|3psn|注=四月劉昱即位沿用',
		'/蒼梧王/元徽|473/2/13~|47m 59m 4g4j579 474|君主名=劉昱|表字=德嗣|君主=後廢帝|生=463年3月1日|卒=477年8月1日|在位=472年5月11日~477年8月1日',
		'/順帝/昇明|477/7/26~|7=2tlo47p 3k0|君主名=劉準|表字=仲謀|生=469年8月8日|卒=479年6月23日|在位=477年8月5日~479年5月27日',

		'南齊/高帝/建元|479/5/7~|4=3ai 4mg959h 47p|廟號=太祖|君主名=蕭道成|表字=伯紹|朝代=蕭齊|時期=南北朝|生=427年|卒=482年4月11日|在位=479年5月29日~482年4月11日|注=四年三月蕭賾即位沿用',
		'/武帝/永明|483/1/24~|39zp42y 59h 3qu947p 3mmy47e 59m 3quf505 47e|廟號=齊世祖|君主名=蕭賾|表字=宣遠|生=440年|卒=493年8月27日|在位=482年4月11日~493年8月27日|注=十一年七月蕭昭業即位沿用',
		'/鬱林王/隆昌|494/1/23~|4oas|君主名=蕭昭業|表字=尚元|生=473年|卒=494年9月7日|在位=493年8月27日~494年9月7日',
		'/海陵王/延興|494/8/17~|7=368|君主名=蕭昭文|表字=季尚|生=480年|卒=494年|在位=494年9月10日~494年11月23日',
		'/明帝/建武|494/11/14~|10=35w 59m 4g4s591 3y8|君主=高宗|君主名=蕭鸞|表字=景栖|生=452年|卒=498年|在位=494年12月22日~498年9月1日',
		'/永泰|498/5/7~|4=3f8|注=元年七月蕭寶卷即位沿用',
		'/東昏侯/永元|499/1/28~|4ok83oq 4qo|君主名=蕭寶卷|表字=智藏|生=483年|卒=501年|在位=498年~501年',
		'/和帝/中興|501/4/4~|3=3o5 3y8|君主名=蕭寶融|表字=智昭|生=488年|卒=502年|在位=501年4月14日~502年4月30日|注=梁書/卷01 永元三年三月乙巳，南康王卽帝位於江陵，改永元三年爲中興元年，遙廢東昏爲涪陵王。',

		'南梁/武帝/天監|502/4/23~|4=31jo47p 3oq 4o0y59l 3qui47p 46i 4oiu59m 47p 3psj47m 4okc3oq 579 3qs847p|廟號=梁高祖|君主名=蕭衍|表字=叔達|朝代=蕭梁;前梁;南朝梁|時期=南北朝|生=464年|卒=549年|在位=502年~549年|注=梁書/卷02 天監元年夏四月丙寅，高祖卽皇帝位於南郊。...改齊中興二年爲天監元年。',
		'/普通|520/2/4~|3oq 4mg559h 47p 39zm42y 4ofe4qo',
		'/大通|527/4/17~|3=3oq 47p 3mkm',
		'/中大通|529/11/17~|10=35x 47e 59m 3qub505 3ql8|注=梁書/卷03 中大通元年冬十月己酉改元',
		'/大同|535/2/18~|47o 59m 4g4p591 47o 4ok53oq 591 3qtt47p 39zu3y8',
		'/中大同|546/5/16~|4=3e2 54w',
		'/太清|547/5/5~|4=3ah 3quf47p|注=三年五月蕭綱即位沿用',
		'/簡文帝/大寶|550/2/2~|46i 4oar|廟號=太宗|君主名=蕭綱|表字=世纘|生=503年|卒=551年|在位=549年~551年',
		'/豫章王/天正|551/9/16~|8=36a|君主名=蕭棟|卒=552年|在位=551年|注=551年八月—十一月',
		'/蕭紀/=|552/2/11~553/8/24|59m 3quj|君主=武陵王;廢帝|注=552年四月—553年七月。《資治通鑑》記載，侯景之亂時，蕭紀不救援。等到蕭衍死後，在四川即位，年號天正。',
		'/元帝/承聖|552/12/2~|11=59m 3quj579 45c|君主=孝元帝|廟號=世祖|君主名=蕭繹|表字=世誠|生=508年9月16日|卒=555年1月27日|在位=552年12月13日~555年1月27日',
		'/閔帝/天成|555/6/5~|5=380|君主=貞陽侯|諡=閔帝|君主名=蕭淵明|表字=靖通|卒=556年|在位=555年',
		'/敬帝/紹泰|555/10/31~|10=35u 4oi0|君主名=蕭方智|表字=慧相|生=543年|卒=558年|在位=555年~557年',
		'/太平|556/10/19~|9=35w 59k',

		'陳/武帝/永定|557/11/7~|10=35u 579 3qs4|廟號=陳高祖|君主名=陳覇先;陳霸先|表字=興國|時期=南北朝',
		'/文帝/天嘉|560/2/12~|47o 59m 4mg259h 3qu247p 35s|廟號=世祖|君主名=陳蒨|表字=子華|生=522年|卒=566年|在位=559年~566年',
		'/天康|566/3/7~|2=42y',
		'/臨海王/光大|567/1/26~|4ofa59l|君主=廢帝|君主名=陳伯宗|表字=奉業;藥王|生=554年|卒=570年|在位=566年~568年|注=小字藥王',
		'/宣帝/太建|569/2/2~|47p 3mms47e 4oj059m 505 3ql547m 59m 4g4l591 47m 4ok23oq|君主=孝宣帝|諡=孝宣皇帝|廟號=高宗|君主名=陳頊;陳曇頊|表字=紹世|生=530年|卒=582年|在位=568年~582年',
		'/後主/至德|583/1/29~|4o1759h 47p 39zr|君主名=陳叔寶|表字=元秀|生=553年|卒=604年|在位=582年~589年',
		'/禎明|587/2/13~589/2/20|46i 59h 35s',

		// 南朝宋統治地區其他勢力的年號
		'劉宋/蜀王/泰始|432/2/17~437/6/18|:劉宋|君主名=程道養|注=趙廣擁道士程道養冒充司馬飛龍，立為蜀王，改元泰始。',
		'/劉劭/太初|453/3/17~6/21|:劉宋|表字=休遠|生=劉宋文帝元嘉元年|卒=453年5月27日|注=弒父奪位',
		'/魯爽/建平|454/3/15~8/9|:劉宋|小名=女生|卒=454年|注=劉宋文帝元嘉三十年，太子劉劭發動政變弒父登位，荊州刺史、南譙王劉義宣不久就起兵討伐，...魯爽自建年號建平，並製造輿服，殺懷疑不支持他的長史韋處穆、中兵參軍楊元駒及治中庾騰之。義宣等知魯爽起兵，只得狼狽跟隨，進魯爽為征北將軍，而魯爽就將造好的輿服送到江陵，征北府更版命義宣為皇帝、臧質為丞相、朱修之為車騎將軍。',
		'/楚王/永光|455/7/30~8/28|:劉宋|君主名=劉渾|君主=武昌王;武昌縣侯|表字=休淵|生=439年|卒=455年8月29日|年號=元光;允光',
		'/劉子勛/義嘉|466/2/7~9/19|:劉宋|君主名=劉子勛|君主=晉安王|表字=孝德|生=456年|卒=466年9月19日|注=劉宋明帝泰始二年正月初七，鄧琬與雍州刺史袁顗等在尋陽城奉劉子勛為帝，年號義嘉，並得到全國州鎮的支持，出兵討伐建康的劉彧政權，史稱「義嘉之難」。八月己卯，劉子勛被劉彧大將沈攸之捕斬，年僅十一歲，即葬尋陽廬山。',
		'仇池/大秦王/建義|436/4/2~|:劉宋|疑|君主名=楊難當|時期=南北朝|注=436年仇池（今中國甘肅南一帶）首領楊難當自稱大秦王，改元建義，然猶貢奉宋、魏不絕。',
		'/武都王/=|440/2/19~442/7/23|5/=:劉宋|疑|君主名=楊難當|注=440年，楊難當復稱武都王。',

		// 南齊統治地區其他勢力的年號
		'南齊/鎮西將軍/建義|500/3/16~500/5/13|:南齊|君主名=雍道晞',
		'唐吳/唐㝢之/興平|486/1/21~487/2/8|:南齊|君主名=唐寓之|時期=南北朝',

		// 南梁統治地區其他勢力的年號
		'南梁/鮮于琛/上願|535/2/18~536/2/7|:南梁',
		'/劉敬躬/永漢|542/2/1~542/4/29|:南梁|注=南梁大同八年（542年）十二月在安成郡（今江西安福）率眾起事，稱帝',
		'/臨賀王/正平|548/12/16~549/8/8|:南梁|君主名=蕭正德',
		'/蕭莊/天啟|558/4/4~560/4/10|:陳|生=548年|卒=577年|在位=557年~560年|注=《資治通鑑》載蕭莊即位在三月。',
		'侯漢/侯景/太始|551/12/14~552/5/8|:南梁|時期=南北朝|生=503年|卒=552年|注=551年，廢蕭綱，再立豫章王蕭棟為帝，改元天正。同年，再命蕭棟禪讓，侯景登極為帝，國號漢，改元太始。追尊漢司徒侯霸為始祖，晉徵士侯瑾為七世祖。',

		// 魏晉南北朝,三國兩晉南北朝/北朝

		'北魏/道武帝/登國|386/2/15~|47e 59l 3qu9505 3ql647m 59m 4g4n591 47m 4oar|廟號=太祖|君主名=拓跋珪;拓拔珪|時期=南北朝|生=371年8月4日|卒=409年11月6日|在位=386年2月20日~409年11月6日',
		'/皇始|396/8/20~|7=36d 3oq 4o17',
		'/天興|399/1/23~|12=35s 59h 47p 39zs46i 59h 3qth',
		'/天賜|404/11/18~|10=35u 47p 46i 4of659m 47k',
		'/明元帝/永興|409/10/25~|10=2t9m579 47e 4ojq59m|廟號=太宗|君主名=拓跋嗣;拓拔嗣|表字=木末|生=392年|卒=423年12月24日|在位=409年11月10日~423年12月24日',
		'/神瑞|414/2/6~|579 3qkz3y8',
		'/泰常|416/5/13~|4=3f8 4okc42y 591 3qu047p 42y 4o10',
		'/太武帝/始光|424/2/16~|59l 47p 3mmp46i 4qo|廟號=世祖|君主名=拓跋燾;拓拔燾|生=408年|卒=452年3月11日  北魏天賜 (北魏)|在位=423年12月27日~452年3月11日',
		'/神䴥|428/3/2~|2=39yi59m 47p 3psm',
		'/延和|432/2/17~|47m 59m 4g4j',
		'/太延|435/2/14~|579 3qsc47p 3oq 4mg958g',
		'/太平真君|440/7/15~|6=36t 47p 39zp42y 59h 3qu947p 3mm247e 59m 3quf4xs',
		'/正平|451/7/15~|6=385 3y8',
		'/南安王/承平|452/4/5~|3=3ew|君主名=拓跋余|卒=452年10月29日|在位=452年3月11日~10月29日|注=《魏書》作永平，《宋書》、《資治通鑒》作承平。李崇智以永平為後來的北魏宣武帝的其中一個年號，認爲宣武帝應不會承繼舊年號，所以從承平。',
		'/文成帝/興安|452/10/29~|10=35u 4ojq58g|廟號=高宗|君主名=拓跋濬;拓拔濬;拓跋浚|生=440年|卒=465年6月20日|在位=452年10月31日~465年6月20日',
		'/興光|454/8/10~|7=36y 54w',
		'/太安|455/7/1~|6=385 3qky47o 4okc42y|注=中央研究院 兩千年中西曆轉換記北魏文成帝太安四年閏十二月，另有文載北魏文成帝太安四年閏十月',
		'/和平|460/2/8~|591 3qu147p 42y 4o1059l',
		'/獻文帝/天安|466/2/1~|47p 3mdd|廟號=顯祖|君主名=拓跋弘;拓拔弘|表字=萬民|生=454年|卒=476年7月20日|在位=465年6月21日~471年9月20日',
		'/皇興|467/9/15~|8=36d 46i 4oix59m 4zk',
		'/孝文帝/延興|471/9/1~|8=36d 3psm47m 59m 4g4j54w|廟號=魏高祖|君主名=元宏|生=467年10月13日|卒=499年4月26日|在位=471年9月20日~499年4月26日|注=馮太后在文成帝死後於466年發動政變除掉了矯詔擅權、多行不法的丞相太原王乙渾，隨即長期攝政',
		'/承明|476/7/8~|6=385',
		'/太和|477/1/30~|3qsb47p 3oq 4mg959h 47p 39zo42y 59h 3qu947p 3mmx47e 59m 3quf505 47e 4ojo59m 4g4r591 47o 4ok8',
		'/宣武帝/景明|500/2/15~|3oq 591 3qtw47p|廟號=世宗|君主名=元恪|生=483年|卒=515年2月12日|在位=499年5月7日~515年2月12日',
		'/正始|504/2/1~|39zw46i 59l 3quh474',
		'/永平|508/9/11~|8=36d 46i 4oiu59m 3y8',
		'/延昌|512/5/2~|4=3f9 3psi47m 4okc',
		'/孝明帝/熙平|516/2/18~|3oq 579 35s|廟號=肅宗|君主名=元詡|生=510年4月8日|卒=528年3月31日|在位=515年2月12日~528年3月31日',
		'/神龜|518/2/26~520/8/28|2=3qs747p 3oq',
		'/正光|520/2/4~|3oq 4mg559h 47o 4ok241s|注=魏書/卷9 正光元年春正月乙酉...秋七月丙子...辛卯，帝加元服，大赦，改年，內外百官進位一等。',
		'/孝昌|525/7/6~|6=36y 4off59l 47k',
		'/武泰|528/2/13~|/1/8=47k',
		'/元氏/武泰|528/4/1~|/2/26=47k|生=北魏孝明帝孝昌四年春正月初七乙丑|注=武泰元年二月廿五癸丑日孝明帝元詡被胡太后(靈太后,宣武靈皇后)暗中串通近臣用毒酒毒死，武泰元年二月廿六甲寅日，胡太后偽稱皇女元氏為皇太子，擁立元氏登基為皇帝，胡太后繼續臨朝稱制。一天不到，胡太后見人心安定，發下詔書宣布皇帝本是女兒身，廢黜女嬰皇帝，改立已故宗室臨洮王元寶暉的世子元釗為皇帝。爾朱榮又另立元子攸為皇帝，是為孝莊帝，北魏出現了兩帝並立的局面。15日後，建義元年四月庚子，爾朱榮的軍隊占領京師洛陽，胡太后和幼主元釗被俘。爾朱榮不聽，下令將幼主和胡太后沉入黃河',
		'/元釗/武泰|528/4/2~|/2/27=47k|生=526年|卒=528年5月17日|注=二月乙卯（528年4月2日），元釗即位。元釗當年才虛齡三歲',
		'/孝莊帝/建義|528/5/15~|/4/11=47k|廟號=敬宗|君主名=元子攸|生=507年|卒=永安三年十二月甲子（531年1月26日），魏孝莊帝於晉陽城（今太原市晉源區境）三級寺被爾朱兆絞殺|在位=528年5月15日~531年1月6日|注=建義元年四月十一日，元子攸被爾朱榮擁立為皇帝。十二月三日（531年1月6日），爾朱兆攻入洛陽，殺死孝莊帝在襁褓中的兒子，孝莊帝被俘囚於永寧寺、後解送囚於晉陽三級寺。',
		'/永安|528/9/29~|9=35x 3mmv47e',
		'/長廣王/建明|530/12/5~|/10/30=47e 59l|君主名=元曄|君主=東海王|注=永安三年十月三十日（530年12月5日），爾朱兆另立元曄為帝。',
		'/節閔帝/普泰|531/3/4~532/6/18|2=59l 3qub|年號=普嘉|君主名=元恭|表字=修業|生=498年|卒=北魏孝武帝太昌元年五月丙申|在位=531年4月1日~532年6月|注=《歷代建元考》：諸書皆作普嘉。北魏長廣王建明二年二月廿九日，爾朱榮堂弟爾朱世隆廢元曄，立元恭為帝。軍閥高歡則立渤海太守安定王元朗為帝。東魏稱廣陵王或前廢帝，西魏諡節閔帝。',
		'/安定王/中興|531/10/26~532/6/18|10=59l 3qub|君主名=元朗|生=513年|卒=北魏孝武帝太昌元年十一月甲辰，元朗和元曄都在門下外省被殺死。永熙二年葬於鄴西南野馬岡|注=北魏普泰元年十月六日被高歡立為皇帝，普泰2年四月高歡因元朗世系疏遠，迫使他讓位於孝武帝元修。',
		'/孝武帝/太昌|532/5/20~|4=3qub|君主=孝武帝;出帝|君主名=元修;元脩|表字=孝則|生=510年|卒=535年2月3日|在位=532年6月13日~535年2月3日',
		'/永興|533/1/11~2/9|12=3qub|注=永興（532年十二月）是北魏孝武帝元修的第二個年號，歷時未及一個月。|注=魏書/卷11 十有二月..丁亥，殺大司馬、汝南王悅。大赦天下，改太昌為永興，以太宗號，尋改為永熙元年。 二年春正月庚寅朔，朝饗群臣於太極前殿。',
		'/永熙|533/1/11~|12=35s 505 3ql8|注=閏十二月十五日（535年2月3日），宇文泰以元修淫及從姊妹有傷風化為由，把元明月和元修都給殺死，改立元寶炬為帝。北魏從此正式分裂成東西魏。',

		'東魏/孝靜帝/天平|534/10/23~|10=2t7g47m 59m 4g4p|君主名=元善見|時期=南北朝|生=524年|卒=551年|在位=534年~550年',
		'/元象|538/2/15~|591 47k',
		'/興和|539/11/27~|11=35u 4ok53oq 591',
		'/武定|543/1/21~550/5/30|3qs147p 39zu46i 59h 3quf47p 45c|注=543年-550年五月',

		'西魏/文景帝/建平|508/9/11~508/11/8|:北魏|君主名=元愉|君主字=宣德|時期=南北朝|注=太和二十一年（497年）封京兆王，西魏大統元年春正月戊申，文帝元寶炬追諡元愉為文景皇帝。',
		'/文帝/大統|535/2/18~|47m 59m 4g4p591 47m 4ok53oq 591 3qs147p 39zu46i 59h 3quf47p 46i 4of8|君主名=元寶炬|生=507年|卒=551年|在位=535年~551年',
		'=/廢帝/乾明|552/2/11~|59m 3quk|疑|君主名=元欽|注=段長基的《歷代統紀表》卷七認爲西魏君主元欽有乾明元年及二年，但是其他諸書均無記載，都稱元欽沒有年號',
		'=/恭帝|554/2/18~557/1/15|579 47e 4ojs|君主名=拓跋廓;拓拔廓|生=537年|卒=557年|在位=554年~557年',

		// 北魏統治地區其他勢力的年號
		'北魏/白亞栗斯/建平|415/3/26~|:北魏|疑|注=胡族，自稱大將軍，自號為單于，以司馬順宰為謀主。',
		'/劉虎/=|416/2/14~416/11/6|:北魏|疑|注=北魏神瑞二年被上黨胡人推為主',
		'/司馬小君/聖君|471/11/28~472/1/25|:北魏|疑',
		'/呂苟兒/建明|506/2/9~506/9/2|:北魏|疑|注=魏書/卷8: 天監三年春正月壬申...秦州民王灋智等聚眾二千自號王公，尋推秦州主簿呂苟兒為主，年號建明。...秋七月...庚辰，元麗大破秦賊，降呂苟兒及其王公三十餘人|注=資治通鑑/卷146: 天監五年春正月乙亥...魏秦州屠各王灋智聚眾二千...己卯...六月...乙巳，魏安西將軍元麗擊王灋智，破之，斬首六千級。...七月...呂苟兒率眾十餘萬屯孤山，圍逼秦州，元麗進擊，大破之。行秦州事李韶掩擊孤山，獲其父母妻子，庚辰，苟兒帥其徒詣麗降。',
		'/陳瞻/聖明|506/2/9~506/9/2|:北魏|疑|據=魏書/卷8',
		// 樊素安/正始: 見於葉維庚的《紀元通考》和李兆洛《紀元編》，不詳何時，或以為是北魏宣武帝元恪的正始年號之誤
		'/法慶/大乘|515/6/27~515/10/22|:北魏|疑|注=九月十四日，大乘軍兵敗，法慶、惠暉及頭領百餘人被捕殺，叛民被屠殺者以萬數。《魏書》、《資治通鑒》謂法慶自號大乘，未有提及建立年號。《玉海》以大乘為法慶的年號。',
		'/破六韓拔陵/真王|524/4/19~525/8/4|:北魏|疑|君主名=破六韓拔陵;破落汗拔陵|注=六鎮之亂領導人',
		'/杜洛周/真王|525/9/3~528/4/4|2/=:北魏|疑|君主名=杜洛周;吐斤洛周|注=據《兩件北魏「真王五年」造像銘考》考證，杜洛周奉破六韓拔陵「真王」正朔，525年為真王二年。武泰元年二月，杜洛周被葛榮偷襲殺死，部眾被葛榮兼併。',
		'/秦天子/天建|524/7/17~527/11/8|:北魏|疑|君主名=莫折念生',
		'/襄厲王/天啟|525/2/8~525/5/7|:北魏|疑|年號=大啟|諡=襄厲王|君主名=元法僧|君主=始安郡公|注=孝昌元年正月庚申稱帝。甲戌，梁朝任命元法僧為司空，封始安郡公，尋改封宋王。三月己巳，梁朝任命元景隆為衡州刺史，元景仲為廣州刺史。梁武帝召元法僧及元略回建康，元法僧驅趕彭城官民萬人南渡。',
		'/鮮于修禮/魯興|526/1/29~526/9/21|:北魏|疑|年號=普興|注=丁零族，河北起義。八月，鮮于修禮被元洪業殺害',
		// 陳雙熾/始建 諸書記載「自號始建王」，並沒有說改元。而《玉海》等書則把「始建」作為年號
		'/劉獲/天授|527/8/13~527/9/10|:北魏|疑|注=527年七月，劉獲和同鄉鄭辯在西華反魏，改年號為天授，並與南梁譙州刺史湛僧智合謀',
		'/漢王/天統|528/7/3~529/5/23|:北魏|疑|君主名=邢杲|注=建義元年六月率眾起事',
		'/万俟醜奴/神獸|528/8/1~530/6/10|:北魏|疑|年號=神虎;神平|注=「万俟」為複姓，讀作「陌奇」。万俟醜奴原為胡琛部將；胡琛為破六韓拔陵所殺，万俟醜奴繼承指揮權。',
		'/北海王/孝基|529/4/24~|:北魏|疑|君主名=元顥|君主字=子明|注=襲封北海王。528年，河陰之變後，元顥南投蕭梁，梁武帝封他為魏王',
		'/建武|529/6/17~529/8/19|:北魏|疑|注=資治通鑑卷第一百五十三: 丙子，顥入洛陽宮，改元建武，大赦。',
		'/汝南王/更興|530/7/11~533/2/9|:北魏|疑|君主名=元悅|諡=文宣|年號=更新|注=北魏孝文帝元宏第六子',

		'葛齊/葛榮/廣安|526/9/22~528/10/28|:北魏|疑|時期=南北朝|國號=齊|注=鮮卑人',
		'蕭齊/蕭寶夤/隆緒|527/9/11~528/3/6|:北魏|疑|時期=南北朝|君主字=智亮|注=南齊齊明帝蕭鸞第六子，投奔北魏，成為北魏駙馬。',

		// 北周統治地區其他勢力的年號
		'稽胡/劉蠡升/神嘉|525/12/30~535/5/17|:中國|疑|時期=南北朝|注=稽胡，又稱山胡、步落稽|注=北魏邊境常被劉蠡升侵擾，時人稱他為「胡荒」。...三月辛酉，劉蠡升的北部王斬劉蠡升之首來投降',
		'/聖武皇帝/石平|577/11/26~577/12/24|:中國|疑|君主名=劉沒鐸|注=劉蠡升的孫子。',

		// 東魏統治地區其他勢力的年號
		'東魏/王迢觸/平都|536/10/1~10/29|:東魏|疑|注=《北齊書·第2卷·神武帝紀下》：九月辛亥，汾州胡王迢觸、曹貳龍聚衆反，署立百官，年號平都。神武討平之。',

		// 柔然汗國可考年號
		// https://zh.wikipedia.org/wiki/%E4%B8%9C%E6%99%8B%E5%8D%81%E5%85%AD%E5%9B%BD%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8#.E6.9F.94.E7.84.B6.E6.B1.97.E5.9B.BD
		'柔然/丘豆伐可汗|402/2/18~|:中國|疑|君主名=社侖',
		'/藹苦蓋可汗|410/6/18~|:中國|疑|君主名=斛律|注=北魏永興二年（410年）5月，北魏進攻柔然，社侖卒於逃跑途中。由於兒子度拔年幼，故立社侖弟斛律為可汗。',
		'/步鹿真|414/6/4~|:中國|疑|注=斛律侄。義熙十年（414年）5月，步鹿真作亂。',
		'/牟汗紇升蓋可汗|414/7/4~|:中國|疑|君主名=大檀|注=斛律季父之子，414年立，429年7月卒。這名稱也是韃靼一名的來源。',
		'/敕連可汗|429/8/16~|:中國|疑|君主名=吳提|注=444年9月，吳提逝世。',
		'/處可汗|444/9/28~|:中國|疑|君主名=吐賀真|注=464年7月卒',
		'/受羅部真可汗/永康|464/8/19~|:中國|疑|君主名=予成|注=485年7月卒。',
		'/伏名敦可汗/太平|485/7/28~|:中國|疑|君主名=豆侖|注=492年8月遭叔父一派殺害奪位。',
		'/候其伏代庫者可汗/太安|492/9/8~|:中國|疑|君主名=那蓋|注=506年10月卒。',
		'/佗汗可汗/始平|506/11/1~|:中國|疑|君主名=伏圖|注=508年遭高車王彌俄突所殺。',
		'/豆羅伏跋豆伐可汗/建昌|508/2/17~|:中國|疑|君主名=丑奴;醜奴',
		'=/敕連頭兵豆伐可汗|520/9/28~|:中國|疑|君主名=阿那瓌|生=472年|卒=552年|注=520年9月立汗。西魏廢帝元年正月土門發兵攻擊柔然，大破柔然軍於懷荒鎮北面。阿那瓌因而自殺，其子庵羅辰投奔北齊，餘衆復立阿那瓌叔父鄧叔子為柔然國主。',
		//
		'/鐵伐|552/2/11~|:中國|疑|注=552年立汗，553年遭契丹所殺。',
		'/登注俟利|552/3/11~|:中國|疑|注=鐵伐之父親，552年立汗，553年遭大人阿富提所殺。',
		'/庫提|553/1/30~|:中國|疑|注=登注俟利之子，於553年立汗。',
		//
		'/庵羅辰|553/3/30~555/2/6|:中國|疑|注=553年立汗，554年叛北齊，奔西魏後被殺。',
		'/鄧叔子|553/3/30~556/1/27|:中國|疑|注=與庵羅辰同於553年並立。於553年3月立汗，555年，防線被突厥破，率3000兵士奔西魏，後被殺。557年，突厥宣布正式併吞柔然地區。',
		//
		'/彌偶可杜句可汗|521/1/24~526/1/28|:中國|疑|君主名=俟力發婆羅門|注=婆羅門是阿那瓌之堂兄，於521年元月立汗，與阿那瓌並立。後因高車攻打，入塞降北魏。',

		'北齊/文宣帝/天保|550/5/31~|5=36y 4oiq59m 3quj579 47m 4ojs59m 579 3qs4|曆法=天保曆|廟號=顯祖|君主名=高洋|表字=子進|時期=南北朝|生=526年|卒=559年|在位=550年~559年|注=十年十月高殷即位沿用',
		'/廢帝/乾明|560/2/12~|474|君主=濟南王|君主名=高殷|表字=正道|生=545年|卒=561年|在位=559年~560年',
		'/孝昭帝/皇建|560/9/6~|8=36c 59k|廟號=肅宗|君主名=高演|表字=延安|生=535年|卒=561年|在位=560年~561年',
		'/武成帝/太寧|561/11/23~|11=2t7g3y8|年號=大寧;泰寧|廟號=齊世祖|君主名=高湛|生=538年|卒=569年1月13日|在位=561年12月3日~565年6月8日',
		'/河清|562/5/19~|4=3ai 59h 3qu23y8|注=北史卷8: 河清元年夏四月庚寅，河、濟清。以河、濟清，改大寧二年為河清',
		'/後主/天統|565/5/16~|4=3f9 42y 4ofa59l 47p|君主=溫國公|君主名=高緯|表字=仁綱|生=556年5月29日|卒=北周武帝建德六年冬十月誅溫公高緯|在位=565年6月8日~577年2月4日',
		'/武平|570/1/22~|3mmq47e 4oiz59m 505 3ql447m',
		'/隆化|577/1/17~577/2/4|/12/13=47m 4qo|注=北齊書卷8 北齊後主武平七年十二月丁巳，大赦，改武平七年為隆化元年。',
		'/安德王/德昌|577/1/18~577/1/21|/12/14=47m|注=北齊書卷8 北齊後主武平七年十二月戊午，延宗從衆議卽皇帝位於晉陽，改隆化為德昌元年。...辛酉，延宗與周師戰於晉陽，大敗，為周師所虜。',
		'/幼主/承光|577/2/4~4/3|59m|君主名=高恆|生=北齊書卷8 武平元年六月生於鄴|卒=577或578年|注=北齊書卷8 武平元年十月立為皇太子...隆化二年春正月乙亥，卽皇帝位，時八歲，改元為承光元年',
		// 北齊統治地區其他勢力的年號
		'/范陽王/武平|577/2/4~579/2/11|8/=59m 4g4k|曆法=天保曆|君主名=高紹義|注=北齊書卷12 高寶寧在營州，表上尊號，紹義遂卽皇帝位，稱武平元年。《廿二史考異》則認為應是用後主高緯年號，作武平九年。認為後主在武平八年失國，高紹義投奔突厥，次年稱帝仍用武平年號，並不應該算作是改元。',
		// 1963年北京懷柔縣出土北齊武平二年墓磗有磗文「安太二年」字樣，但是這個年號不見於史籍，仍然有待於進一步考證

		'北周/孝閔帝|557/1/16~|12=35s 59c|君主=孝愍帝|君主名=宇文覺|表字=陀羅尼|諱=覺|時期=南北朝|生=542年|卒=557年|在位=557年',
		'/明帝|557/10/9~|9=362 579 3qbp|廟號=世祖|君主名=宇文毓|諱=毓|生=534年|卒=560年|在位=557年~560年',
		'/=/武成|559/9/18~|8=36d 47o|注=武成二年四月北周武帝宇文邕即位沿用。',
		'/武帝/保定|561/2/1~|59m 4mg1591 3qu147o|廟號=周高祖|君主名=宇文邕|表字=彌羅突|生=543年|卒=宣政元年六月丁酉|在位=560年5月31日~578年6月21日',
		'/天和|566/2/6~|59m 3qug505 47e 4ojo59m 4qo',
		'/建德|572/3/30~|3=3f9 3qkx47m 4oka3oq 591 3y8',
		'/宣政|578/3/24~|3=31hy',
		'/宣帝/大成|579/2/12~|35s|君主名=宇文贇|表字=乾伯|生=武成元年|卒=大象二年五月己酉|在位=宣政元年六月戊戌~579年',
		'/靜帝/大象|579/3/14~|2=47m 59m|君主名=宇文闡;宇文衍|生=建德二年六月壬子|卒=開皇元年五月壬申（《隋書》作五月辛未，相差一天）|在位=大象元年二月辛巳~581年|注=原名宇文衍',
		'/大定|581/1/21~2/19|35s|注=歷時數月',

		// 魏晉南北朝,三國兩晉南北朝: 其他國

		'後梁/宣帝/大定|555/2/7~|:中國|疑|廟號=中宗|君主名=蕭詧|表字=理孫|朝代=西梁|據=時間規範資料庫|時期=南北朝|生=519年|卒=562年|在位=555年~562年',
		'/孝明帝/天保|562/3/21~|:中國|疑|廟號=世宗|君主名=蕭巋|表字=仁遠|生=542年|卒=585年|在位=562年~585年|注=二十四年五月蕭琮即位沿用',
		'/莒公/廣運|585/6/3~587/10/7|5=:中國|疑|君主名=蕭琮|表字=溫文|君主=後主|在位=585年~587年',

		'隋/文帝/開皇|581/2/20~|2=3qub579 3qsc505 46i 4oiw59m 505 3psk47m 4okc3oq 579 3qsa47p 3oq 4oit59m 505 3qkx|廟號=隋高祖|君主名=楊堅|生=541年7月21日|卒=604年8月13日|在位=581年3月4日~604年8月13日|時期=隋唐',
		'/仁壽|601/2/8~|47m 4oka3oq 591|注=四年七月隋煬帝即位沿用',
		'/煬帝/大業|605/1/25~|3qs747p 3oq 4o0z59h 3quj47p 46i 4ofd59m 47p 3psl47e 59m|君主名=楊廣;楊英|生=569年|卒=618年4月11日|在位=604年8月21日~618年4月11日|注=605年—618年三月。《隋書》、《北史》等只記載到大業十三年，而《資治通鑑》則只記載到十二年。趙翼則考證李淵雖然立楊侑為帝，改元義寧，但是隋煬帝仍在，大業年號並沒有廢',
		'/恭帝/義寧|617/12/4~|11=47e 59m|君主名=楊侑|生=605年|卒=唐高祖武德二年八月丁酉 (619年9月14日)|在位=617年12月18日~618年6月12日|注=[[s:資治通鑑/卷183]] 隋大業十三年十一月壬戌，李淵備法駕迎代王即皇帝位於天興殿，時年十三，大赦，改元，遙尊煬帝為太上皇。',
		'/皇泰主/皇泰|618/5/30~|5=59m 3g9e|君主名=楊侗|生=604年|卒=619年7月|在位=618年6月22日~619年5月23日|注=楊侗原本封為越王，駐守東都洛陽。618年4月11日，宇文化及弒隋煬帝，消息傳到東都後，皇泰元年五月二十四戊辰日（618年6月22日），王世充與元文都、盧楚等擁立楊侗為皇帝，史稱皇泰主。',
		'/大鄭皇帝/開明|619/5/25~621/6/24|/4/7=3g9e4a2 3b1m|君主名=王世充|國號=鄭國|卒=621年|在位=619年~621年|注=皇泰二年四月癸卯，王世充廢楊侗，將楊侗囚於含涼殿，兩天後，王世充自稱「大鄭皇帝」，建元「開明」，改封楊侗為潞國公',

		// 隋末農民起義時各割據勢力年號
		'/向海明/白鳥|614/1/16~2/14|:隋|疑|注=被隋將楊義臣所殺。',
		'/皇王/大世|614/6/13~7/11|:隋|疑|君主名=劉迦論|注=被隋將屈突通敗於上郡，擊斬。',
		'/元興王/始興|617/1/13~2/10|:隋|疑|君主名=操師乞|年號=天成|注=十二月癸未，自號元興王。',
		'/長樂王/丁丑|617/2/11~|:中國|疑|君主名=竇建德|注=[[s:資治通鑑/卷183]] 隋大業十三年正月丙辰在樂壽（今河北滄州獻縣）稱長樂王',
		'/夏王/五鳳|618/12/19~621/6/24|:中國|疑|君主名=竇建德|注=唐高祖武德元年冬至在樂壽稱夏王',
		'/魏公/永平|617/3/13~619/1/20|:中國|疑|君主名=李密|君主字=玄邃;法主|生=582年|卒=619年1月20日',
		'/永樂王/正平|617/4/11~618/8/25|:中國|疑|君主名=郭子和|君主=屋利設;金河郡公;郕國公|年號=丑平',
		'/曹武徹/通聖|618/1/12~1/31|:隋|疑|君主名=曹武徹|注=隋恭帝義寧元年十二月丁亥，曹武徹舉兵反隋，建元通聖。不久，被梁王蕭銑所滅。',
		//
		'朱楚/楚帝/昌達|615/12/26~619/4/19|:隋|疑|時期=隋唐|君主名=朱粲|注=621年，唐王李世民攻滅王世充，朱粲被殺於洛水。',
		'林楚/楚帝/太平|617/1/13~622/12/7|:中國|疑|時期=隋唐|年號=延康;天成|君主=南越王|君主名=林士弘|注=病亡|注=[[s:資治通鑑/卷183]] 隋大業十二年十二月壬辰，士弘自稱皇帝，國號楚，建元太平',
		'劉漢/定楊可汗/天興|617/4/11~620/6/5|:中國|疑|時期=隋唐|君主名=劉武周|生=582年|卒=622年',
		'梁國/梁皇帝|617/4/11~|:中國|疑|時期=隋唐|君主名=梁師都|君主=大度毗伽可汗;解事天子',
		'/=/永隆|618/2/1~628/6/6|:中國|疑|注=據《資治通鑑卷183》，梁師都建元稱帝在617年三月；但《上柱國杞國公總管梁明達志》首句即「永隆二年歲次己卯十一月丙寅朔七日壬申」，故永隆元年當為618年。',
		'薛秦/武帝/秦興|617/5/11~618/12/21|:中國|疑|時期=隋唐|君主名=薛舉|君主=西秦霸王|注=年號誤作泰興',
		'蕭梁/蕭銑/鳴鳳|617/5/11~621/11/18|:中國|疑|時期=隋唐|君主名=蕭銑|年號=鳳鳴|生=583年|卒=621年',
		'李涼/河西大涼王/安樂|617/8/7~|:中國|疑|時期=隋唐|君主名=李軌|卒=619年|注=《舊唐書》將李軌建元一事記在617年七月李軌自稱「河西大涼王」之時。《新唐書》和《資治通鑒》則記在618年十一月李軌自稱涼帝之時。出土墓誌《劉和墓誌》則稱志主劉和下葬於「安樂元年歲次丁丑九月己酉朔廿四日癸酉」，可知應以《舊唐書》記載為准。',
		'/涼帝/=|618/11/23~619/7/16|:中國|疑|君主名=李軌|卒=619年|注=十一月，李軌佔河西（今甘肅河西走廊）五郡之地，改稱涼帝',

		'唐/高祖/武德|618/5/30~|5=59m 3g9e4a2 3b1m445 3oq 4o1359h 49u|諡=神堯大聖光孝皇帝|君主名=李淵|表字=叔德|生=566年4月8日|卒=635年6月25日|在位=618年6月18日~626年9月4日|時期=隋唐',
		'/太宗/貞觀|627/1/23~|4soz5es 3rkc4a2 47p 3mmw46i 5d1 3sr84a0 5as 3t6q52s 4g4q579 47e 4sgm5e9 591 3qtv47p 3mn046i|諡=文武大聖大廣孝皇帝|君主名=李世民|廟號=太宗|生=598年1月28日 (599年1月23日) (隋文帝開皇十八年戊午馬年十二月二十二日 598年1月28日)|卒=649年7月10日 (唐太宗貞觀 (唐太宗)) (649年7月10日)|在位=626年9月4日~649年7月10日',
		'/高宗/永徽|650/2/7~|59l 3quh505 46i 4oit59m|諡=天皇大聖大弘孝皇帝|君主名=李治|表字=為善|生=628年7月21日 (《旧唐书·太宗本纪》记载：贞观二年，“六月庚寅，皇子治生。”贞观二年六月十五庚寅日，用万年历换算为公历则是628年7月21日。)|卒=683年12月27日|在位=649年7月15日~683年12月27日',
		'/顯慶|656/2/1~|505 3psh47m 4oka3oq 4qo',
		'/龍朔|661/4/5~|3=3md 3qs747p',
		'/麟德|664/2/2~|3oq 4mg3',
		// 乾封一年至開元七年照中國史曆表朔閏訂正舉隅一文更改
		'/乾封|666/2/10~|48a 3mws3f9',
		'/總章|668/4/17~|3=3f9 46h 4rkp',
		'/咸亨|670/3/27~|3=4rkp5e0 5uw 4pl15as',
		'/上元|674/9/6~|8=5as 50q 4g4j',
		'/儀鳳|676/12/11~|11=4g4j4es 43kq4gi',
		'/調露|679/7/13~|6=4gi 5e8',
		'/永隆|680/8/30~|8=5e8 57h3',
		'/開耀|681/10/17~|9=57h34a1',
		'/永淳|682/3/15~|2=4a1 3pw',
		'/弘道|683/12/24~|12=3pw',
		'/中宗/嗣聖|684/1/23~|4qo|諡=大和大聖大昭孝皇帝|君主名=李哲;李顯|生=656年11月26日|卒=710年7月3日|在位=684年1月3日~684年2月26日  705年2月23日~710年7月3日',
		'/睿宗/文明|684/2/21~|2=38cl|諡=元貞大聖大興孝皇帝|君主名=李旦;李旭輪;李輪|生=662年6月22日|卒=716年7月13日|在位=684年2月27日~690年10月16日  710年7月25日~712年9月8日|注=黄永年.1992-6.唐元和后期党争与宪宗之死: 唐中宗嗣聖元年二月戊午，中宗爲武太后所廢，己未立睿宗，同日改元文明。',
		'/武后/光宅|684/10/14~|9=35x|君主名=武曌|君主=則天皇帝;武照;武則天|諡=則天順聖皇后|政權=周;周唐|生=624年2月17日|卒=705年12月16日|君主性別=女|在位=690年10月16日~705年2月22日|注=文明元年九月，武則天頒布《改元光宅赦文》，遷都洛陽；大赦九月五日昧爽之前，大辟以下罪犯。',
		'/垂拱|685/2/9~|42y 58z 3qs14gy|注=光宅行用僅四月。平息李敬業叛亂後，武則天以《尚書 武成》「惇信明義，崇德報功，垂拱而天下治」，改元「垂拱」。',
		'/永昌|689/1/27~|4snd',
		'/載初|689/12/18~|5aw|歲首=11|月名=正;臘|注=永昌元年十一月初一庚辰（689年12月18日），改元載初。用周曆子正，以十一月為正月，十二月為臘月，來歲正月為一月。',
		'/天授|690/10/8~|11=35t 3fw 4u8|國號=武周|歲首=11|月名=正;臘|注=載初元年九月初九壬午（690年10月16日），改國號為周，改元天授。',
		'/如意|692/4/22~11/13|6=2uh3|歲首=11|月名=正;臘|注=天授三年四月初一丙申（692年4月22日），改元如意。',
		'/長壽|692/10/15~694/6/27|11=35s 505 468|歲首=11|月名=正;臘|注=如意元年九月初九庚子（692年10月23日），改元長壽。',
		'/延載|694/5/30~|7=36y 4qo|歲首=11|月名=正;臘|注=長壽三年五月十一甲午（694年6月9日），改元延載。',
		'/證聖|694/11/23~695/11/11|4of8|歲首=11|月名=正;臘|注=證聖元年正月初一辛巳（694年11月23日），改元證聖。按《舊唐書》載，延載二年一月改元：「證聖元年春一月，上加尊號曰慈氏越古金輪聖神皇帝，大赦天下，改元。」',
		'/天冊萬歲|695/10/14~696/2/8|11=4of85e1|歲首=11|月名=正;臘|注=證聖元年九月初九甲寅（695年10月22日），改元天冊萬歲。',
		'/萬歲登封|696/1/10~5/6|2=5e1|歲首=11|月名=正;臘|注=天冊萬歲二年臘月十一甲申（696年1月20日），改元萬歲登封。',
		'/萬歲通天|696/4/7~697/10/20|5=5e1 4a0|歲首=11|月名=正;臘|注=萬歲登封元年三月十六丁巳（696年4月22日），改元萬歲通天。',
		'/神功|697/9/21~|11=2t58|歲首=11|月名=正;臘|注=萬歲通天二年九月初九壬寅（697年9月29日），改元神功。',
		'/聖曆|697/12/20~700/6/20|5uy 3q1 325l|歲首=11|月名=正;臘|注=聖曆元年正月初一甲子（697年12月20日），改元聖曆。',
		'/久視|700/5/23~701/3/13|5=3t6v4qo|注=聖曆三年五月初五癸丑（700年5月27日），改元久視。久視元年十月甲寅，廢止從載初元年開始的子正，重新恢復寅正。資治通鑑/卷207 甲寅，制復以正月為十一月，一月為正月，赦天下。',
		'/大足|701/2/13~12/3|52s|注=久視二年正月初三丁丑（701年2月15日），改元大足。',
		'/長安|701/11/5~705/2/27|10=52s 4za 3pt04zu 4qo|注=大足元年十月廿二辛酉（701年11月26日），改元長安。',
		'/神龍|705/1/30~2/27|5s9',
		'/中宗/=|705/1/30~|5s9 3z4h4i0|注=神龍元年正月廿五丙午（705年2月23日），武則天退位，唐中宗復辟。神龍元年二月中宗復國號唐。',
		'/景龍|707/10/1~710/7/30|9=4i0 4pzd5as 50r|注=神龍三年九月初五庚子（707年10月5日），改元景龍。景龍4年6月甲申改元唐隆。',
		'/殤帝/唐隆|710/7/2~8/28|6=50r|年號=唐元;唐興;唐安|君主=少帝|君主名=李重茂|生=695年|卒=714年|在位=710年7月8日~710年7月25日|注=景龍4年6月甲申改元唐隆，7月己巳改元景雲。|注=唐玄宗李隆基執政期的開元、天寶年間，因避諱而改稱唐元、唐興、唐安',
		'/睿宗/景雲|710/7/2~|6=50r 2xly|生=662年6月22日|卒=716年7月13日|在位=684年2月27日~690年10月16日  710年7月25日~712年9月8日|注=景龍4年/唐隆1年/景雲1年7月己巳改元景雲。',
		'/太極|712/2/12~|54w|注=景雲三年正月己丑改元為太極',
		'/延和|712/6/9~|5=37k|注=太極元年五月辛未改元為延和',
		'/玄宗/先天|712/9/6~|8=36d 4ei|諡=至道大聖大明孝皇帝|君主名=李隆基|生=685年9月8日|卒=762年5月3日|在位=712年9月8日~756年8月12日|注=延和元年八月辛未改元為先天|注=黄永年.1992-6.唐元和后期党争与宪宗之死: 睿宗延和元年八月庚子，睿宗傳位于皇太子玄宗，同日改元先天。',
		'/開元|713/12/22~|12=4ei 4sde5e1 3sws4ia 3tm 3a93436 579 3ql14gi 4sp84ma 4aa 3b5548a 47p 3psm47d 59g 4t4z5uw 4pln3px 3fe 4f54579 47e 3z4k|注=先天2年12月(唐玄宗開元元年十二月)庚寅朔改元為開元|注=唐许王李素节之子李琬、李琎墓志合考: 唐历开元六年十二月朔日确为庚申，而辛酉日为初二。',
		'/天寶|742/2/10~756/7/31|4i1 3u0 4ihe3p1 31p63oq 579 3qs649d 4i9 3swz4a2 3b1n505 41s|年名=載|注=三年正月朔改「年」為「載」',
		//
		'/肅宗/至德|756/8/1~|7=36y 4o144qo|諡=文明武德大聖大宣孝皇帝|君主名=李亨;李嗣昇;李浚;李璵|年名=載|生=711年|卒=762年5月19日|在位=756年8月12日~762年5月19日|注=稱「年」為「載」|注=黄永年.1992-6.唐元和后期党争与宪宗之死: 玄宗天寶十五載七月甲子，肅宗自立于靈武。同日改元至德。',
		'/乾元|758/3/14~|2=3oi 5uq 4090|年名=載|注=元年二月復載為年',
		'/上元|760/5/20~|閏4=40905ap',
		'/=/|761/12/2~762/6/26|50a|歲首=11|月名=建子;建丑;建寅;建卯;建辰;建巳;建午;建未;建申;建酉;建戌;建亥|注=參見:關於神會和尚生卒年代的改定|注=去上元年號大赦文: 其年但號元年，去上元之號，其以今年十一月為天正歲首，使建丑建寅，每月以所建為數。|注=唐肅宗建巳月(四月)十六日詔書:元年宜改為『寶應』，建巳月改為四月，餘月並依常數，仍依舊以正月初一日為歲首。',
		'/寶應|762/4/29~5/27|4=48a|注=元年四月十五日改元，並恢復寅正。',
		'/代宗/=|762/4/29~|4=48a 3mw1|諡=睿文孝武皇帝|君主名=李豫;李俶|生=726年11月11日|卒=779年6月10日|在位=762年5月18日~779年6月10日|注=寶應元年四月十五日改元，並恢復寅正。四月二十日唐代宗即位沿用。',
		'/廣德|763/8/24~|/7/11=3mw1 47p 3mmy47e 5dx|注=七月十一日，代宗下詔赦免天下，改年號|注=763年十月，吐蕃集中約二十萬軍隊東進，唐代宗出奔陝州。十月九日，吐蕃軍直入長安，占領長安十五天，唐朝叛將高暉和吐蕃大將馬重英立廣武王李承宏為皇帝。新舊《唐書》及《通鑑》記載曾改年號，名稱不明。十月二十一日吐蕃軍主動撤出長安|注=當時河西走廊被吐蕃佔領，唐朝西域與中原隔絕，西域將士不知道唐朝已改元，仍繼續使用廣德年號，有文物顯示他們至少使用該年號到「廣德四年」。',
		'/永泰|765/1/26~|3mmy47e',
		'/大曆|766/12/7~|11=47e 5dx 3st24aw 5aw 4igz59o 4g573md 4ei 55485e9 4a1 3bet',
		'/德宗/建中|780/2/11~|5ex 3p0 4mhd3o5|諡=神武孝文皇帝|君主名=李适|生=742年5月27日|卒=805年2月25日|在位=779年~805年',
		'/興元|784/1/27~|4nyy',
		'/貞元|785/2/14~|59e 5uq 3twl4ia 48a 3a9046l 3mik479 59g 4t545go 5as 3rd150q 505 3psh47d 4sgq5e9 49s',
		'/順宗/永貞|805/8/28~806/2/10|8=360 4pli|諡=至德宏道大聖大安孝皇帝|君主名=李誦|生=761年|卒=806年2月11日|在位=805年|注=五百家注昌黎文集 外集卷十: 順宗實錄卷五 八月庚子，詔曰：「...宜令皇太子即皇帝位，朕稱太上皇，居興慶宮，制敕稱誥。...」永貞元年八月辛丑，太上皇居興慶宮，誥曰：「...宜以今月九日，冊皇帝於宣政殿...宜改貞元二十一年為永貞元年...」...永貞二年正月景戌朔，（戌，史作寅，下同。）太上皇於興慶宮受朝賀...元和元年正月甲申，太上皇崩於興慶宮咸寧殿',
		'/憲宗/元和|806/1/24~821/2/5|4pli3px 3fe 4g4i577 3qjw61d 4lt 3g9k489 3p1 38et42y 591 3qs1|諡=昭文章武大聖至神孝皇帝|君主名=李純;李淳|注=原名李淳',
		'/穆宗/永新|820/3/22~|/2/5=3qs1|諡=睿聖文惠孝皇帝|君主名=李恆;李宥|生=唐德宗貞元11年7月6日生於大明宮之別殿|卒=824年|在位=820年~824年|注=黄永年.1992-6.唐元和后期党争与宪宗之死: 元和十五年正月二十七日庚子憲宗被殺，二十八日辛丑穆宗即位，以事屬政局特殊變動，在當年二月五日丁丑即提前改元永新，但稍後感到如此做法易引起人們對帝位交替産生疑問，於鞏固統治轉形不利，乃又取消此永新年號而按正常辦法在第二年正月三日辛丑改元長慶，同時將元和十五年二月五日丁丑赦文中改元永新之文字删除，其他文字中有永新年號者也一律竄易或毀去。',
		'/長慶|821/2/6~|49u 40965as 48a',
		'/敬宗/寶曆|825/1/23~|3a93445 35s|諡=睿武聖愍孝皇帝|君主名=李湛|生=809年7月22日|卒=827年1月2日|在位=824年~827年1月2日',
		'/文宗/大和|827/3/2~|2=42y 4o0z5d1 3st84a0 5as 3rlz52k 505|諡=元聖昭獻孝皇帝|君主名=李昂;李涵|年號=太和',
		'/開成|836/1/22~|3ql147e 5e1 3swh4a0',
		'/武宗/會昌|841/1/27~|4q3d3qi 3os 4g5j591 576|諡=至道昭肅孝皇帝|君主名=李炎;李瀍|生=814年7月1日|卒=846年4月22日|在位=840年2月20日~846年4月22日',
		'/宣宗/大中|847/1/21~|4sgz5e9 3twr4b6 3qi 3a93431 42t 4nys59g 5eq 3t4y4b8 3qyy|諡=元聖至明成武獻文睿智章仁神聰懿道大孝皇帝|君主名=李忱;李怡|生=810年7月27日|卒=859年9月10日|在位=846年4月22日~859年9月10日',
		'/懿宗/咸通|860/12/16~|11=35s 50a 46l 3mly47d 59g 4upv5go 4ja43p0 50a 4g4o579 47d 4pac|諡=昭聖恭惠孝皇帝|君主名=李漼;李溫|生=833年12月28日|卒=873年8月15日  唐文宗大和七年十一月十四|在位=859年~873年8月15日',
		'/僖宗/乾符|874/12/13~|11=35u 4i9 3vt 3a8y3p1 38ey|諡=惠聖恭定孝皇帝|君主名=李儇;李儼|生=862年|卒=888年|在位=873年~888年',
		'/廣明|880/2/14~|42y 58g',
		'/中和|881/7/30~|7=36d 3qs749u 5aq 3y8',
		'/光啟|885/3/20~|3=322r48a 3b1n35s',
		'/文德|888/3/17~|2=47p',
		'/昭宗/龍紀|889/2/4~|42y|諡=聖穆景文孝皇帝|君主名=李曄;李傑;李敏',
		'/大順|890/1/25~|4ofd5dx',
		'/景福|892/2/2~|4h0 4pl1',
		'/乾寧|894/2/10~|5es 48k 3npd505 468',
		'/光化|898/8/21~|8=2tei4zu 5s9 3y8',
		'/天復|901/4/22~|4=33me4aw 5bc 4xs',
		'/天祐|904/5/18~|閏4=2vwk|注=閏四月乙巳改元。',
		'/哀帝/=|904/9/12~907/5/14|8=361 3os 4mho3k0|君主名=李柷;李祚|生=892年10月27日|卒=908年3月26日|在位=904年9月27日~907年5月12日|注=原名祚|君主=昭宣帝|諡=昭宣光烈孝皇帝',

		// TODO: 唐朝割據勢力年號 法輪 (高曇晟), 始興 (高開道), 天明 (輔公祏)
		'/漢東王/天造|622/2/16~623/2/9|445 3oq|君主名=劉黑闥|注=《舊唐書》卷五十五：唐高祖武德五年正月，黑闥至相州，僭稱漢東王，建元為天造。',
		'/王摩沙/進通|623/2/10~624/1/25|/1/6=3oq|君主名=王摩沙|注=唐高祖武德六年正月壬午王摩沙起兵，自稱元帥',

		// 晚唐/唐朝統治地區其他勢力的年號
		// 安史之亂
		'燕/光烈帝/聖武|756/2/5~758/2/12|:唐|君主名=安祿山|諡=光烈皇帝|時期=隋唐|朝代=唐|注=757年正月，安慶緒殺父自立，對外宣稱安祿山退位。《新唐書》稱安慶緒當即改元載初，但《舊唐書》和《資治通鑑》均不載該年號。同年十月，安慶緒退守鄴城。《新唐書》稱改元「天和」，《資治通鑑》稱改元「天成」。根據出土的墓誌顯示，「聖武」年號最遲用至757年十月。《大燕故程府君墓志銘並序》（程思泰墓誌）則稱，志主程思泰在「天成元年歲次戊戌九月庚午朔三日壬申」遷葬鄴縣。則天成元年當是758年。疑《資治通鑑》漏載「改明年元」的「明年」二字。聖武年號應行用至該年年底。',
		'/哀帝/載初|757/1/30~|:唐|君主名=安慶緒|諡=晉剌王|注=該年號僅見於《新唐書·安慶緒傳》，《舊唐書》和《資治通鑒》均不載。根據出土墓誌可知，安慶緒並無此年號。|注=安祿山事跡: 十五載正月乙卯朔，祿山遣東都耆老緇黃勸進，遂偽即帝位，國曰大燕，自稱雄武皇帝...二年正月五日，遂相與謀殺祿山...祿山以天寶十四年乙未十一月反，...乾元二年己亥為史思明所殺',
		'/天成|758/2/13~759/5/1|:唐|年號=天和;至成|注=《資治通鑑》和《新唐書》將改元繫於757年十月。《大燕故程府君墓志銘並序》（程思泰墓誌）則稱志主程思泰於「天成元年歲次戊戌九月庚午朔三日壬申」遷葬鄴縣，則天成元年當是758年。758年，安慶緒據守鄴城，鄴縣一帶是安氏叛軍的領地，年號應該不會有錯。今從之。',
		'/昭武帝/應天|759/2/3~|:唐|君主名=史思明',
		'/順天|759/5/2~|:唐',
		'/末帝/顯聖|761/4/10~763/2/17|:唐|君主名=史朝義',
		// TODO:
		// https://zh.wikipedia.org/wiki/中国年号列表#唐朝

		'吐蕃/赤祖德贊/彝泰|815/2/13~839/1/18|:唐|疑|國號=大蕃|君主名=ཁྲི་རལ་པ་ཅན།;棄足德贊;可黎可足|年號=སྐྱིད་རྟག།|注=見於拉薩《長慶唐蕃會盟碑》，末書唐長慶及吐蕃彝泰紀元，是目前可考的唯一一個吐蕃的年號。大蕃彝泰九年，大唐長慶三年二月十四日，即陰水兔年春二月十四日',

		// 五代十國: 五代

		'朱梁/太祖/開平|907/5/15~|4=39x 58y 55bc5e9 45c|君主=神武元聖孝皇帝|君主名=朱晃;朱溫;朱全忠|朝代=後梁|時期=五代十國|生=852年12月9日|卒=912年7月18日|在位=907年~912年|注=四月二十二日大赦，改元「開平」，國號「大梁」',
		'/乾化|911/5/31~|5=3bl 3bj93u2',
		'/郢王/鳳曆|913/3/1~|/21=3u2|年號=鳳𠪱;鳳歷|君主名=朱友珪|表字=遙喜|卒=913年|在位=912年~913年|注=自乾隆年間開始避諱「曆」字，清代刊印的古籍改用「𠪱」字代替。|注=資治通鑑 卷第二百六十八. 乾化三年春正月丁巳晉周德威拔燕順州。癸亥郢王友珪朝享太廟。甲子祀圓丘大赦改元鳳𠪱。...二月...庚寅旦，袁象先等帥禁兵數千人突入宮中。友珪聞變，與妻張氏及馮廷諤趨北垣樓下，將逾城，自度不免，令廷諤先殺妻，次殺己，廷諤亦自剄。',
		'/末帝/乾化|913/3/28~|3/2/18=3u2 3ot 37wy|君主名=朱友貞;朱瑱;朱鍠|生=888年10月24日|卒=923年11月18日|在位=913年~923年|注=資治通鑑 卷268;太祖神武元聖孝皇帝下乾化三年...二月...庚寅旦...乃即帝位於大梁，復稱乾化三年...丙申',
		'/貞明|915/12/17~|/11/9=37wy42t 4nyy59g 5gi 3txi45c|注=資治通鑑 卷269;十一月乙丑改元',
		'/龍德|921/6/9~|5=3bo 48a 3y8',

		'後唐/莊宗/同光|923/4/19~|4=2xlw4z1 3prw3y8|君主=光聖神閔孝皇帝|君主名=李存勗;朱邪存勗;李存勖|時期=五代十國|生=885年12月2日|卒=926年5月15日|在位=923年5月13日~926年5月15日',
		'/明宗/天成|926/5/15~|4=3ex 59g 4uq05go 4qo|君主=聖德和武欽孝皇帝|君主名=李亶;李嗣源|生=867年10月10日|卒=933年12月15日|在位=926年6月3日~933年12月15日',
		'/長興|930/3/3~|2=3pw 4gnp3fu 505',
		'/閔帝/應順|934/1/18~|3oqp|君主=閔宗|君主名=李從厚|生=914年|卒=934年|在位=933年~934年',
		'/廢帝/清泰|934/5/16~|4=385 47d 5ag|君主名=李從珂;王從珂|君主=末帝|生=885年2月11日|卒=937年1月11日|在位=934年~937年',

		'後晉/高祖/天福|936/11/17~|11=2t6j3tf 3hl 3b1j3px 3my 4lxf|君主=聖文章武明德孝皇帝|君主名=石敬瑭|時期=五代十國|生=892年|卒=942年|在位=936年~942年|注=資治通鑑考異卷30：二年正月乙卯，日有食之。實錄：「正月甲寅朔，乙卯日食。」十國紀年：「蜀乙卯朔日食。」蓋晉人避三朝日食改歷耳。|注=資治通鑑/卷280: 十一月...己亥，制改長興七年為天福元年',
		'/出帝/天福|942/7/16~|7/6/=36y 591 48w|君主名=石重貴|生=914年|卒=974年|在位=942年~946年',
		'/開運|944/7/23~|7=2tlo4gy 5ea 35s',

		'後漢/高祖/天福|947/2/24~|12/2/=3t53|君主=睿文聖武昭肅孝皇帝|君主名=劉暠;劉知遠|時期=五代十國',
		'/乾祐|948/2/13~|35s|注=乾祐元年二月後漢隱帝劉承祐即位沿用，一直到後漢滅亡。',
		'/隱帝/=|948/3/14~|2=4aa 449 3mmt|君主名=劉承祐|生=931年|卒=950年|在位=948年~950年',

		'後周/太祖/廣順|951/2/9~|42y 59h 3z2p|君主=聖神恭肅文武孝皇帝|君主名=郭威|表字=文仲|時期=五代十國|生=904年|卒=954年|在位=951年~954年',
		'/顯德|954/2/6~3/7|35s',
		'/世宗/=|954/2/6~|4h0 4sqx5es 4ac 3qvb4xs|君主=睿武孝文皇帝|君主名=柴榮|生=921年10月27日|卒=959年7月27日|在位=954年2月26日~959年7月27日',
		'/恭帝/=|959/7/9~960/1/30|6/6/=385|君主=睿武孝文皇帝|君主名=柴宗訓|生=953年|卒=973年|在位=959年~960年|注=顯德七年（960年）正月元旦陳橋兵變，同年趙匡胤建立宋朝，改元「建隆」。',

		// |時期=隋唐
		'渤海/高王|697/12/20~|:唐|疑|諡=高王;고왕|君主名=大祚榮;대조영|據=Wikipedia;遼陽 金毓黻《渤海國志長編》卷五 年表第一 渤海國志三|卒=渤海國志長編第三册: 渤海國高王二十二年春三月丁酉王薨遣使赴唐告哀|年號=천통|注=乞乞仲象世子. 《桓檀古記》第七 大震國本紀: 大祚榮年號天統。大仲象年號重光 同為無據',
		// 應付久視元年十月甲寅恢復寅正。
		'/=|700/5/23~|3/5/=:唐|疑',
		'/武王/仁安|720/2/13~|:唐|疑|諡=武王;무왕|君主名=大武藝;대무예|卒=渤海國志長編第三册: 渤海國武王仁安十八年八月至 玄宗授以官又作書與王齎還王薨遣使赴唐告哀|年號=인안',
		'/文王/大興|738/1/25~|:唐|疑|諡=文王;문왕|君主名=大欽茂;대흠무|年號=대흥|卒=渤海國志長編第三册: 渤海國文王大興五十七年(成王中興元年)春王薨',
		'=/廢王|794/3/6~794/7/31|2=:唐|疑|諡=廢王;폐왕|君主名=大元義;대원의|注=渤海國志長編第三册: 元義嗣位二月壬戌遣王子清允等三十餘人朝唐授官有差 元義立數月遇下猜虐國人殺之',
		'/成王/中興|794/2/5~|:唐|疑|諡=成王;성왕|君主名=大華璵;대화여|年號=중흥|卒=渤海國志長編第三册: 中興元年冬成王薨',
		'/康王/正曆|795/1/26~|:唐|疑|諡=康王;강왕|君主名=大嵩璘;대숭린|年號=정력|卒=渤海國志長編第三册: 渤海國康王正曆十四年康王薨',
		'/定王/永德|810/2/8~|:唐|疑|諡=定王;정왕|君主名=大元瑜;대원유|年號=영덕|卒=渤海國志長編第三册: 渤海定王永德三年春正月癸酉使至唐憲宗御殿(麟德殿)延見賜宴甲申賜官告及衣(一襲)王薨',
		'/僖王/朱雀|813/2/5~818/4/8|:唐|疑|諡=僖王;희왕|君主名=大言義;대언의|年號=주작|卒=渤海國志長編第三册: 渤海僖王朱雀五年春二月遣使朝唐王薨',
		'/簡王/太始|818/2/9~|:唐|疑|諡=簡王;간왕|君主名=大明忠;대명충|年號=태시|卒=渤海國志長編第三册: 渤海簡王太始元年春正月改元二月王薨',
		'/宣王/建興|819/1/30~|:唐|疑|諡=宣王;선왕|君主名=大仁秀;대인수|年號=건흥|卒=渤海國志長編第三册: 建興十二年宣王薨',
		'/大彝震/咸和|831/2/16~|:唐|疑|君主名=대이진|年號=함화|注=渤海國志長編第三册: 史失其諡',
		'=/大虔晃|858/1/19~|:唐|疑|君主名=大虔晃;대건황|注=渤海國志長編第三册: 史失其年號. 十四年王薨史失其諡. 《桓檀古記·太白逸史》年號大定(無據)',
		'/大玄錫|872/2/13~|:唐|疑|君主名=大玄錫;대현석|注=渤海國志長編第三册: 史失其年號. 二十二年王薨史失其諡. 《桓檀古記·太白逸史》年號天福(無據)',
		'/大瑋瑎|894/2/10~|:唐|疑|君主名=大瑋瑎;대위해|注=渤海國志長編第三册: 史失其年號. 十三年...是年王薨史失其諡',
		'/末王|907/2/15~926/9/16|:中國|疑|君主名=大諲譔;대인선|注=渤海國志長編第三册: 史失其年號. 渤海大諲譔二十年...八月辛卯長嶺府陷於契丹 王弟率兵攻扶餘城不克 保眾而退 於是凡百有三城皆入於契丹 渤海國亡. Wikipedia: 926年3月6日，契丹國滅渤海國，渤海王大諲譔被俘虜。934年，世子大光顯率部民數萬流亡高麗. 《桓檀古記·太白逸史》年號清泰(無據)',

		// 五代十國: 十國

		'楊吳/太祖/天復|902/4/11~|2/3/=:中國|疑|君主=吳武帝|君主名=楊行密;楊行愍|表字=化源|據=時間規範資料庫|國號=南吳;弘農;淮南|時期=五代十國|生=852年|卒=905年|在位=902年~905年',
		'/天祐|904/1/21~|:中國|疑',
		'/烈宗/=|905/12/24~|2/11/26=:中國|疑|君主=景皇帝|君主名=楊渥|表字=承天|生=886年|卒=908年|在位=905年~908年',
		'/高祖/=|908/6/10~|5/5/9=:中國|疑|君主=宣帝|君主名=楊隆演;楊瀛;楊渭|表字=鴻源|生=897年|卒=920年|在位=908年~920年',
		'/武義|919/5/3~|4=:中國|疑',
		'/睿帝/=|920/7/6~937/11/10|2/6/18=:中國|疑|君主名=楊溥|諡=睿皇帝|生=900年|卒=南唐昇元二年十一月辛丑|在位=920年~937年|注=《十國春秋》吳三·睿帝本紀:十一月辛丑，有使者來丹楊宮，楊溥方頌佛經於樓上，使者趨前，楊溥以香爐擲之，俄而去世，終年三十八歲。',
		'/順義|921/3/13~|2=:中國|疑',
		'/乾貞|927/12/13~|/11/17=:中國|疑',
		'/大和|929/12/30~|/11/27=:中國|疑|注=太和?',
		'/天祚|935/10/4~936/1/26|/9/4=:中國|疑',

		'南唐/烈祖/昇元|937/11/11~|10=:中國|疑|年號=升元|諡=光文肅武孝高皇帝|君主名=李昪;徐知誥|表字=正倫|據=時間規範資料庫|時期=五代十國|生=889年1月7日|卒=943年3月30日|在位=937年~943年|注=937年十月乙酉，楊溥讓位予徐知誥，南吳亡。',
		'/元宗/保大|943/4/8~|3=:中國|疑|諡=明道崇德文宣孝皇帝|君主名=李璟;李景通;李景|表字=伯玉|生=916年|卒=961年8月12日|在位=943年~961年',
		'/中興|958/1/23~|:中國|疑',
		'/交泰|958/3/23~|3=:中國|疑|注=957年後周派兵侵入南唐，佔領了南唐淮南江北的大片土地，並長驅直入到長江一帶，李璟只好向後周世宗柴榮稱臣，去帝號，自稱唐國主，年號由原本的交泰改為後周的顯德。',
		'/顯德|958/6/20~|5/6/=:中國|疑',
		'/建隆|960/2/4~|/1/5=:中國|疑',
		'/後主/=|961/8/12~|2/6/28=:中國|疑|君主=李後主|君主名=李煜;李從嘉|表字=重光|生=天祚三年|卒=太平兴国三年|在位=961年~975年|注=宋朝於963年十一月正式向南唐頒曆後，南唐後主李煜才停止使用後周顯德年號，開始用北宋建隆年號紀年（963年）。',
		'/乾德|963/12/4~|/11/16=:中國|疑',
		'/開寶|968/12/16~976/12/23|/11/24=:中國|疑',

		'吳越/太祖/天祐|907/6/14~|4/5/=:中國|疑|據=時間規範資料庫|諡=武肅王|君主名=錢鏐|表字=具美;巨美|時期=五代十國|生=852年3月10日|卒=932年5月6日|在位=907年~932年',
		'/天寶|908/2/5~|:中國|疑',
		'/鳳歷|913/2/9~|:中國|疑',
		'/乾化|913/3/28~|3/2/18=:中國|疑',
		'/貞明|915/12/17~|/11/9=:中國|疑',
		'/龍德|921/6/9~|5=:中國|疑',
		'/寶大|924/2/8~|:中國|疑',
		'/寶正|926/2/15~|:中國|疑',
		'/世宗/長興|932/5/6~|3/3/28=:中國|疑|諡=文穆王|君主名=錢元瓘;錢傳瓘|表字=明寶|生=887年|卒=941年|在位=932年~941年',
		'/應順|934/1/18~|:中國|疑',
		'/清泰|934/5/16~|4=:中國|疑',
		'/天福|936/11/17~|11=:中國|疑',
		'/成宗/=|941/9/18~|6/8/25=:中國|疑|諡=忠獻王|君主名=錢弘佐|表字=元祐|生=928年|卒=947年6月22日|在位=941年~947年',
		'/開運|944/7/23~|7=:中國|疑',
		'/忠遜王/天福|947/3/10~|12/2/15=:中國|疑|君主名=錢宏倧|表字=隆道|注=947年吳越忠遜王錢弘倧，荊南文獻王高從誨、楚廢王馬希廣（四月）再用此年號。',
		'/忠懿王/=|948/2/13~|13/=:中國|疑|君主名=錢俶;錢宏俶|表字=文德|生=929/9/29|卒=端拱元年八月二十四日|在位=948年~978年|注=乾祐元年正月乙卯，錢弘俶即位於杭州吳越王宮天寵堂。',
		'/乾祐|948/2/17~|/1/5=:中國|疑',
		'/廣順|951/2/13~|/1/5=:中國|疑',
		'/顯德|954/2/6~|:中國|疑',
		'/建隆|960/2/4~|/1/5=:中國|疑',
		'/乾德|963/12/4~|/11/16=:中國|疑',
		'/開寶|968/12/16~|/11/24=:中國|疑',
		'/太平興國|977/1/14~978/7/7|/12/22=:中國|疑|注=太平興國三年五月乙酉，吳越丞相崔仁冀勸錢俶上表納土，錢俶遂當即上奏',

		'閩/太祖/開平|909/1/25~|3/=:中國|疑|君主=昭武孝皇帝|君主名=王審知|表字=信通|據=時間規範資料庫|時期=五代十國|生=862年|卒=925年|在位=909年~925年',
		'/乾化|911/5/31~|5=:中國|疑',
		'/貞明|915/12/17~|/11/9=:中國|疑',
		'/龍德|921/6/9~|5=:中國|疑',
		'/同光|923/4/19~|4=:中國|疑',
		'/嗣王/天成|926/2/15~|:中國|疑|君主名=王延翰|表字=子逸|卒=927年|在位=926年|注=天成元年十二月初八王延翰被王延稟抓獲並斬首。',
		'/惠宗/=|927/1/7~|12=:中國|疑|君主=齊肅明孝皇帝|君主名=王璘;王延鈞|卒=935年|在位=926年~935年',
		'/長興|930/3/3~|2=:中國|疑',
		'/龍啟|933/1/29~|:中國|疑',
		'/永和|935/2/6~|:中國|疑',
		'/康宗/通文|936/3/26~|3=:中國|疑|君主=神聖英睿文明廣武應道大宏孝皇帝|君主名=王昶;王繼鵬',
		'/景宗/永隆|939/8/30~|/閏7/13=:中國|疑|君主=睿文廣武明聖元德隆道大孝皇帝|君主名=王曦;王延羲',
		'/恭懿王/天德|943/3/9~945/10/8|2=:中國|疑|君主=天德帝|君主名=王延政|諡=恭懿|卒=951年|在位=943年~945年',

		'北漢/世祖/乾佑|951/2/24~|4/1/16=:中國|疑|君主=武帝|君主名=劉旻;劉崇|據=時間規範資料庫|時期=五代十國|生=895年|卒=954年|在位=951年~954年|注=沿用後漢年號',
		'/睿宗/=|954/11/28~|7/11/=:中國|疑|君主=孝和帝|君主名=劉承鈞|生=926年|卒=968年|在位=954年~968年|注=沿用後漢年號',
		'/天會|957/2/3~|:中國|疑',
		'/少主/=|968/7/28~|12/7/=:中國|疑|君主名=劉繼恩;薛繼恩|生=10世紀？|卒=968年|在位=968年',
		'/英武帝/天會|968/9/25~|12/9/=:中國|疑|君主名=劉繼元;何繼元|生=10世紀？|卒=992年|在位=968年~979年',
		'/廣運|974/1/26~979/6/26|:中國|疑',

		'前蜀/高祖/天復|907/11/3~|7/9/25=:中國|疑|君主=神武聖文孝德明惠皇帝|君主名=王建|表字=光圖|據=時間規範資料庫|時期=五代十國|注=903年，唐昭宗封王建为蜀王。唐哀帝天祐四年（907年），王建不服后梁统治，建国号“蜀”，史称“前蜀”，定都成都。',
		'/武成|908/2/5~|:中國|疑',
		'/永平|911/2/2~|:中國|疑',
		'/通正|916/2/6~|:中國|疑',
		'/天漢|917/1/26~|:中國|疑',
		'/光天|918/2/14~|:中國|疑',
		'/後主/=|918/7/11~|6=:中國|疑|君主=順正公|君主名=王衍;王宗衍|表字=化源',
		'/乾德|919/2/4~|:中國|疑',
		'/咸康|925/1/27~925/12/15|:中國|疑',

		'後蜀/高祖/明德|934/5/16~|4=:中國|疑|君主=文武聖德英烈明孝皇帝|君主名=孟知祥|表字=保胤|據=時間規範資料庫|國號=大蜀|時期=五代十國|生=874年6月9日|卒=934年9月7日|在位=934年|注=閏一月即位',
		'/後主/=|934/8/13~|7=:中國|疑|君主名=孟昶;孟仁贊|表字=保元|生=919年12月9日(蜀梼杌校笺)|卒=965年7月12日(蜀梼杌校笺)|在位=934年~965年',
		'/廣政|938/2/2~939/1/22|:中國|疑',

		// TODO:
		// https://zh.wikipedia.org/wiki/%E4%BA%94%E4%BB%A3%E5%8D%81%E5%9B%BD#.E5.85.B6.E4.BB.96.E8.97.A9.E9.8E.AE.E5.8B.A2.E5.8A.9B
		'岐/岐王/天祐|907/5/15~925/1/26|4/=:中國|疑|時期=五代十國|君主名=李茂貞;宋文通;田彥賓|諡=忠敬王|生=856年|卒=924年|據=Wikipedia|注=Wikipedia: 晉、岐、前蜀與吳敵視後梁、依舊奉唐室年號。岐國天祐二十年（923年），後唐莊宗李存勖滅後梁，李茂貞於是在次年（924年）向後唐稱臣，李存勖則將李茂貞改封秦王，具有獨立性質的岐王國因此消失，數月後李茂貞去世，諡忠敬王（秦忠敬王）。子李從曮襲爵，後唐時輾轉各地任職。後晉時代李從曮再任岐王，歸鳳翔任職，946年李從曮死亡，其子李永吉不復封岐王，岐國名實皆亡。',

		// 沿用後唐年號
		'南楚/武穆王/開平|907/5/15~|4=:中國|疑|君主=武穆公|君主名=馬殷|表字=覇圖|朝代=馬楚|據=Wikipedia|時期=五代十國|生=852年|卒=930年12月2日|在位=907年~930年|注=Wikipedia: 後梁開平元年（907年），朱溫封馬殷為楚王，都於潭州（今長沙），開平四年（910年）六月加封「天策上將軍」。',
		'/乾化|911/5/31~|5=:中國|疑',
		'/鳳歷|913/3/1~|/21=:中國|疑',
		'/乾化|913/3/28~|3/2/18=:中國|疑',
		'/貞明|915/12/17~|/11/9=:中國|疑',
		'/龍德|921/6/9~|5=:中國|疑',
		'/同光|923/4/19~|4=:中國|疑|據=Wikipedia|注=Wikipedia: 後唐滅後梁後，明宗天成二年（927年）六月又冊封為楚國王，同年八月冊封使至，馬殷乃建立楚國，立宮殿、置百官，以潭州為都城，改名長沙府，使用後唐年號。',
		'/天成|926/5/15~|4=:中國|疑',
		'/長興|930/3/3~|2=:中國|疑',
		'/馬希聲/=|930/12/2~|/11/10=:中國|疑|君主=衡陽王|表字=若訥|據=Wikipedia|注=長興元年十一月十日（930年12月2日），馬殷去世，時年79，遺命諸子兄弟相繼。後唐明宗罷朝三天，下詔賜馬殷諡號武穆王。次子馬希聲繼其位，遵從父親的遺命，不再稱楚國，而是降低規格，恢復了節度使的稱號',
		'/文昭王/=|932/9/3~|3/8=:中國|疑|君主名=馬希範|表字=寶規|據=Wikipedia|生=899年|卒=947年|在位=932年~947年|注=後唐明宗清泰元年（934年），馬希範被封為楚王。之後又被封為天策上將軍。',
		'/應順|934/1/18~|:中國|疑',
		'/清泰|934/5/16~|4=:中國|疑',
		'/天福|936/11/17~|11=:中國|疑',
		'/開運|944/7/23~|7=:中國|疑|注=Wikipedia: 後晉出帝石重貴的年號',
		'/廢王/天福|947/5/23~|12/5=:中國|疑|據=Wikipedia|君主名=馬希廣|表字=德丕|據=Wikipedia|卒=950年|在位=947年~950年|注=後漢高祖天福十二年（947年），馬希範去世，將領排除馬希範諸弟中年齡最長的馬希萼，而擁護馬希廣繼立，後漢封馬希廣天策上將軍、楚王',
		'/乾祐|948/2/13~|:中國|疑',
		'/恭孝王/保大|951/1/24~|8/12/14=:中國|疑|據=Wikipedia|君主名=馬希萼|據=Wikipedia|生=900|卒=953|在位=950年~951年|注=馬希廣於後漢乾祐三年（950年）十二月十二日被馬希萼所擒，兩日後，馬希萼登楚王位。保大八年至九年（950年十二月-951年十一月）用南唐元宗李璟的年號',
		'/馬希崇/=|951/10/4~951/12/1|9=:中國|疑|據=Wikipedia|君主=後主|據=Wikipedia|注=馬希崇率家族投降，南楚亡。',

		'荊南/武信王/同光|924/4/7~|2/3=:中國|疑|君主=楚武信王|君主名=高季興;高季昌|表字=貽孫|朝代=南平;北楚|據=Wikipedia|時期=五代十國|生=858年|卒=929年|在位=924年~929年|注=原名高季昌|注=Wikipedia: 後唐同光二年（924年）封為南平王，建都荊州，史稱「南平」。',
		'/天成|926/5/15~|4=:中國|疑',
		'/文獻王/=|929/1/28~|3/12/15=:中國|疑|君主名=高從誨|表字=遵聖|諡=文獻王|據=Wikipedia|生=891年|卒=948年|在位=928年~948年|注=Wikipedia: 後唐明宗李嗣源天成三年（928年）十二月十五日（929年1月28日），被後唐冊封為南平王的高季興去世，高從誨嗣位。長興三年（932年），被封為渤海王。後唐閔帝李從厚應順元年（934年）被改封南平王。後漢隱帝劉承祐乾祐元年（948年），高從誨去世，贈尚書令，諡文獻王。其子高保融繼位。',
		'/長興|930/3/3~|2=:中國|疑',
		'/應順|934/1/18~|:中國|疑',
		'/清泰|934/5/16~|4=:中國|疑',
		'/天福|936/11/17~|11=:中國|疑',
		'/乾祐|948/2/13~|:中國|疑',
		'/貞懿王/=|948/12/4~|11=:中國|疑|君主名=高保融|表字=高德長|據=Wikipedia|生=920年|卒=960年|在位=948年~960年|注=Wikipedia: 後周太祖郭威廣順元年（951年），被封為渤海郡王。顯德元年（954年），再被進封為南平王。因病去世，贈太尉，諡貞懿王。其子高繼沖年紀尚小，因此遺命高保勗繼位。',
		'/廣順|951/2/9~|:中國|疑',
		'/顯德|954/2/6~|:中國|疑',
		'/建隆|960/1/31~|:中國|疑',
		'/貞安王/=|960/8/25~|8=:中國|疑|君主=侍中|君主名=高保勗|據=Wikipedia|生=924年|卒=962年|在位=960年~962年|注=Wikipedia: 宋太祖趙匡胤建隆元年（960年），高保融因病去世，其子高繼沖年紀尚小，因此遺命高保勗繼位，總判內外軍馬事。不久，即為宋任命為荊南節度使。',
		'/德仁王/=|962/11/30~963/6/23|3/11=:中國|疑|君主=侍中|君主名=高繼沖|表字=成和|據=Wikipedia|生=943年|卒=973年|在位=962年~963年|注=Wikipedia: 宋太祖趙匡胤建隆三年（962年），高保勗因病去世，遺命高繼沖權判內外軍馬事以繼其位。後來高繼沖亦被宋任命為荊南節度使。建隆四年（963年），宋軍討伐張文表，假道荊南，發生荊湖之戰，趁機控制南平都城江陵（今湖北江陵）城巷，高繼沖只得納地以歸，南平亡。',

		'南漢/高祖/乾亨|917/7/22~|7=:中國|疑|君主=天皇大帝|君主名=劉龑;劉巖;劉陟|據=時間規範資料庫|時期=五代十國|生=889年|卒=942年|在位=917年~942年|曆法=崇玄曆|注=張金銑《南漢曆法初考》: 可能自造新曆，因與中原不相往來而未載。',
		'/白龍|925/12/19~|12=:中國|疑',
		'/大有|928/3/25~|3=:中國|疑',
		'/殤帝/光天|942/5/18~|4=:中國|疑|君主名=劉玢;劉弘度|生=920年|卒=943年|在位=942年~943年',
		'/中宗/應乾|943/4/8~|3=:中國|疑|君主=文武光聖明孝皇帝|君主名=劉晟;劉弘熙|生=920年|卒=958年|在位=943年~958年',
		'/乾和|943/11/30~|11=:中國|疑|注=張金銑《南漢曆法初考》: 清代謝啟昆所編《粵西金石志》、《南漢感 報寺銅鐘款文》有「 維大漢乾和十六年太歲戊午閏六月庚辰朔十六日己未」之語。',
		'/後主/大寶|958/9/16~971/3/28|8=:中國|疑|君主=後主;恩赦侯|君主名=劉鋹;劉繼興|生=942年|卒=980年|在位=958年~971年|注=原名劉繼興|注=張金銑《南漢曆法初考》: 《南漢乾亨寺銅鐘款文》載其銅鐘鑄造時間亦稱「 維大漢大寶四年歲次辛酉九月辛酉朔二十五日」 。',

		// 宋朝;趙宋
		'北宋/太祖/建隆|960/1/31~|46i 4rkz5s9 4h4|君主=啟運立極英武睿文神德聖功至明大孝皇帝|君主名=趙匡胤|朝代=宋|時期=兩宋|生=927年3月21日|卒=976年11月14日|在位=960年2月4日~976年11月14日|注=[[s:宋史/卷003]] 開寶九年冬十月癸丑夕，帝崩於萬歲殿...太平興國二年四月乙卯，葬永昌陵。',
		'/乾德|963/11/19~|11=2t5o4aw 5bc 4ihk3p0 578',
		'/開寶|968/11/23~|11=35u 4fv958y 5sh 400i4b5 3ep648a 3p1|年號=開寳|注=九年十月宋太宗即位沿用。',
		'/太宗/開寶|976/11/14~|9/10/20=3p1|君主=至仁應道神功聖德文武大明廣孝皇帝|君主名=趙炅;趙匡義;趙光義|生=939年11月20日|卒=997年5月8日|在位=976年11月15日~997年5月8日 (:s:宋史/卷5 三月丁卯，占城國來貢。壬辰，不視朝。癸巳，追班于萬歲殿，宣詔令皇太子柩前即位。是日崩，年五十九。在位二十二年，殯于殿之西階。群臣上尊諡曰神功聖德文武皇帝，廟號太宗。十月己酉，葬永熙陵。)|注=[[s:宋史/卷004]] 開寶九年冬十月癸丑，太祖崩，帝遂即皇帝位。...十二月甲寅...改是歲為太平興國元年。',
		'/太平興國|977/1/14~|1/12/22=3p1 37x342t 58y 55c35uq 40984ic 488|注=[[s:宋史/卷004]] 開寶九年十二月甲寅...改是歲為太平興國元年。',
		'/雍熙|984/11/26~|11=35u 3mw946t 46i',
		'/端拱|988/1/22~|4oet5dw',
		'/淳化|990/1/30~|5us 40aq5as 4gne57u',
		'/至道|995/2/3~|505 3ql347d|注=三年三月宋真宗即位沿用',
		'/真宗/咸平|998/1/31~|5e1 3swj4a0 4plo3px 3oq|君主=應符稽古神功讓德文明武定章聖元孝皇帝|君主名=趙恆;趙德昌;趙元休;趙元侃',
		'/景德|1004/1/25~|4mg9591 4gi 4so5',
		'/大中祥符|1008/2/10~|5ea 4aa 3b4y449 3mmy46i 5np 3z2u4h0|注=高麗自1016年起用北宋年號',
		'/天禧|1017/1/31~|5es 3t504ac 3qz0505',
		'/乾興|1022/2/4~|4yy|注=二月宋仁宗即位沿用',
		'/仁宗/天聖|1023/1/25~|54895sa 4i0 4t913u0 52s 4g9e3me 4fve58w|君主=體天法道極功全德神文聖武睿哲明孝皇帝|君主名=趙禎;趙受益',
		'/明道|1032/12/6~|11=35u 5u9',
		'/景祐|1034/1/23~|400m4i9 3u1 3a90',
		'/寶元|1038/2/7~|3p1 39i435s',
		'/康定|1040/3/16~|2=46d 58w',
		'/慶曆|1041/11/27~|11=35u 56x55uq 4ic 3rd148a 439 3mmp',
		'/皇祐|1049/2/5~|46h 4oez5dw 5us 4pl34qo',
		'/至和|1054/4/11~|3=3pw 50q 4g03',
		'/嘉祐|1056/10/12~|9=362 505 3ql8495 5e1 3swo4a1 3q1|注=八年四月宋英宗即位沿用',
		'/英宗/治平|1064/1/21~|32513oq 579 3qkz|君主=體乾應歷隆功盛德憲文肅武睿聖宣孝皇帝|君主名=趙曙;趙宗實|注=四年正月宋神宗即位沿用',
		'/神宗/熙寧|1068/2/6~|4gi 4sob5eq 4aa 3b5347u 42y 4o105np 4gy|紀年=熙甯|君主=紹天法古運德建功英文烈武欽仁聖孝皇帝|君主名=趙頊;趙仲瑊',
		'/元豐|1078/1/17~|4sox5es 3t6x52s 47u 3mna4zu 5r9|注=八年二月宋哲宗即位沿用',
		'/哲宗/元祐|1086/1/18~|3z4i4i0 4t983u0 52s 4g9k3mi 56z 3y8|君主=憲元繼道顯德定功欽文睿武齊聖昭孝皇帝|君主名=趙煦;趙傭|生=1077年1月4日|卒=1100年2月23日|在位=1085年4月1日~1100年2月23日',
		'/紹聖|1094/4/18~|4=319g5sh 4i9 3eoi3r4',
		'/元符|1098/7/2~|6=38p 3a953p1|注=三年正月宋徽宗即位沿用',
		'/徽宗/建中靖國|1101/1/31~|3oa|君主=體神合道駿烈聖文仁德憲慈顯孝皇帝|君主名=趙佶|生=1082年11月2日|卒=1135年6月4日|在位=1100年2月23日~1126年1月18日',
		'/崇寧|1102/1/21~|4mg659e 5ua 40824ic',
		'/大觀|1107/1/26~|3rd648a 439 3mmw',
		'/政和|1111/2/10~|46i 59g 57d05uw 5as 3rcx50q 4g3t',
		'/重和|1118/12/15~|11=35u 4qo',
		'/宣和|1119/3/13~|2=3md 47e 4sh15e1 4a0 4poz3q1|注=七年二月宋欽宗即位沿用',
		'/欽宗/靖康|1126/1/25~1127/6/11|32573k0|君主=恭文順德仁孝皇帝|君主名=趙桓;趙亶;趙烜|生=1100年5月23日|卒=5月1156年|在位=1126年1月19日~1127年3月20日',

		'/趙諗/隆興|1101/9/25~1102/3/20|:北宋|疑|年號=龍興|生=1079年|卒=宋徽宗崇寧元年二月|注=趙諗不滿宋哲宗貶黜蘇軾，與張懷素暗中抨擊，趙諗自稱天子，並私立年號隆興。宋徽宗崇寧元年二月，還鄉探視父母時，被人密告私立年號隆興為蓄意謀反被誅。',
		'/聖公/永樂|1120/11/1~1121/5/12|:北宋|疑|君主名=方臘|生=1048年|卒=宣和三年八月丙辰|注=《宣和遺事》作宣和二年十月改元永樂。而《續資治通鑑》作十一月戊戌改元。宣和二年十月初九方臘率眾在歙縣七賢村起事，改元永樂。宣和三年四月二十四日，王淵的裨將韓世忠生擒方臘。方臘及其相方肥等五十二人被俘。七月戊子，童貫俘方臘送往首都汴京，八月丙辰伏誅。史稱方臘之亂。',

		// 北宋統治地區出現的其他勢力年號
		'李蜀/李順/應運|994/3/1~994/6/17|:北宋|時期=兩宋|注=淳化四年二月，青城縣（今都江堰市西部）茶農王小波提出「均貧富」的口號，宣稱「吾疾貧富不均，今為汝均之」，發動起義。同年十二月他犧牲後，起義軍由其妻弟李順領導，繼續戰鬥。淳化五年正月十六日占領成都，李順隨即自立為王，建國「大蜀」，定都成都。五月六日，成都被北宋軍隊攻克，李蜀覆滅。',
		'王蜀/王均/化順|1000/2/8~1000/11/28|:北宋|時期=兩宋|注=咸平三年元旦，戍卒趙延順不堪上級壓迫，率眾殺死符昭壽，占領益州。以王均為領袖，國號大蜀，年號化順，攻破漢州（今四川廣漢），眾至十餘萬。九月，宋軍大軍進攻，成都城破。十月，自縊而死，起義失敗。',
		'安陽/東平郡王/得聖|1047/11/20~1048/3/16|12=3mi 4mg2|君主名=王則|時期=兩宋|注=宋史/卷292: 則僣號東平郡王，以張巒為宰相，蔔吉為樞密使，建國曰安陽。榜所居門曰中京，居室廄庫皆立名號，改年曰得聖，以十二月為正月。|注=年號或作得勝、德勝、得天，誤|注=王則等人在東京（今河南開封）被斬。前後僅65天。',
		'長生國/昭聖皇帝|1029/1/18~|:北宋|疑|君主名=儂智高|生=1025年|卒=1055年|時期=兩宋|注=後李太宗天成二年後在北宋廣南西路廣源州，今靖西、田東一帶建立「長生國」（一作「長其國」），自稱「昭聖皇帝」。儂全福一度依附大瞿越李朝，但不久又宣布獨立，不接受李朝的宗主地位。',
		'大曆國/儂智高|1041/11/27~|:北宋|疑|君主名=儂智高|生=1025年|卒=1055年|時期=兩宋|注=宋仁宗慶曆元年自立為王，國號「大曆國」。',
		'南天國/儂智高/景瑞|1049/2/5~|:北宋|疑|君主名=儂智高|生=1025年|卒=1055年|時期=兩宋|注=慶曆五年，儂智高占領安德州，宣布建立「南天國」，年號景瑞，再次與李朝決裂。',
		'大南/仁惠皇帝/啟歷|1052/5/31~1053/3/21|:北宋|疑|時期=兩宋|君主名=儂智高|生=1025年|卒=1055年|注=皇祐四年四月初六，儂智高以五千人起兵。五月初一攻占邕州（在今廣西壯族自治區境），守將張日新等戰死，邕州指揮使元斌貝被儂智高生擒。儂智高在邕州自立為「仁惠皇帝」，國號「大南」，年號啟歷。|注=皇祐五年正月己未與狄青決戰於邕州歸仁鋪戰役，儂智高率殘兵退入邕州。二月己亥，狄青班師至桂林。|注=另《玉海》還有「端懿」年號，不詳何時。《紀元編》又有「大曆」年號，李崇智認為是儂智高國號。',

		'南宋/高宗/建炎|1127/6/12~|5=3ai 579 3wwo4gi|君主=受命中興全功至德聖神武文昭仁憲孝皇帝|君主名=趙構|表字=德基|朝代=宋|時期=兩宋|生=1107年6月12日|卒=1187年11月9日|在位=1127年6月12日~1162年7月24日',
		'/紹興|1131/1/31~|5e9 3t444aa 3q2 38gy42z 39gq5r9 4gy 4sp25es 4ac 3nt050a 3mp74zv 47d 3z4o4i0 5ew 4ih059w 4g9o3mi 577 3qju5u9 4i9 3eom3u1 3p1 380i|注=三十二年六月宋孝宗即位沿用',
		'/孝宗/隆興|1163/2/5~|3oq 4o17|君主=紹統同道冠德昭功哲文神武明聖成孝皇帝|君主名=趙眘;趙伯琮;趙瑗;趙瑋|表字=元永',
		'/乾道|1165/2/13~|59g 5uq 40874ig 48a 3a91439 42y 4o0x',
		// 淳"煕": see [[中山世譜/卷03]]
		'/淳熙|1174/2/4~|5d0 57dl4a0 5as 3rd250q 505 3psj47e 4sh75e9 4a0 4pp33q1 3fw 4g4l|紀年=湻熙;淳煕|注=十六年二月宋光宗即位沿用',
		'/光宗/紹熙|1190/2/7~|579 4ei 4sgy5e9 3t4a|君主=循道憲仁明功茂德溫文順武聖哲慈孝皇帝|君主名=趙惇|生=1147年9月30日|卒=1200年9月17日|在位=1189年2月18日~1194年7月24日|注=五年七月宋寧宗即位沿用',
		'/寧宗/慶元|1195/2/12~|4aa 3q1 3a1y431 3o5 4nyq|君主=法天備道純德茂功仁文哲武聖睿恭孝皇帝|君主名=趙擴|生=1168年11月18日|卒=1224年9月18日|在位=1194年7月24日~1224年9月18日',
		'/嘉泰|1201/2/5~|4gy 4t3g5es 4ac',
		'/開禧|1205/1/22~|3qyw50a 42z',
		'/嘉定|1208/1/19~|3mic47d 4h0 4t4y5ew 4ih559w 50a 4f53577 47d 400j4i9 3eos3u1 3p1 380o|注=十七年八月宋理宗即位沿用',
		'/理宗/寶慶|1225/2/9~|42y 591 3qrp|君主=建道備德大功復興烈文仁武聖明宏孝皇帝|君主名=趙昀;趙貴誠|生=1205年1月26日|卒=1264年11月16日|在位=1224年9月17日~1264年11月16日',
		'/紹定|1228/2/8~|5uq 4i9 3epu48a 3a95445',
		'/端平|1234/1/31~|42y 4o135d1',
		'/嘉熙|1237/1/28~|49w 4pl05as 3rf0|紀年=嘉煕',
		'/淳祐|1241/2/13~|50s 505 3pso47e 5e1 3swk4a0 5aw 4gpe3ho 4fd6591',
		'/寶祐|1253/1/31~|56y 4sh25e9 4a9 3b503q1',
		'/開慶|1259/1/25~|3a23',
		'/景定|1260/2/13~|431 42d 4nyx59k 5eq|注=五年十月宋度宗即位沿用',
		'/度宗/咸淳|1265/1/19~|3t514ac 47u 3mox431 3mje47d 4h0 4t525ew|君主=端文明武景孝皇帝|君主名=趙禥;趙孟哲;趙孜|生=1240年5月2日|卒=1274年8月12日|在位=1264年11月16日~1274年8月12日|注=十年七月宋恭帝即位沿用',
		'/恭帝/德祐|1275/1/29~|52s 3oqr|君主=恭宗|尊號=孝恭懿聖皇帝|廟號=恭帝|君主名=趙㬎;趙顯|生=1271年11月2日|卒=1323年5月|在位=1274年8月12日~1276年2月4日',
		'/端宗/景炎|1276/6/14~|5=3as 50a 4xs|君主=裕文昭武愍孝皇帝|君主名=趙昰|生=1269年7月10日|卒=1278年5月8日|在位=1276年6月14日~1278年5月8日',
		'/帝昺/祥興|1278/5/23~1279/4/12|5=2v1n4qo|君主=昺帝|君主名=趙昺|生=1272年2月12日|卒=1279年3月19日|在位=1278年5月10日~1279年3月19日',
		// 非正統皇帝
		'/元懿太子/明受|1129/3/26~4/22|:南宋|君主名=趙旉|諡=元懿太子|生=1127年7月23日|卒=1129年7月27日|在位=1129年3月23日~1129年4月20日|注=建炎三年金人入侵淮南，三月癸未，高宗在揚州遇上苗傅、劉正彥作亂，逼迫高宗退位，擁立魏國公趙旉為傀儡皇帝，己丑改年號為明受，是為苗劉兵變。宰相張浚等聞知，舉兵向傅、正彥二人問罪。四月戊申高宗復位。庚戌傅、正彥二人兵敗逃走，年號改回建炎。丁卯高宗遷往臨安府（今浙江杭州），壬申趙旉被冊立為皇太子。五月乙酉隨父親一起抵達建康（今江蘇南京）。趙旉立為太子後不久就生病，宮人不小心踢到金爐發出聲響，太子受到驚嚇，隨後病情轉劇，七月丁亥去世，得年僅2歲。',
		// 元祐皇后（垂簾聽政） |君主性別=女

		'/楚王/天載|1130/3/12~5/8|:南宋|君主名=鐘相|卒=1130年|年號=天戰',

		// TODO: 南宋統治地區其他勢力年號
		'劉齊/大齊皇帝/天會|1130/2/10~|8/=:金|君主名=劉豫|時期=兩宋|表字=彥游|生=1073年|卒=1146年10月18日',
		'/阜昌|1130/12/25~1138/1/12|:金|注=1137年，金朝廢劉豫為蜀王並且廢除齊國，將劉豫一家遷至臨潢府，1142年改封曹王，1146年10月18日（九月戊寅）過世。|注=黄会奇《刘豫改元“阜昌”年代考》和许正弘《刘豫阜昌改元始年小考》辯證史籍記載，援引石刻資料，證明阜昌元年為庚戌年，並以《偽齊錄校補》卷上《偽豫傳》收錄的《建元阜昌詔》證明，具體改元時間為庚戌年十一月二十三日。',

		// 契丹族
		'遼/太祖/|907/2/15~|3o5 58y 55bc5e9 4b5 3bj93u2 3ot 37wy42s|諡=大聖大明神烈天皇帝|君主=耶律阿保機|君主名=耶律億;劉億;安巴堅|表字=阿保機|國號=大遼;大契丹國|時期=大遼|生=872年|卒=926年9月6日|在位=916年3月17日~926年9月6日 实际统治：907年2月27日~926年9月6日|注=遼史/卷1:元年春正月庚寅，命有司設壇于如迂王集會堝，<三>燔柴告天，即皇帝位。',
		'/神冊|916/12/28~|12=35t 4nyy59g 5gi 3txi4b8 35s|注=遼史/卷1:神冊元年春二月丙戌朔，上在龍化州，迭烈部夷離耶律曷魯等率百僚請上尊號，三表乃允。丙申，群臣及諸屬國築壇州東，上尊號曰大聖大明天皇帝，後曰應天大明地皇后。大赦，建元神冊。',
		'/天贊|922/3/2~|2=48a 3mw44z1 3prw35s',
		'/天顯|926/3/17~|2=47d 59g',
		'/太宗/=|927/11/27~|2/11/=35s 4uq05go 5as 4gnp3fu 505 3psh47d 4pbv3tf 3hk|諡=孝武惠文皇帝|君主名=耶律德光|表字=德謹|生=902年11月25日 (根据《辽史》记载，辽太宗耶律德光生于唐昭宗天复二年，辽太宗耶律德光登基称帝后的生日“天授节”是十月二十三日，天复二年十月二十三日（乙未日），用万年历换算为公历则是902年11月25日)|卒=947年5月15日|在位=大契丹国皇帝：927年12月11日~947年 2月24日 大辽皇帝：947年2月24日~947年5月15日|注=天顯元年七月阿保機逝世，皇后攝政。至遼天顯二年十一月遼太宗即位沿用。',
		'/會同|938/11/25~|11=35t 3b1j3px 3my 4mg3591 3sd84gy 5ea 35s',
		'/大同|947/2/24~|2=3t3b',
		'/世宗/天祿|947/10/17~|9=35w 4aa 445 3mmt42o|諡=孝和莊憲皇帝|君主名=耶律阮|生=919年1月29日 (根据《辽史》记载，辽世宗耶律阮生于辽太祖神册三年十二月二十五日（甲子日），用万年历换算为公历则是919年1月29日 )|卒=951年10月7日|在位=947年5月16日~951年10月7日|注=耶律倍的長子耶律阮',
		'/穆宗/應曆|951/10/4~|9=362 59h 3z2p4h0 4t555es 4ac 3qyv506 46i 54835s9 3z8c4fc 5ew 4ihk3p0 57a 4qo|諡=孝安敬正皇帝|君主名=耶律璟|生=931年9月19日 (根据《辽史》记载，辽穆宗耶律璟生于辽太宗天显六年八月初五（庚申日），用万年历换算为公历则是931年9月19日)|卒=969年3月12日|在位=951年10月11日~969年3月12日',
		'/景宗/保寧|969/2/19~|2=31at58y 5sh 400i4i9 3ep648a 3p1 37x342t 58w|諡=孝成康靖皇帝|君主名=耶律賢|表字=賢寧|生=948年9月1日 (根据《辽史》记载，辽景宗耶律贤生于辽世宗天禄二年七月二十五日（壬申日），用万年历换算为公历则是948年9月1日 )|卒=982年10月13日|在位=969年3月13日~982年10月13日',
		'/乾亨|979/11/23~|11=35u 55c35uq 40984g0',
		// http://bbs.nongli.net/dispbbs_2_47386_3_4.html
		// 西元994年，即統和十二年開始使用賈俊的大明曆，在萬年曆中也是西元994年，即統和十二年開始反應
		'/聖宗/統和|983/7/13~|6=384 48a 3mw8505 46i 4oet5dw 5us 40aq5as 4gnu3my 505 3ql347d 5e1 3swk4a1 3b573px 3oq 4mg9591 4gi 4so55ea 4aa 3b4y449 39ze|諡=文武大孝宣皇帝|君主名=耶律隆緒|生=972年1月16日 (根据《辽史》记载，辽圣宗耶律隆绪生于辽景宗保宁三年农历十二月二十七日（己丑日），用万年历换算为公历则是972年1月16日。)|卒=1031年6月25日|在位=982年10月14日~1031年6月25日|注=談古籍整理中過度依賴傳統歷譜的問題: 《遼史·聖宗紀》稱統和三年閏九月壬申朔',
		'/開泰|1012/12/16~|11=35t 46i 5np 3z2v4h0 5es 3t504ac 3nt8504',
		'/太平|1021/12/7~|11=35u 4yy 54895s9 4h4 4t913u0 52s 4g9f3me 4xs',
		'/興宗/景福|1031/6/23~|6=2uze58w|諡=神聖孝章皇帝|君主名=耶律宗真|生=1016年4月3日 (根据《辽史》记载，辽兴宗耶律宗真生于辽圣宗开泰五年农历二月二十三日（戊戌日），用万年历换算为公历则是1016年4月3日。 )|卒=1055年8月28日|在位=1031年6月25日~1055年8月28日',
		'/重熙|1032/12/6~|11=35u 5u9 400m4i9 3u1 3a903p1 37x842u 58y 56x55uq 4ia 3epx48a 439 3mmp46i 4oez5dw 5us 40av5as 50g',
		'/道宗/清寧|1055/8/25~|8=362 4fc3505 3ql847e 5e1 3swo4a1 3q1 3252|諡=仁聖大孝文皇帝|君主名=耶律洪基|表字=納琳|生=1032年9月14日 (根据《辽史》记载，辽道宗耶律洪基生于辽兴宗景福二年农历八月初七日（丙午日），用万年历换算为公历则是1032年9月14日。 )|卒=1101年2月12日|在位=1055年8月28日~1101年2月12日|注=[[宋史/卷340]], 續資治通鑒長編卷二百八十四: 熙寧十年 八月 蘇頌為遼主生辰國信使...使北者冬至日與北人交相慶。是歲，本朝歷先契丹一日，契丹固執其歷為是',
		'/咸雍|1065/2/8~|3oq 579 3qkz4gi 4sob5ea 4aa 3b5344a 42z',
		'/大康|1075/1/19~|39gk5np 3z304h0 5es 3t6w52s 47u 3mna4zu',
		'/大安|1085/1/29~|5r9 3z4i4i0 4t983u0 52s 4g9k3mi 56y 5544',
		'/壽昌|1095/2/8~|5sh 4i9 3eoi3u1 3a953p1 35s|年號=壽隆;盛昌|注=《遼史·曆象志》溯源: 陳大任修《遼史》時可能避“昌”字諱，改“壽昌”爲“壽隆”|注=邱靖嘉 遼道宗“壽隆”年號探源——金代避諱之新證: 改元後初名「壽隆元年」；第二年更名為「壽昌」，是為「壽昌二年」，後同。內蒙古及東三省原遼國境內出土了「壽隆元寶」，還有「壽隆通寶」',
		'/天祚帝/乾統|1101/3/2~|2=3oa 4mee58y 5ua 3twj4ic 3rd648a 439 3mmw|君主名=耶律延禧|表字=延寧|生=1075年6月5日 (根据《辽史》记载，辽天祚帝耶律延禧生于辽道宗大康元年农历闰四月十九日（庚戌日），用万年历换算为公历则是1075年6月5日。 )|卒=6月1128年/1156年 (存爭議) (1128年（或1156年）)|在位=1101年2月12日~1125年3月26日|注=談古籍整理中過度依賴傳統歷譜的問題: 遼乾統五年閏二月己巳朔',
		'/天慶|1111/2/10~|46i 59g 57b85uw 5as 3rcx50q 4g4p579 47e',
		'/保大|1121/1/21~1125/4/5|4sdh5e1 4a0 4poz35s|注=保大五年二月二十日天祚帝在應州被為金人完顏婁室等所俘',

		// 渤海國的後繼政權
		'東丹/人皇王/甘露|926/2/15~|:遼|時期=大遼|君主名=耶律倍;耶律圖欲;李贊華|廟號=義宗|諡=文武元皇王;讓國皇帝;文獻皇帝;文獻欽義皇帝|國號=東遼|據=Wikipedia;遼陽 金毓黻《渤海國志長編》卷五 年表第一 渤海國志三|生=c. 899, 900|卒=後晉高祖天福元年閏月丁丑|在位=926年~930年|注=天贊五年正月丁丑，阿保機攻入忽汗城，渤海國亡。二月丙午，阿保機將渤海國改名為東丹國，意為「東契丹國」。 遼太宗天顯五年，耶律阿保機的長子耶律倍因受德光猜忌，逃奔後唐，東丹國名存實亡，後繼者為其長子耶律阮。',
		'/端順皇后/=|930/11/23~|5/11/=:遼|君主=王妃蕭氏|君主性別=女|卒=會同三年七月戊寅|注=東丹王國攝政',
		'=/=|937/1/7~|:遼',
		'/耶律阮|940/8/20~|:遼|君主=遼世宗;永康王|君主名=耶律阮|注=遼史卷五本紀第五世宗: 大同元年春二月，封永康王。 金毓黻《渤海國志長編》 兀欲繼主國政兀欲名阮',
		'/明王|947/11/1~953/1/17|:遼|卒=遼穆宗應曆二年十二月辛亥|君主名=耶律安端|注=遼史卷五本紀第五世宗: 大同元年九月壬子朔，葬嗣聖皇帝於懷陵。丁卯，行柴冊禮，羣臣上尊號曰天授皇帝。大赦，改大同元年為天祿元年。追諡皇考曰讓國皇帝。以安端主東丹國，封明王|注=渤海國志長編: 東丹五十七年冬十二月庚辰遼罷東京中臺省東丹國除(遼景宗乾亨四年十二月庚辰)',

		'定安/烈萬華|938/2/2~|:遼|時期=大遼|注=936年，烈氏一族的烈萬華從南海府遷居西京鴨綠府。938年，烈萬華在西京鴨綠府附近（今吉林省磐石市）建立定安國。《渤海國記》定安國王大氏、烏氏迭見其理不可曉。渤海亡，始建國，下訖淳化二年，凡六十四年。',
		'/烏玄明/元興|976/2/3~992/2/5|:遼|注=宋史避諱宋聖祖趙玄朗，又稱烏元明。 宋史卷四百九十一: 元興六年十月日，定安國王臣玄明表上聖皇帝前。',

		// 興遼國
		'興遼/大延琳/天慶|1029/9/11~1030/9/29|:遼|時期=大遼|注=渤海國王族，高王大祚榮的七世孫',

		// 大渤海國, 大元國
		'大渤海/高永昌/隆基|1116/1/17~1117/2/3|:遼|時期=大遼',

		'北遼/宣宗/建福|1122/4/25~|:中國|疑|君主名=耶律淳|諡=天錫皇帝;孝章皇帝|據=Wikipedia|時期=大遼|生=1062年|卒=1122年|在位=1122年三月十七至六月廿四',
		'/蕭德妃/德興|1122/7/29~|:中國|疑|君主名=蕭普賢女|諡=蕭德妃|君主性別=女|據=Wikipedia|卒=1123年|在位=1122年六月廿四-1123年二月初二',
		'/梁王/神歷|1123/7/24~|:中國|疑|君主名=耶律雅里|諡=順文皇帝|據=Wikipedia|生=1094年|卒=1123年|在位=1123年五月廿九（癸卯）至十月',
		'/英宗/=|1123/10/21~12/19|:中國|疑|君主名=耶律朮烈|諡=顯武皇帝|據=Wikipedia|卒=1123年|在位=1123年十月至十一月',

		'西遼/德宗/延慶|1124/2/17~|2=:中國|疑|君主名=耶律大石|據=Wikipedia|時期=大遼|生=1087年|卒=1143年|在位=1132年~1143年|注=元代史籍《遼史》以1124年為改元延慶之年，計10年。近代學者如紀安宗、李錫厚、柴平等皆認為在1131年或1132年之間改元延慶，計3年。',
		'/康國|1134/1/27~|:中國|疑',
		'/感天皇后/咸清|1144/2/6~|:中國|疑|君主名=蕭塔不煙|君主性別=女|在位=1143年~1150年|注=耶律大石之妻，臨朝稱制。|注=李崇智,中國歷史年號考.認為是1136年十一月－1142年十一月。',
		'/仁宗/紹興|1151/1/20~|:中國|疑|君主名=耶律夷列|卒=1163年|在位=1150年~1163年|注=耶律大石之子|注=李崇智,中國歷史年號考.認為是1142年-1154年。',
		'/承天太后/崇福|1164/1/26~|:中國|疑|君主名=耶律普速完|卒=1177年|君主性別=女|注=耶律夷列之妹，臨朝稱制，被蕭斡里剌射殺|注=李崇智,中國歷史年號考.認為是1154年十二月-1168年十一月',
		'/末主/天禧|1178/1/21~|:中國|疑|君主名=耶律直魯古|生=12世紀|卒=1213年|注=耶律夷列次子，屈出律篡位|注=李崇智,中國歷史年號考.認為是1168年-1201年。',
		'/屈出律/=|1212/2/5~1219/1/17|:中國|疑|注=乃蠻塔陽汗之子，耶律直魯古的女婿，1218年西遼滅於蒙古帝國',
		// TODO: 克爾曼王朝（Kirmanid dynasty），
		// 又稱起兒漫王朝，是西遼政權失敗後其貴族在伊朗東南部克爾曼地區建立的一個政權，共延續八十餘年（1224年－1303年或1306年）。中國學者王治來稱後西遼。

		'西夏/景宗/顯道|1032/2/14~|:中國|疑|君主=武烈帝|君主名=李元昊;拓跋曩霄;拓拔曩霄|據=時間規範資料庫|國號=大夏|生=1003年6月7日|卒=1048年1月19日|在位=1038年11月10日~1048年1月19日 实际统治：1032年~1048年1月19日',
		'/開運|1034/8/17~|7=:中國|疑',
		'/廣運|1034/9/16~|8=:中國|疑',
		'/大慶|1036/12/21~|12=:中國|疑',
		'/天授禮法延祚|1038/11/29~|11=:中國|疑|年號=天授;天授理法延祚',
		'/毅宗/延嗣甯國|1049/2/5~|:中國|疑|君主=昭英帝|君主名=李諒祚;小字寧令哥|生=1047年3月5日|卒=1068年1月|在位=1048年~1068年1月',
		'/天佑垂聖|1050/1/26~|:中國|疑',
		'/福聖承道|1053/1/23~|:中國|疑',
		'/奲都|1057/2/7~|:中國|疑',
		'/拱化|1063/2/1~|:中國|疑',
		'/惠宗/乾道|1068/2/6~|:中國|疑|君主=康靖帝|君主名=李秉常|生=1061年|卒=1086年8月21日|在位=1068年1月~1086年8月21日',
		'/天賜禮盛國慶|1069/1/26~|:中國|疑|年號=天賜國慶',
		'/大安|1075/1/20~|:中國|疑',
		'/天安禮定|1086/1/18~|:中國|疑',
		'/崇宗/天儀治平|1086/9/11~|8=:中國|疑|君主=聖文帝|君主名=李乾順|生=1083年|卒=1139年7月1日|在位=1086年8月~1139年7月1日',
		'/天佑民安|1090/2/3~|:中國|疑',
		'/永安|1098/2/4~|:中國|疑',
		'/貞觀|1101/1/31~|:中國|疑',
		'/雍寧|1114/2/8~|:中國|疑',
		'/元德|1119/2/12~|:中國|疑',
		'/正德|1127/5/13~|4=:中國|疑',
		'/大德|1135/1/16~|:中國|疑',
		'/仁宗/大慶|1140/1/22~|:中國|疑|君主=聖德帝|君主名=李仁孝|生=1124年|卒=1193年10月16日|在位=1139年7月~1193年10月16日',
		'/人慶|1144/2/6~|:中國|疑',
		'/天盛|1149/2/10~|:中國|疑',
		'/乾佑|1170/1/19~|:中國|疑',
		'/桓宗/天慶|1194/1/24~|:中國|疑|君主=昭簡帝|君主名=李純佑;李純祐',
		'/襄宗/應天|1206/3/11~|2=:中國|疑|君主=敬穆帝|君主名=李安全|生=1170年|卒=1211年9月13日|在位=1206年3月1日~1211年8月12日',
		'/皇建|1210/1/27~|:中國|疑',
		'/神宗/光定|1211/9/9~|8=:中國|疑|君主=英文帝|君主名=李遵頊|生=1163年|卒=1226年|在位=1211年8月12日~1223年',
		'/獻宗/乾定|1223/12/24~|12=:中國|疑|君主名=李德旺|生=1181年|卒=1226年|在位=1223年~1226年',
		'/末帝/寶義|1226/7/26~1227/8/13|7=:中國|疑|君主名=李睍;李𪾢;李晛|君主=末主|卒=1227年8月28日|在位=1226年~1227年8月28日',

		'金/太祖/收國|1115/1/28~|5as 3rcx|君主=應乾興運昭德定功睿神莊孝仁明大聖武元皇帝|君主名=完顏旻;完顏阿骨打|生=1068年8月1日|卒=1123年9月19日|在位=1115年1月28日~1123年9月19日',
		'/天輔|1117/2/4~|50q 4g4p579 47e 4sh15e1 49s',
		'/太宗/天會|1123/9/22~|9=360 4poz3q1 32573oq 579 3ql44gi 5e9 3t444aa 3q1|君主=體元應運世德昭功哲惠仁聖文烈皇帝|君主名=完顏晟;完顏吳乞買|生=1075年11月25日 (根据《金史》记载，金太宗完颜晟生于辽道宗大康元年，而金太宗完颜晟登基称帝后，他的生日“天清节”是每年的农历十月十五日，大康元年农历十月十五日，用万年历换算为公历则是1075年11月25日。 )|卒=1135年2月9日|在位=1123年9月27日~1135年2月9日',
		'/熙宗/=|1135/1/16~|38gy42z 39gq|君主=宏基纘武莊靖孝成皇帝|君主名=完顏亶;完顏合刺|生=1119年8月14日|卒=1150年1月9日|在位=1135年2月10日~1150年1月9日',
		'/天眷|1138/2/12~|5r9 4gy 4sp2',
		'/皇統|1141/2/9~|5es 4ac 3nt050a 3mnf4zv 3s9 3z4o4i0',
		'/海陵王/天德|1150/1/1~|12=35s 5ew 4ih052s 4qo|君主=廢帝;海陵王|諡=海陵煬王;海陵庶人|君主名=完顏亮|表字=元功|生=1122年2月24日|卒=1161年12月15日|在位=1150年1月9日~1161年12月15日',
		'/貞元|1153/3/27~|3=31p83mi 56z 35s',
		'/正隆|1156/2/23~|2=3qju5u9 4i9 3eom3u1 3p1',
		'/世宗/大定|1161/10/28~|10=3p1 380i3oa 4o1759g 5uq 40874ic 48a 3a91439 42y 4o0x5d0 57d55uw 5as 3reu50q 505 3psj47e 4sh75e1 4a0 4pp33q1 3fw 4g4l|君主=光天興運文德武功聖明仁孝皇帝|君主名=完顏雍|生=1123年3月29日|卒=1189年1月20日|在位=1161年10月27日~1189年1月20日|注=金史/卷6:十月辛丑...丙午，慶雲見，官屬諸軍勸進，固讓良久，於是親告天太祖廟，還禦宣政殿，即皇帝位。...丁未大赦，改元大定。',
		'/章宗/明昌|1190/2/7~|579 4ei 4sgy5e9 3t4a4aa 3q0|君主=憲天光運仁文義武神聖英孝皇帝|君主名=完顏璟|生=1168年8月31日（农历七月二十七）|卒=1208年12月29日|在位=1189年1月20日~1208年12月29日',
		'/承安|1196/11/22~|11=35t 3a1y42z 3o5 4nyq',
		'/泰和|1201/2/5~|4gy 4t3g5es 4ac 3qyw50a 46l 3mhw',
		'/衛紹王/大安|1209/2/7~|5s9 4h0 4t4y|君主=衞紹王|君主名=完顏永濟|卒=1213年9月11日|在位=1208年12月29日~1213年9月11日',
		'/崇慶|1212/2/5~|5ew 4xs|注=1212年正月初一（己酉朔日，陽歷2月5日），改元崇慶，赦。崇慶二年五月，改元至寧。',
		'/至寧|1213/5/22~|5=3ao',
		'/宣宗/貞祐|1213/9/16~|9=2t8p59w 50a 4f53574|君主=繼天興統述道勤仁英武聖孝皇帝|君主名=完顏珣|生=1163年4月18日|卒=1224年1月14日|在位=1213年9月22日~1224年1月14日',
		'/興定|1217/10/2~|9=35v 47d 400j4i9 3eos3ts',
		'/元光|1222/9/7~|8=361 3p1',
		'/哀宗/正大|1224/1/22~|380o42y 591 3qrp5uq 4i9 3epu48a 3a95|君主名=完顏守緒|生=1198年9月25日|卒=1234年2月9日|在位=1224年1月15日~1234年2月9日',
		'/開興|1232/2/11~|/1/19=3a95|注=金史卷一十七：天興元年，是年本正大九年，正月庚子改元開興，四月甲子改元天興。',
		'/天興|1232/5/5~1234/3/1|/4/14=3a95445 35s|注=金哀宗天興三年正月己酉，金哀宗不欲做亡國之君，將帝位傳予金末帝完顏承麟。哀宗自縊於蔡州幽蘭軒。完顏承麟收到哀宗死訊，哭奠未畢，城潰，諸禁近舉火焚之。奉御絳山收哀宗骨瘞之汝水上。末帝為亂兵所害，金亡。李兆洛《紀元編》以「盛昌」作末帝年號，但沒有史料證據',

		// 元朝、大蒙古國與北元皇室的氏為「孛兒只斤」，史書上一般只單獨稱名，較少姓名共用。
		'大蒙古國/太祖|1206/2/10~|50a 42z 3mic47d 4h0 4t4y5ew 4ih559w 50a 4f53577 47d 400j4i9 3eos3u1 3p1 380o42y 591 3qrp|君主名=鐵木真|諡=太祖法天啟運聖武皇帝;聖武皇帝|廟號=太祖|君主=成吉思汗|蒙語尊號=成吉思汗|國號=大蒙古國;蒙古帝國|朝代=元|時期=大元|生=1162年 (金世宗大定 (金))|卒=元太祖二十二年丁亥豬年七月十二日（六十六歲） 1227年8月25日|在位=1206年春天 (拉施特《史集》第一卷第二分册，《第二编 成吉思汗纪四（从鼠年初至马年末，1204~1210年）》记载：“当始自伊斯兰教历602年7月的巴儿思亦勒即虎年[1206年]幸福地莅临时，初春，成吉思汗下令建九脚白旄纛，隆重地召集举行了大忽里勒台。”在这次忽里勒台上他获得了“成吉思汗”的尊号。”（拉施特《史集》中译本，余大钧 周建奇 译，第208页；北京：商务印书馆，1983年9月第1版）)~1227年8月25日',
		// 拖雷（監國）
		'/拖雷|1228/2/8~|5uq|君主=睿宗;睿宗仁聖景襄皇帝|君主名=拖雷|生=1192年 (白寿彝《中国通史》认为拖雷生于1192年。理由如下：拖雷生年史料缺载，唯《元朝秘史》第214 节有一段记事，谓成吉思汗攻杀塔塔儿人时，有一塔塔儿人逃脱，窜入成吉思汗后营行帐中觅食，乘机劫持了五岁的拖雷，幸被部属救出。这次战争当是指金承安元年（1196）的斡里札河之役，则拖雷应生1192 年，此与《睿宗传》所载“寿四十有□（此字缺）”合（按：拖雷死于1232 年），缺字当为“一”。)|卒=1232年',
		'/太宗|1229/1/27~|4i9 3epu48a 3a95445 42y 4o135d1 49w 4pl05b8 3rf050s|君主=太宗英文皇帝|君主名=窩闊台|生=1186年 (金世宗大定 (金))|卒=元太宗十三年辛丑牛年十一月八日（五十六歲） 1241年12月11日|在位=1229年9月13日~1241年12月11日',
		// 乃馬真后（稱制）姓乃馬真氏 |君主性別=女
		'/昭慈皇后|1242/2/2~|505 3pso47e 5e1|君主=乃馬真后|君主名=脫列哥那;朵列格捏|生=12世紀？|卒=蒙古定宗元年|君主性別=女',
		'/定宗|1246/1/19~|3swk4a0 5aw|君主=定宗簡平皇帝|君主名=貴由|生=元太祖元年丙寅虎年 1206年|卒=元定宗三年戊申猴年三月 （四十三歲） 1248年4月|在位=1246年8月24日~1248年4月',
		// 海迷失后（稱制）
		'/欽淑皇后|1249/1/16~|4gpe3os|君主=海迷失后|君主名=海迷失|卒=1252年|君主性別=女',
		'/憲宗|1251/1/24~|4mgq3o5 576 4sh25e9 4b5 3b503qi 3a233y8|君主=憲宗桓肅皇帝|君主名=蒙哥|生=元太祖三年戊辰龍年十二月三日 1209年1月10日|卒=元憲宗九年己未羊年七月二十一日（五十二歲） (古人的寿命计算方式和西方的计算方式不同，《元史》卷三《宪宗本纪》记载：“岁戊辰，十二月三日生帝。”元宪宗九年七月，“癸亥，帝崩于钓鱼山，寿五十有二，在位九年。”元宪宗蒙哥生于元太祖三年戊辰龍年十二月三日（公历1209年1月10日），去世于元宪宗九年己未羊年七月二十一日（公历1259年8月11日），按照公历计算，蒙哥享年50岁零7个月，按照农历计算，元太祖三年是公历1208年，蒙哥生于1208年农历十二月，去世于1259年农历七月，则是享年五十二岁。) 1259年8月11日|在位=1251年7月1日~1259年8月11日',
		'元/世祖/中統|1260/6/11~|5=3al 42d 4nyx4gy 5eo|君主=聖德神功文武皇帝|君主名=忽必烈;奇渥溫忽必烈|國號=大元大蒙古國|時期=大元|生=元太祖十年乙亥豬年八月二十八日 1215年9月23日|卒=1294年2月18日 (元世祖至元 (元世祖))|在位=大蒙古国皇帝：1260年5月5日~1271年 12月18日 大元皇帝：1271年12月18日~1294年 2月18日',
		'/至元|1264/8/23~|8=35u 3t514ac 47u 3mox431 3mij47d 4h0 4upy5ew 52s 4g8z50a 4fxn577 47d 55bc5ep 4aa 3b5x44a 431 37wy42t 3z2y4h0 5es 3t6u4ac 47u|注=1271年忽必烈於大都公布《建國號詔》，建國號曰大元，蓋取《易經》乾元之義',
		'/成宗/元貞|1295/1/17~|3mp04yz 35s|君主=欽明廣孝皇帝|君主名=鐵穆耳|生=1265年10月15日 (元世祖至元 (元世祖))|卒=元成宗大德十一年丁未羊年正月初八日（四十三歲） 1307年2月10日|在位=1294年5月10日~1307年2月10日',
		// 大"徳": see [[中山世譜/卷03]]
		'/大德|1297/2/23~|2=3prw47d 4i0 4t3c5ew 52s 4g9h3mi 579 3qk149d|紀年=大徳',
		'/武宗/至大|1308/1/24~|408b4i9 3u1 3a93|君主=仁惠宣孝皇帝|君主名=海山|生=至元十八年辛巳蛇年七月十九日 1281年8月4日|卒=至大四年辛亥豬年正月初八日 1311年1月27日|在位=1307年6月21日~1311年1月27日',
		'/仁宗/皇慶|1312/2/8~|3p1 3oq|君主=聖文欽孝皇帝|君主名=愛育黎拔力八達|生=1285年4月9日|卒=元仁宗延祐七年庚申猴年正月二十一日 1320年3月1日|在位=1311年4月7日~1320年3月1日',
		'/延祐|1314/1/17~|4mg3591 49e 40814ic 3sy048a',
		'/英宗/至治|1321/1/29~|445 3mmt46i|君主=睿聖文孝皇帝|君主名=碩德八剌|生=元成宗大德七年癸卯兔年二月初六日 1303年2月22日|卒=元英宗至治三年癸亥豬年八月初四日（二十一歲） 1323年9月4日|在位=1320年4月19日~1323年9月4日',
		'/泰定帝/泰定|1324/1/27~|5d1 3sr54a0 4pl54qo|君主名=也孫鐵木耳|生=1293年11月28日 (至元 (元世祖))|卒=致和元年戊辰龍年七月十日（三十六歲） 1328年8月15日|在位=1323年10月4日~1328年8月15日',
		'/致和|1328/3/12~|2=3ps',
		'/天順帝/天順|1328/10/4~11/1|9=360|君主名=阿速吉八|生=元仁宗延祐七年庚申猴年 1320年|卒=1328年11月14日? (元天顺帝天顺 (元))|在位=1328年10月~1328年11月14日',
		'/文宗/天曆|1328/10/4~|9=360|君主=神明元孝皇帝|君主名=圖帖睦爾|生=大德八年甲辰龍年正月十一日 1304年2月16日|卒=至顺三年壬申猴年八月十二日（二十九歲） 1332年9月2日|在位=1328年10月16日~1329年4月3日（第一次） 1329年9月8日~1332年9月2日（第二次）',
		'/明宗/=|1329/1/31~|2/=50g|君主=順天立道睿文智武大聖孝皇帝|君主名=和世㻋;和世[王朿]|生=元成宗大德四年庚子鼠年十一月十一日 1300年12月22日|卒=元明宗天历二年己巳蛇年八月初六日（三十歲） 1329年8月30日|在位=1329年2月27日~1329年8月30日',
		// 天曆（元年：1328年九月 - 末年：1330年五月）是元朝時元文宗圖帖睦爾的年號，該年號在元明宗(1329年)時被重複使用，共計3年。
		'/文宗/=|1329/8/25~|2/8/=364 4xs|君主=神明元孝皇帝|君主名=圖帖睦爾|生=大德八年甲辰龍年正月十一日 1304年2月16日|卒=至顺三年壬申猴年八月十二日（二十九歲） 1332年9月2日|在位=1328年10月16日~1329年4月3日（第一次） 1329年9月8日~1332年9月2日（第二次）',
		'/至順|1330/5/18~|5=2v9j505 47c',
		'/寧宗/=|1332/10/20~|3/10/=35u 4scj|君主名=懿璘質班|生=元泰定帝泰定三年丙寅虎年三月二十九日 1326年5月1日|卒=元宁宗至顺三年壬申猴年十一月二十六日（七歲） 1332年12月14日|在位=1332年10月23日~1332年12月14日',
		'/順帝/元統|1333/11/8~|10=35u 5e1 49k|廟號=惠宗|君主名=妥懽帖睦爾;妥懽貼睦爾;妥懽帖木耳;妥懽帖木爾|生=元仁宗延祐七年庚申猴年四月十七日 1320年5月25日|卒=元惠宗至正三十年庚戌狗年四月二十八日 （五十一歲） 1370年5月23日|在位=1333年7月19日~1370年5月23日',
		'/至元|1335/11/16~|11=2t5o4b5 3qh 32543p1 3md',
		'/至正|1341/1/18~|4m6t58y 5e9 3twi4b6 3bka47u 431 39h346d 59e 4t375gk 4b8 3bk147u 3mp54zx 46h 4oet4i0 5go 3tz75as 4g9m3my 579 3qk749d 5ap|注=元惠宗至正二十八年八月初二日（1368年9月14日），明軍從大都的齊化門攻城而入，元朝對中國的統治結束，回到本土蒙古草原。',
		// 自元昭宗以後，所有北元君主皆不自稱皇帝，只自稱可汗。漢文的廟號與諡號也不再有。
		// 宣光果明哲
		'北元/昭宗/宣光|1371/1/17~|3g9f4a1 3b1n3px 3oq 4mg9591 49e|君主名=愛猷識理達臘|時期=大元',
		// 於1378年5月即位，1379年農曆六月改年號為天元。
		// 益王走至也速迭兒遇害、五傳坤迭木兒、咸未幾而弒不復知帝號矣。
		'/益王/天元|1379/1/19~1389/1/27|4pid5as 48i 3b1e445 3mmy46i 5d1 3sra4a0|君主=脫古思帖木兒;北元後主;天元帝',

		// 明朝統治地區其他勢力年號
		'瓦剌/馬哈木|1409/1/16~|:中國|準=年|君主名=馬哈木|君主=順寧王|政權=斡亦剌惕;衛拉特;漠西蒙古;厄魯特|注=元朝稱斡亦剌惕、明朝稱瓦剌（Wǎlà/Wǎlā）、清朝稱衛拉特、漠西蒙古等，厄魯特本是衛拉特一部，但在清朝文獻中也用來泛指衛拉特。|注=1412年，明成祖第一次親征蒙古，大敗本雅失里、阿魯台，本雅失里西奔。1412年，馬哈木殺死大汗本雅失里，瓦剌向明朝稱臣，大汗空位。',
		'/脫懽|1416/1/30~|:中國|準=年|君主名=脫懽;脫歡;托歡|君主=順寧王',
		'/也先/添元|1453/2/9~1458/1/14|:中國|準=年|君主名=也先太師;額森|君主=大元田盛大可汗|注=該年號見於《明英宗實錄》和《明史》。學者推測該年號可能是來自音譯，為求迴避而故將天元譯作添元。',

		// TODO: 元朝統治地區其他勢力年號
		// 察合台汗國/兀魯忽乃|在位=1251年-1260年|君主性別=女
		// 哈密國攝政 弩溫答失里|在位=1460年-1467年|君主性別=女

		// 一世一元制: 明朝與清朝的每個君主，一般都只有一個年號
		'明/太祖/洪武|1368/1/20~|3qk749d 5ap 3g9f4a1 3b1n3px 3oq 4mg9591 49e 4pid5as 48i 3b1e445 3mmy46i 5d1 3sra4a0 5b8 3rlw52k 4g5o579 47e 550p5s9 4aw 4q39|君主=開天行道肇紀立極大聖至神仁文義武俊德成功高皇帝|君主名=朱元璋|表字=國瑞|時期=大明|生=1328年11月19日 (元文宗天曆元年九月十八日 1328年10月21日)|卒=明太祖洪武三十一年闰五月十日  1398年6月24日|在位=1368年1月23日~1398年6月24日',
		'/惠帝/建文|1399/2/6~|3qh 3hw 4g5v3md|君主名=朱允炆|君主=太宗;惠宗|諡=嗣天章道誠懿淵功觀文揚武克仁篤孝讓皇帝|生=1377年12月5日|卒=未知|在位=1398年6月30日~1402年7月13日',
		'/成祖/洪武|1402/7/17~|35/6/17=3md|君主=啟天宏道高明肇運聖武神功純仁至孝文皇帝|君主名=朱棣|生=元朝至正二十年四月十七日 1360年5月2日|卒=明朝永乐二十二年七月十八日 1424年8月12日|在位=1402年7月17日~1424年8月12日（在位22年）|注=明成祖登極後不承認建文年號，七月初一（一說六月十八日），將建文元、二、三、四年改為洪武三十二至三十五年，次年改元永樂元年。',
		'/永樂|1403/1/23~|4m6z58y 5sh 3twn4b6 3qi 3a90431 3m5846d 59e 57bd5gk 4b8 3rd148a 431 3mmp47d 4of05e0 5go',
		'/仁宗/洪熙|1425/1/20~|4pl3|君主=敬天體道純誠至德宏文欽武章聖達孝昭皇帝|君主名=朱高熾|生=1378年8月16日|卒=1425年5月29日|在位=1424年9月7日~1425年5月29日',
		// 大"徳": see [[中山世譜/卷04]]
		'/宣宗/宣德|1426/2/8~|5as 50q 4fc4579 3ql849d 5e9 3swo4a1 3px|君主=憲天崇道英明神聖欽文昭武寬仁純孝章皇帝|君主名=朱瞻基|生=1399年3月16日|卒=1435年1月31日|在位=1425年6月27日~1435年1月31日|紀年=宣徳',
		'/英宗/正統|1436/1/18~|323a3oq 591 3qs24gy 4sob5es 4aa 3b53445 42y 4o105r9 4h0|君主=法天立道仁明誠敬昭文憲武至德廣孝睿皇帝|君主名=朱祁鎮|生=宣德二年丁未十一月十一日|卒=1464年2月23日|在位=1435年2月7日~1449年9月1日, 1457年2月11日~1464年2月23日 奪門之變/南宮復辟',
		'/景帝/景泰|1450/1/14~1457/2/14|4sqp5es 3t6x52s 506 3psm4zu 5s9|君主=景泰帝|諡=恭仁康定景皇帝;符天建道恭仁康定隆文布武顯德崇孝景皇帝|廟號=代宗|君主名=朱祁鈺|生=1428年9月21日|卒=1457年3月14日|在位=1449年9月22日~1457年2月11日',
		'/英宗/天順|1457/1/26~|5s9 3z824i0 4t973u1 3hu 4g5z3md|注=[[明史/卷12]] 英宗後紀: 天順元年春正月...丙戌，詔赦天下，改景泰八年為天順元年。（[[明史/卷12]]用到了"天順元年春正月壬午"。為求實用性，從元年正月一日開始編排。）|注=景泰八年正月十六日夜[[奪門之變]]，黎明時分英宗「南宮復辟」，隨即改元。倉促之中忘記罷黜朱祁鈺，直到同年二月乙未才將朱祁鈺廢為郕王。幾天之內，名義上英宗和景帝兩位皇帝同時並存。',
		'/憲宗/成化|1465/1/27~|576 55435u9 4i9 3eoy3u2 3a95439 42e 4nyu59g 5uq 408y4ic 3rd650q 4vp 3mmw47d 5ac 57d05uw 5as|君主=繼天凝道誠明仁敬崇文肅武宏德聖孝純皇帝|君主名=朱見深;朱濬|生=1447年12月9日|卒=1487年9月9日|在位=1464年2月28日~1487年9月9日',
		'/孝宗/弘治|1488/1/14~|3rcx50q 4g4p579 47e 4sh15e9 4aw 4poz3px 38ez42y 591 3yon4gy 5e9 3t504aa|君主=達天明道純誠中正聖文神武至仁大德敬皇帝|君主名=朱祐樘|生=1470年7月30日|卒=1505年6月8日|在位=1487年9月9日~1505年6月8日（在位18年）',
		'/武宗/正德|1506/1/24~|3q2 39zl42y 4o155r9 4h0 4t515ew 4ac 3nt0506 3pss56y 5s9 3z884i8|君主=承天達道英肅睿哲昭德顯功宏文思孝毅皇帝|君主名=朱厚照|生=1491年10月26日 (1491年9月24日)|卒=1521年4月20日|在位=1505年6月19日~1521年4月20日',
		'/世宗/嘉靖|1522/1/28~|5ew 4ihg3p1 31p83o6 58y 554a5u9 4i9 3ep23u2 3p1 380i42u 4nz059g 5uq 40934ic 48a 3mw54z9 46i 4oep5dw 57d55uw 5as 3rdi3fu 505 3psj47e 4sh75e9 4a0 4ppj3q1 3my 4mg5591 4gi 4so25e9 3t56|君主=欽天履道英毅神聖宣文廣武洪仁大孝肅皇帝|君主名=朱厚熜|生=1507年9月16日|卒=1567年1月23日|在位=1521年5月27日~1567年1月23日',
		'/穆宗/隆慶|1567/2/9~|4aa 3q2 3a0642y 5np 3z2q|君主=契天隆道淵懿寬仁顯文光武純德宏孝莊皇帝|君主名=朱載垕|生=1537年3月4日|卒=1572年5月26日|在位=1566年12月26日~1572年5月26日',
		// 萬"暦": see 中山世譜
		'/神宗/萬曆|1573/2/2~|4h0 4t585ew 4ac 3nt450a 4yz 3pno5s5 4i0 4t8i5ew 4ihl3p1 3fe 4yty58y 5s9 407n4i9 3ep748a 3p1 380o42y 590 56xg49u 4ia 3epu48a 3mw9505 46i 4ofa5dx 49w 4pkz5as 3rdn3fu 505 3pso4ei 5e1 3swk4a8 5a8|君主=範天合道哲肅敦儉光文章武安仁止孝顯皇帝|君主名=朱翊鈞|生=1563年9月4日 嘉靖四十二年八月十七日|卒=1620年8月18日 萬曆四十八年七月丙申日|在位=1572年7月19日~1620年8月18日 （48年 30天）|紀年=萬暦',
		'/光宗/泰昌|1620/8/28~|8=36h|君主=崇天契道英睿恭純憲文景武淵仁懿孝貞皇帝|君主名=朱常洛|生=萬曆十年八月十一日 （1582年8月28日）|卒=泰昌元年九月一日 （1620年9月26日）|在位=1620年8月28日~1620年9月26日（29天）|注=泰昌（1620年八月-十二月）為中國明朝第十四個皇帝明光宗朱常洛的年號，由於明光宗在位僅一個月，故泰昌這個年號僅用了不足一年。實際上，直到九月二十日熹宗下《泰昌元年、<大統歷>敕諭》時，方開始使用。|注=《大明泰昌元年大統歷》考：經過爭論，朝臣最終確定以萬曆四十八年七月三十日之前為萬曆四十八年，八月到十二月為泰昌元年。',
		// 天"啓": see 中山世譜
		'/熹宗/天啟|1621/1/22~|324y3oq 4mga591 4gi 4so65ep|君主=達天闡道敦孝篤友章文襄敬穆莊勤悊皇帝|君主名=朱由校|生=萬曆三十三年十一月十四日 （1605年12月23日）|卒=天啟七年八月十一日 （1627年9月19日）|在位=1620年10月1日~1627年9月30日|紀年=天啓',
		'/思宗/崇禎|1628/2/5~|4aa 3b503q2 3a2342z 42t 3z2w4h0 5es 3t6s4ac 47u 3mox4yz 3pnv5s9 4i0|君主=守道敬儉寬文襄武體仁致孝莊烈愍皇帝|君主名=朱由檢|生=1611年2月6日|卒=1644年4月25日|在位=1627年10月2日~1644年4月25日',
		'/悼帝/義興|1644/5/19~|/4/14=4i0|君主=順宗;獻愍太子|君主名=朱慈烺|生=錢海岳.《南明史·列傳第二》：「悼皇帝慈烺，崇禎二年二月四日生……」|卒=1644年6月|在位=1644年5月19日~1644年6月（非正式）|注=南明弘光年間追封為獻愍太子，魯王監國元年諡為悼皇帝，廟號順宗。',
		//
		'南明/安宗/|1644/6/19~|5=4i0|君主=簡帝;福王;福忠王;弘光帝|君主名=朱由崧|朝代=明|廟號=明安宗;明質宗|諡=奉天遵道寬和靜穆修文布武溫恭仁孝簡皇帝|時期=大明|生=萬曆三十五年七月乙巳|卒=1646年5月23日|在位=崇禎十七年五月壬寅~1645年6月15日|注=續明紀事本末 卷之二: 夏五月庚寅，福王監國於南京。...壬寅，福王即位於南京。',
		'/弘光|1645/1/28~|4t8m|注=續明紀事本末卷七: 宏光帝|注=崇禎十七年五月壬寅朱由崧在南京稱監國，以明年（1645年）為弘光元年。弘光元年五月清軍攻克南京，安宗被俘殺。',
		// http://blog.sina.com.cn/s/blog_4ab9b28b0100hyh4.html
		// 石码史话17：郑成功铸永历通宝钱初探
		// 永曆二年５月（１６４８年，清順治五年），鄭成功始奉永曆為正朔；永曆帝於永曆二年１０月（１６４８年，清順治五年），封成功威遠侯；永曆三年７月（１６４９年，清順治六年），永曆遣使至島，封成功為延平公；永曆十二年春正月（１６５８年，清順治十五年）
		'/紹宗/隆武|1645/7/23~1650/1/31|閏6=4t8m5ew 52s 4fh23mi|君主=唐王;襄帝|君主名=朱聿鍵|表字=長壽|廟號=明紹宗|諡=配天至道弘毅肅穆思文烈武敏仁廣孝襄皇帝|生=1602年5月25日|卒=1646年10月6日|在位=1645年8月18日~1646年10月6日|注=小字"長壽"|注=顧誠 南明史p60: 隆武元年夏閏六月丁亥，紹宗監國福州。（南明史用到了"隆武元年夏閏六月丁亥"。為求實用性，從閏六月開始編排。）|注=南明史p63: 蓋凜社稷於極危，必不可循踰年改元之例。古今相揆，道符不遠。其以弘光元年七月初一日為隆武元年。|注=一說鄭成功使用至隆武五年',
		'/魯王/監國|1646/2/16~1656/1/25|5ew 52s 4fh23mi 4fvv58y 5sh 407s4i9 3u1|君主=魯監國|君主名=朱以海|表字=巨川|年號=魯監國;監國魯;庚寅|生=1618年7月6日|卒=1662年12月23日|在位=1645年8月~1655年|注=據《明史》記載，1645年朱以海在紹興不奉隆武帝正朔，自號魯監國，以明年為監國魯元年。未言建年號。《罪惟錄》載魯王紀年為監國元年，監國二年。李崇智認為「監國」不是年號，並認可李兆洛《紀元編》引《穉山文集》的庚寅為年號的說法。',
		'/文宗/紹武|1646/12/7~1647/1/20|11=5ew|君主名=朱聿𨮁|諡=貞天應道昭崇德毅寧文宏武達仁閔孝節皇帝|生=1605年|卒=1647年1月20日|在位=1646年12月11日~1647年1月20日',
		'/淮王/東武|1648/1/25~1648/12/13|4fh2|君主名=朱常清|生=1616年|卒=1649年|據=Wikipedia|注=該年號《明史》等史書無記載，見於《續明紀事本末》卷七: 鄭成功永曆二年春正月在南澳島擁立淮王為監國。朱由榔的使節在永曆二年十月到，晉鄭成功威遠侯，鄭成功奉朔改稱永曆，淮王遜位取消監國及年號，同年去世。',
		'/韓王/定武|1646/2/16~1664/1/27|:明|疑|君主=定武帝|君主名=朱本鉝;朱亶塉|生=1616年|卒=1664年|在位=1646年~1664年|注=《南明史》顧誠為代表的一些南明史學家質疑「朱本鉝」的存在，認為是查繼佐《罪惟錄》訛傳|注=野史載1646年，李自成部將郝永忠（又名郝搖旗）為聯明抗清，推立韓王為帝，改年號為「定武」。',
		'/昭宗/|1646/12/7~|11=5ew|君主=桂王;永曆帝;永明王|君主名=朱由榔|生=1623年11月1日|卒=1662年6月1日|在位=1646年~1662年|注=《明史》記載永曆年號起於1646年十一月。《罪惟錄》、《明紀》等則記為1646年上尊號，明年改元。今多從之。|注=崇禎年間封永明王',
		'/永曆|1647/2/5~|52s 4fh23mi 4fvv58y 5sh 407s4i9 3u1 3a913p1 3mi 4mg1591 3scq|注=永曆十六年四月十五日 朱由榔、太子朱慈煊被吳三桂絞殺於滇京五華山篦子坡，其身亡處時人稱為逼死坡，即今天的昆明市五華區的華山西路。|注=王叔武(1979)南明史料朔闰考异——《行在阳秋》札记: 《劫灰錄》卷一《永曆帝紀·永曆二年》 條注指出閏六月初十日甲辰。《艇火錄》、《明季南略》、《鹿樵紀聞》諸書均作閏六月，蓋當時所頒日曆如此。《行在陽秋》、《南疆逸史》、《行朝錄》、《甲行日注》、《小腆紀年附考》諸書以大統術所推之閏三月，俱不合。|注=王叔武(1979)南明史料朔闰考异——《行在阳秋》札记: 《延平王戶官楊英從征實錄》（亦名《先王實錄》）以永曆七年大統曆閏八月，此亦或系當時所頒曆如此，但未獲詳證。今從之。',

		// 臺灣明鄭時期東寧王朝/鄭氏王朝/臺灣統治者
		'明鄭//=|1662/2/19~1684/2/14|16/=5uq 4ia 3rd248a 439 3mms46i 4ofg5dw 5us 4pl45as 52s 4c6e505 46i 4rky5e1 3swq4a9 3q1 3252|朝代=明;南明|時期=大明|參照用|注=南明滅亡後，臺灣鄭氏政權所使用日期（永曆十七年～永曆三十七年）',
		// 延平郡主;延平郡王
		'/鄭成功/=|1662/2/19~|16/=:明鄭|君主名=鄭森|表字=明儼;大木|封號=延平王|生=1624年8月27日|卒=1662年6月23日',
		'/鄭襲/=|1662/6/23~|16/=:明鄭|表字=世襲|齋號=葵庵|封號=延平王|卒=1663年|注=鄭成功風寒病逝，在臺諸將推舉鄭成功五弟鄭襲為「護理」，以定軍心。鄭襲部下蔡雲、李應清、曹從龍、張驥等四人拉攏黃昭及蕭拱宸等駐臺將領，立鄭襲為「東都主」。',
		'/鄭經/=|1662/12/11~|16/=:明鄭|君主名=鄭錦|表字=賢之;元之|君主號=式天|封號=延平王|生=1642年10月25日|卒=1681年3月17日|注=11月，鄭經軍先至澎湖，派人與黃昭、蕭拱宸等人協商不成後，率軍東征。',
		// 鄭克臧
		'/鄭克𡒉/=|1681/3/17~|35/=:明鄭|封號=延平王|生=1662年|卒=1681年3月18日|注=永曆三十三年被冊立為世子，並兼任監國。延平郡王鄭經逝世後，承天府（今臺南地區）發生東寧之變，又稱東寧政變，繼位不及三日的監國同時也是世子的鄭克𡒉遭到罷黜並且被殺害，改由鄭經之弟鄭聰與外戚馮錫範所支持的鄭克塽繼承王位。',
		// 明宗室寧靖王朱術桂和五姬妾,聞鄭克塽決計降清,均自縊而死,為明室盡節。
		'/鄭克塽/=|1681/3/19~1684/2/14|35/=:明鄭|封號=延平王;海澄公|表字=實弘|君主號=晦堂|生=1670年8月13日|卒=康熙46年8月27日|注=《南明大統曆》永曆37年：是年明清朔閏全合。節氣符者三。傅以禮原曆註云：「閏六月臺灣降於大清，明朔亡。」考施琅「臺灣紀略碑記」，琅以是年八月望日受降於赤嵌，明朔云亡，蓋當於是。而古曆頒授時，例年前行之，是年明曆，行已半載，民多熟習，奉之終歲者必矣。故八月以後之時令，於考史非無義﻿',

		// TODO: 明朝統治地區其他勢力年號
		// 明末民變/明末農民戰爭
		'明/張普薇/天運|1637/1/26~1638/6/11|:明|疑|時期=大明|君主名=張普薇|據=Wikipedia|注=Wikipedia: 見於李兆洛《紀元編》。十年（1637年），以張普薇為首，在鉛山率領農民起事。改元天運。翌年二月初四日攻南豐。四月，張普薇被明軍捕獲殺害。',

		// 1645/6/23: 1645年夏死
		'大順/太祖/永昌|1644/2/8~1645/6/23|:明|疑|君主名=李自成|時期=大明|據=Wikipedia|注=崇禎十七年正月在西安建國，國號「順」。三月十九日甲申之變攻陷北京，滅明朝。四月廿九日，李闖在燕京紫禁城武英殿匆匆即位稱帝，深夜便焚燒宮殿與九門城樓，向西撤退，闖軍僅駐燕京四十一日。1645年夏在湖北通山縣南九宮山被忠於明朝的地方武力程九伯殺死（一說李闖自殺、失蹤、出家為僧等。）皇子李自敬未稱帝。擎天王宮文彩的年號也是永昌',
		// 1644/8/2: 七月初一
		'大西/西王/大順|1644/8/2~1647/2/4|7=:明|疑|君主=大西皇帝|君主名=張獻忠|君主字=秉吾|君主號=敬軒|時期=大明|據=Wikipedia|注=祟禎十六年據武昌，稱大西王。1644/8/16登基成為大西皇帝，改元大順。以成都為「西京」。',

		'後金/太祖/天命|1616/2/17~|4ei 5e1 3swk4a8 5ax 324y3oq 4mga591 4gi 4so6|朝代=清|時期=大清|注=1616年努爾哈赤在今中國東北地區建國稱汗，建立「後金」',
		'/太宗/天聰|1627/2/16~|5ep 4aa 3b503q2 3a2342z 42t 3z2w4h0 5es',
		'清/太宗/崇德|1636/5/15~|/4/11=5es 3t6s4ac 47u 3mox4yz 3pnv5s9|時期=大清|生=1592年11月28日申時 (萬曆二十年十月廿五申時 1592年11月28日)|卒=1643年9月21日亥時 (崇德八年八月初九亥時)|在位=1626年10月20日~1643年9月21日|注=清史稿/卷3: 崇德元年夏四月乙酉，祭告天地，行受尊號禮，定有天下之號曰大清，改元崇德',
		'/世祖/順治|1644/2/8~|4i0 4t8m5ew 52s 4g9g3mi 4zx 3qk247d 40124i9 3u1 3a913p1 3mi 4mg3591 3sd3|諡=體天隆運統建極英睿欽文顯武大德弘功至仁純孝章皇帝|君主名=愛新覺羅福臨|生=崇德三年正月三十 1638年3月15日|卒=1661年2月5日 (顺治十八年正月初七)|在位=1643年10月8日~1661年2月5日|注=清入關(1644)後頒《萬年書》(清木刻大本 御定萬年書)，回溯至1624年。清於1645年頒行《時憲曆》。',
		// 康煕: see 中山世譜
		'/聖祖/康熙|1662/2/18~|49u 4ia 3rd248a 439 3mms46i 59h 3sr649w 4pl35as 50s 4c6d505 46i 4rkz5e1 3swo4a9 3q1 32523ot 3md 4fv858y 5e9 3t434aa 3b5z44a 3ot 39h142t 59e 4soz5es 3t6v4ac 47u 3mp24z1 46d 4oes4i0 5ew 4igz52s 4g9j3mi 579 3qk547l 4i9 3eoj3u1 3a943p1 3oq 4mg6591|諡=合天弘運文武睿哲恭儉寬裕孝敬誠信功德大成仁皇帝|君主名=愛新覺羅玄燁|生=順治十一年三月十八巳時 1654年5月4日|卒=康熙六十一年十一月十三 1722年12月20日|在位=1661年2月5日~1722年12月20日|紀年=康熈;康煕|注=孝莊太后對少年康熙的謀策頗有指點，對康熙帝起極大之啟蒙作用。',
		'/世宗/雍正|1723/2/5~|49e 4pic5aq 48a 3a8z439 3mmv46i 59h 3sr949w 5as 3rlw|諡=敬天昌運建中表正文武英明寬仁信毅睿聖大孝至誠憲皇帝|君主名=愛新覺羅胤禎;愛新覺羅胤禛|生=康熙十七年十月三十 1678年12月13日|卒=雍正十三年八月廿三 1735年10月8日|在位=1722年12月27日~1735年10月8日',
		'/高宗/乾隆|1736/2/12~|50s 4g5l505 47e 4rl25e1 4a0 4q383qh 3fw 4g5v3md 4m6v58y 5e9 3t454b6 3qi 3a1w431 39i146d 59e 55c65gk 4b8 3o7948a 431 3mj646h 4oev5ag 5go 4j9h5as 50q 4fc3579 3ql649e 5e9 3swm4a1 3px 32393oq 579 3qkz49e 4so75ec 48i 3b1h445 42y 4o105d1 4gy 4sqq|諡=法天隆運至誠先覺體元立極敷文奮武欽明孝慈神聖純皇帝|君主名=愛新覺羅弘曆|生=康熙五十年八月十三日子时 1711年9月25日|卒=嘉慶四年正月初三辰刻 1799年2月7日|在位=1735年10月18日~1796年2月9日',
		'/仁宗/嘉慶|1796/2/9~|5es 3rly52s 506 3mms4zu 5s5 3z4i4i0 4q3a3qh 3hw 4g5x3me 56y 55435sh 4b5 3bj63u2 3a92431 42e 4nys59e|諡=受天興運敷化綏猷崇文經武孝恭勤儉端敏英哲睿皇帝|君主名=愛新覺羅顒琰;愛新覺羅永琰;愛新覺羅顒琰|生=乾隆二十五年十月初六 1760年11月13日|卒=嘉慶二十五年七月廿五 1820年9月2日|在位=1796年2月9日~1820年9月2日|注=嘉慶二十五年八月二十七日，皇次子登極。明年改元爲道光。',
		'/宣宗/道光|1821/2/3~|5uq 3txf4b8 3rd348a 439 3mmt46i 59g 57d05uw 4pl55as 50q 4fc6579 47e 4pb85e9 4a0 4plv3px 323b3oq 579 3qs54gy 5e9 3sxw4aa|諡=效天符運立中體正至文聖武智仁慈儉勤孝敏寬定成皇帝|君主名=愛新覺羅旻靜;愛新覺羅綿寧;愛新覺羅旻寧|生=乾隆四十七年八月十日 1782年9月16日|卒=道光三十年正月十四 1850年2月25日|在位=1820年10月3日~1850年2月25日',
		'/文宗/咸豐|1851/2/1~|3b60446 42y 4o135r9 4gy 4sqt5es 4ac 3nsz506|諡=協天翊運執中垂謨懋德振武聖孝淵恭端仁寬敏顯皇帝|君主名=愛新覺羅奕詝|生=道光十一年六月初九 1831年7月17日|卒=咸豐十一年七月十七 1861年8月22日|在位=1850年3月9日~1861年8月22日',
		'/穆宗/同治|1862/1/30~|3pt44zu 5s9 3z4l4i0 5ew 4ihg3hx 31p63me 576 55465sh|諡=繼天開運受中居正保大定功聖智誠孝信敏恭寬毅皇帝|年號=祺祥|生=1856年4月27日 (咸丰 (年号))|卒=同治十三年腊月初五 1875年1月12日|在位=1861年11月11日~1875年1月12日|注=1861年8月22日，咸豐帝（清文宗）在熱河承德去世，兒子載淳在以肅順為首的8位顧命大臣的輔佐下登基，9月3日改元祺祥。11月2日辛酉政變發生，八大臣被慈禧一派奪權。朝廷在11月7日下詔翌年改年號為同治，棄祺祥。|注=清史稿穆宗本紀一.乙卯，定年號祺祥。..庚申，詔改祺祥為同治。..甲子，上御太和殿即皇帝位，受朝。頒詔天下，以明年為同治元年。|君主名=愛新覺羅載淳',
		'/德宗/光緒|1875/2/6~|4i9 3ep13u2 3p1 380j42e 4nyv59g 5uq 40914ic 48a 3a90439 42y 4of659g 57d25uw 5as 3rdh3fu 505 3psj47e 4sh45e9 4a0 4pph3q1 3my 4g4k591 4eq|諡=同天崇運大中至正經文緯武仁孝睿智端儉寬勤景皇帝|君主名=愛新覺羅載湉|生=同治十年六月廿八 1871年8月14日|卒=光绪三十四年十月廿一 1908年11月14日|在位=1875年2月25日~1908年11月14日',
		// 光緒二十五年十二月二十四日（1900年1月24日），溥儁受詔入宮，封為大阿哥，並以崇綺為師傅，命在弘德殿讀書。年號保慶，史稱保慶帝，[來源請求]但外國公使均不承認，慈禧被迫停止廢立計劃。
		'/遜帝/宣統|1909/1/22~|4so25e9 3t52|君主名=愛新覺羅溥儀;溥儀|君主=末帝|生=1906年2月7日|卒=1967年10月17日|注=宣統三年十二月二十五日《宣統帝退位詔書》|注=1917/7/1~12 張勳復辟。',

		// `中曆`未受中國任何紀年參照，加`|參照用`會使 CeL.era.中曆() 出錯。
		'中曆|1912/2/18~'
				+ CeL.era.pass_on.last_day
				+ '|1912/=4aa 3q2 3a0542z 3o5 3yoi4h0 4t535es 4ac 3nt150a 4yz 3pno5s9 4h4 4t8i5ew 4ihi3p1 3fe 4f39576 5s9 400j4i9 3ep33u2 3p1 380m42y 591 3qro5uq 4ia 3epu48a 3mw74z9 42y 4of95d1 49w 4pkz5as 3rdk3fu 505 3psm47e 5e1 3swk4a0 5ax 324z3my 4mg7591 4gi 4so55ea 4aa 3b503q2 3a2042z 42d 3yom4h0 5es 3t6s4ac 3nt650a 4yz 3po647d 4h4 4t8l5ew 52s 4g9f3fe 4fxk577 47d 40114i9 3u1 3a903p1 3mi 4mg2591 3qrr5uq 4ia 3epx48a 439 3mms46i 4ofd5dx 49w 4pl25as 48c 4c6c505 46i 4rky5e1 3swm4a9 3q1 32513os 579 4fv74gi 4sob5ea 4aa 3b5y3q2 3ot 37w542t 58y 4soy5es 3t6v4ac 47u 3mp14z1 46d 4oer4i0 4t8o5ew 52s 4g9i3fe 4zx 3qk447l 4i9 3eoj3u1 3a933p1 3mi 4mg5591 49e 4pic5aq 3rd448a 439 3mmu46i 59h 3sr849w 5as 3rer50s 4czr505 46i 4rl15e1 4a0 4pp03q1 32543ot 3md 4fva58y 5e9 3t444aa 3qi 38gy3os|紀年=農曆;陰曆;舊曆;夏曆|注=中國傳統曆法暫時名稱。又稱夏曆、黃曆、皇曆、漢曆、農曆、陰曆、舊曆等。|注=羅爾綱《不應稱舊曆為農曆》（1992，上海《文匯報》） 羅先生說，辛亥革命以後，一般是把舊曆（陰陽曆）叫做「夏曆」。',

		// 清朝統治地區其他勢力年號
		'清/蔡牽/光明|1805/1/31~1810/2/3|:清|疑|時期=大清|君主名=蔡牽;蔡騫|君主=大出海;鎮海威武王;鎮海王|生=1761年|卒=1809年|據=吳建昇. 嘉慶十年(1805)海盜蔡牽攻台行動之研究|注=鄭兼才，《六亭文選》〈山海賊總論〉，頁 52: 自稱鎮海威武王光明元年。不過據大陸學者季士家所撰〈蔡牽研究九題〉，作者利用軍機處奏摺錄副資料考證，認為「建元光明」是對蔡牽所刻之「王印正大光明」的誤解，又鎮海威武王之「威武」二字亦係後人所杜撰。季士家〈蔡牽研究九題〉，《歷史檔案》1992 年第 1 期(總 45 期)，（北京：歷史檔案雜誌社，1992），頁 97。',

		// 臺灣清治時期三大民變
		// 臺灣年號列表
		// https://zh.wikipedia.org/wiki/%E5%8F%B0%E7%81%A3%E5%B9%B4%E8%99%9F%E5%88%97%E8%A1%A8
		'大明/中興王/永和|1721/5/1~8/22|:清|疑|國號=大明|時期=大清|君主名=朱一貴|君主=義王;德宗;鴨母王|生=康熙29年|卒=康熙61年2月22日|據=Wikipedia|注=Wikipedia: 臺灣清治時期三大民變之朱一貴事件。舉事期間，定國號為「大明」，建元永和，並受眾人擁戴為中興王，自稱義王。攻下臺灣府城後，眾將擁立朱一貴為「中興王」，於今臺南大天后宮登基。朱一貴尊明為正朔，承襲明朝的制度，國號大明，年號永和，廢薙髮令，封諸將為官，布告天下。|注=閏6月5日僅餘千餘人進入溝尾莊（今嘉義縣太保市）。漳州人王仁和密謀楊旭、楊雄，聯合六莊鄉丁設計擒朱一貴等解赴清軍。大明永和至此結束。朱一貴和直到九月投降清軍的杜君英俱於十月解送北京。',

		// https://tw.knowledge.yahoo.com/question/question?qid=1608122606011
		// 李崇智. 中國歷代年號考. 否定了臺灣起義者與"天地會"有直接關係的考證
		// http://blog.xuite.net/ccy1217/Formosa/205622681-%E6%9E%97%E7%88%BD%E6%96%87%E4%BA%8B%E4%BB%B6
		'清/林爽文/天運|1787/1/16~|:清|疑|君主名=林爽文|君主=盟主大元帥|生=1756年|卒=1788年|據=Wikipedia|注=乾隆51年冬11月27日夜，會匪林爽文作亂。乾隆五十一年十一月廿九日攻下彰化，自稱「盟主大元帥」。',
		// 1787/1/27: 未確認，應於乾隆51年12月6日~30日間。
		// 但有"天運丙午年十二月初八日，順天大盟主林爽文告示", "順天丁未年三月" 《奉天承運VS.順天行道 --林爽文事件研究》
		// http://wtfm.exblog.jp/19062163/
		// 林爽文年號「天運」，後來的要推翻滿清的孫中山革命時在其債券、銀票也曾使用過「天運」年號。
		// http://blog.xuite.net/ccy1217/Formosa/205622681-%E6%9E%97%E7%88%BD%E6%96%87%E4%BA%8B%E4%BB%B6
		// 12月庚子朔，賊陷淡水，護淡水同知臺灣縣知縣程峻自殺。
		// 護同知程峻，同守備董得魁，先在中港守禦，賊黨盤山踰嶺而入，糾結月眉莊李同、貓裡社黃阿寧、何添等，直至新莊，所過附逆者甚眾。護同知程，聞彰化城陷，退回塹城，而賊首王作、李同等，分夥伏匿；程輕賊少，逕渡直攻，行至山頗，伏賊盡起，程自殺。諸賊乘機搶掠，塹城遂陷。程長子必大，懷印信從八里坌內渡。賊眾共推林爽文為盟主，偽號順天。時爽文以縣署為盟主府，本縣胥吏劉懷清為偽彰化縣知縣，劉士賢為偽北路海防廳，王作為偽征北大元帥，王芬為偽平海大將軍。是日大宴群賊，爽文以烏緞為冠，蟠金龍二，黃線結蕤，自頂垂背，掠取官幕袍服衣之。其眾悉以烏布帕頭。
		// 六日乙巳，賊陷諸羅。
		'/順天|1787/1/27~1788/2/10|:清|疑|注=乾隆五十一年十二月初一北路的王作、李同也率眾響應，殺淡水同知程峻。又向北攻下新竹竹塹城。林爽文建號「順天」|注=53年春正月四日丁卯，獲賊首林爽文於老衢崎，檻送京師伏誅。北路平。 福康安令人說服當地居民於老衢崎（今苗栗縣竹南鎮崎頂里一帶）生擒林爽文。之後爽文被凌遲斬首',

		'/陳周全/天運|1795/4/19~5/6|:清|疑|君主名=陳周全|卒=1795年|據=Wikipedia|注=Wikipedia: 三月，陳周全結合三千餘人趁機起事。三月十日，主要成員為天地會會員的該武裝部隊攻佔鹿港，殺死駐守鹿港的清軍水師游擊曾紹龍、同知朱慧昌。|注=三月十八日臺灣道觀察使楊廷理帶兵前往斗六，順利解除斗六的圍城危機，隨後楊廷理攻下彰化與鹿港兩地。陳周全亦在這場戰役中被捕，不久即遭清朝處死。',

		// 1862/4/18: 未確認，應於臺灣通史/卷33:
		// 同治元年三月初九日，按察使銜臺灣兵備道員孔昭慈抵達彰化 ~
		// 十九日夜半"...黨人既入城，鼓吹以迎潮春。潮春冠黃巾，穿黃馬褂，健卒數十人前後擁，騎馬入城，出示安民，令蓄發遵明製。自稱大元帥"間。
		'清/戴潮春|1862/4/18~1864/1/29|:清|疑|君主名=戴潮春;戴萬生|卒=1864/1/29|據=Wikipedia|注=Wikipedia: 表字萬生。4月16日率八卦會黨人圍攻彰化縣城，並從八卦山以大砲轟城。|注=(同治二年十二月二十一日)乘轎至北斗，曰健訊以作亂之故，對曰：“此皆本藩之事，毋與百姓。”曰健怒，命陳捷元推出斬之。',

		'天運/張丙/天運|1832/11/22~1833/2/19|:清|疑|時期=大清|君主名=張丙|君主=開國大元帥|卒=道光13年6月|據=Wikipedia|注=臺灣通紀: 道光十二年閏九月，張丙倡亂嘉義，戕知縣、知府，圍嘉義城，困總兵匝月，破鹽水港，劫軍火器械於曾文溪，彰化黃城陷斗六門，是為北路賊。……張丙乃遍約所交遊，偽稱開國大元帥，年號天運，以戕殺穢官為名。|注=張丙用天運年號，其餘用奉天、大明主各年號，俱係各自爭強，並未互相關會。|注=周凱，《內自訟齋文集》，<記臺灣張丙之亂>，頁33。道光十二年閏九月十日，阿凜率眾焚陳辨屋，又牽他人牛。陳辨約張丙與之鬬。丙…聚眾三百人，與陳辨、陳連（按：？－1833）攻雙溪口，不勝，反為所傷。聞總兵劉公廷斌出巡，張丙與眾潛回店仔口。陳辨、陳連焚掠附近交平諸粵莊，張阿凜焚陳連莊。二十五日，陳辨搶大埔汛防器械；總兵劉公至東勢湖（按：今民雄鄉東湖村），戮搶豬者二人。北路協副將葉長春與邵令（按：即邵用之？－1832）亦至，夾擊陳辨於紅山仔。辨走，與王奉合，復攻埔姜崙莊。官兵猝至，斬其黨王興、王泉。辨、奉具竄店仔口（按：今臺南縣白河鎮），白張丙。丙觸前忿，謂專殺閩人偏袒；遂與詹通謀反，豎旗起事。」|注=Wikipedia: 攻佔臺灣縣大部分地區與雲林斗六門（今斗六）一帶',

		{
			// 太平天囯（其中「天」字的兩橫上長下短；「囯」字內為「王」字）
			data : '太平天囯|1851/2/1~|:清|朝代=太平天國;太平天国|曆法=清時憲曆|時期=大清|君主=洪秀全|注=太平天曆是到壬子二年正月初一日才頒行的。（罗尔纲，太平天国史卷三十二 志第十一 天历 四 天历与夏历阳历对照及简表）沒有閏月，惟辛開元年有「又八月初七日」|注=太平天國將地支「丑」、「卯」、「亥」改為「好」、「榮」、「開」。',
			// 干支內名號，因以聲音不雅，故為改之。
			fix_太平天囯干支 : function(干支) {
				return 干支.replace(/[丑卯亥]/g, function($0) {
					return {
						丑 : '好',
						卯 : '榮',
						亥 : '開'
					}[$0];
				});
			},
			fix : function(date) {
				var convert = this.fix_太平天囯干支;
				date.歲次 = convert(date.歲次);
				date.月干支 = convert(date.月干支);
				date.日干支 = convert(CeL.to_stem_branch(CeL
						.stem_branch_index(date)));
				date.時干支 = convert(CeL.to_stem_branch(CeL.stem_branch_index(
						date, {
							hour : true
						})));
			}
		},
		{
			data : '太平天囯|1852/2/3~1869/5/28|2/='
					// 18年，每年6循環。每循環單月31天，雙月30天。
					+ new Array(18 + 1).join(
							'\t' + new Array(6 + 1).join(';31;30').slice(1))
							.slice(1)
					+ '|朝代=太平天國;太平天国|曆法=太平天曆|君主=洪秀全|大月=31|注=太平天國紀元根據現存記載應該斷到己巳十九年四月十一日（清同治八年四月十七日，一八六九年五月二十八日）陝西保安縣老岩窯陷落為止。（罗尔纲，太平天国史卷三十二 志第十一 天历 四 天历与夏历阳历对照及简表）|注=太平天國將地支「丑」、「卯」、「亥」改為「好」、「榮」、「開」。|注=洪秀全（1814年1月1日－1864年6月1日），清末革命領袖，建立太平天國，稱天王。原名洪仁坤，小名火秀，又名洪日。1851年建立太平天國時，立洪天貴福為幼主。洪天貴福在1864年（同治三年）6月6日在天京（今江蘇南京）即位，成為「幼天王」。',
			fix_太平天囯干支 : function(干支) {
				return 干支.replace(/[丑卯亥]/g, function($0) {
					return {
						丑 : '好',
						卯 : '榮',
						亥 : '開'
					}[$0];
				});
			},
			fix : function(date) {
				var convert = this.fix_太平天囯干支;
				date.歲次 = convert(date.歲次);
				date.月干支 = convert(date.月干支);
				// 吴善中。太平天国天历干支、礼拜提前一天原因考
				date.日干支 = convert(CeL.to_stem_branch(CeL
						.stem_branch_index(date) + 1));
				date.時干支 = convert(CeL.to_stem_branch(CeL.stem_branch_index(
						date, {
							hour : true
						})));

				date.getDay = new Function('return '
						+ ((date.getDay() + 1) % 7));
				// TODO: .getUTCDay()
			}
		},

		'劉明/劉麗川/天運|1853/9/7~1855/3/17|:清|疑|國號=大明|時期=大清|君主名=劉麗川|君主=大明統領政教招討大元帥|據=Wikipedia|注=Wikipedia: 上海抗清組織「小刀會」首腦。咸豐三年八月初五上午10時，於上海縣城北門外，...劉自稱「大明國統領政教招討大元帥」...咸豐五年正月初一日清軍自此缺口湧入城內，與小刀會展開巷戰，逮捕小刀會頭目謝安邦、陳芝，惟存劉麗川率死黨奮力逃出上海縣，虎嵩林領軍追之，至虹橋追至劉予以格斃。',

		// 中華民國成立以後中國君主制政權年號
		'大清/察都/通志|1915/3/16~1916/2/2|:中曆|時期=民國|君主名=察都|生=1864年|卒=1915年|疑|據=Wikipedia|注=Wikipedia: 1915年二月，攻佔成都驅逐了北洋政府四川都督胡景伊，自立為帝。年號通志，奉大清為宗主國，建都成都。十個月後，北洋政府上將蔡鍔攻下成都，槍斃察都，通志政權滅亡，歷時一年。',

		// 洪憲帝制
		'中華帝國/袁世凱|1915/12/12~|:CE|時期=民國|君主名=袁世凱;袁項城|表字=慰廷;慰庭;慰亭|君主號=容庵|生=1859年9月16日|卒=1916年6月6日|據=Wikipedia|注=Wikipedia: 民國4年12月12日中華民國大總統袁世凱稱帝，預改國號為「中華帝國」，隔年建元「洪憲」；民國5年3月22日取消稱帝，恢復民國',
		'/=/洪憲|1916/1/1~3/22|:CE|據=Wikipedia|注=Wikipedia: 1916年3月22日宣布《撤銷帝制令》取消帝制。直至袁世凱對內宣布取消帝制都未正式登基，年號洪憲僅在內部流傳，對外仍稱民國，故袁世凱仍是民國大總統',

		'大清/溥儀/宣統|1917/6/30~7/12|9/=:中曆|時期=民國|君主名=愛新覺羅溥儀;溥儀|據=Wikipedia|注=Wikipedia: 民國六年6月30日（宣統九年五月十二日），張勳與陳寶琛等召開「御前會議」，密謀復辟。當天深夜，派兵佔據火車站、郵局等要地，並派人勸黎元洪「奉還大政」。宣統九年五月十三日~廿四日 張勳復辟，亦稱丁巳復辟。',

		// http://ja.wikipedia.org/wiki/%E5%A4%A7%E5%90%8C_(%E6%BA%80%E5%B7%9E)
		'滿洲國/滿洲國執政/大同|1932/3/1~|:CE|時期=民國|注=元年3月1日：満洲国建国。満洲国政府佈告二で、年号を大同と定める。(満州国建国宣言@国立公文書館 アジア歴史資料センター)|注=Wikipedia: 元年3月9日：溥儀就任滿洲國執政。|注=3年3月1日：満洲国執政・溥儀の満洲国皇帝即位に伴い、康徳と改元。',
		// http://ja.wikipedia.org/wiki/%E5%BA%B7%E5%BE%B3
		// 元年3月1日：溥儀在首都新京南郊杏花村舉行登基典禮，改「滿洲國」為「大滿洲帝國」，改元康德。
		// 12年8月18日：溥儀の退位宣言。満洲国崩壊。
		// この元号に関連して当時の満洲国皇帝（愛新覚羅溥儀）を康徳帝と称すことがある。当初は啓運を予定していたが、直前で康徳に変更されている。
		'滿洲帝國/康德帝/康德|1934/3/1~1945/8/18|:CE|政權=大滿洲帝國;滿洲帝國;滿洲國|君主名=愛新覺羅溥儀;溥儀|時期=民國|生=1906年2月7日|卒=1967年10月17日|據=Wikipedia|注=Wikipedia: 1934年3月1日，愛新覺羅·溥儀在新京南郊杏花村舉行登基典禮，改「滿洲國」為「滿洲帝國 」，溥儀稱帝，改年號「康德」。',

		// 以領導人作為歷史分期
		// [[中華民國歷史]]
		'中華民國|1912/1/1~' + CeL.era.pass_on.last_day + '|:CE|紀年=民國|時期=民國|參照用',
		'/軍政府鄂軍都督府/黎元洪|1911/10/10~|:CE|據=Wikipedia|注=武昌起義勝利後第二天即1911年10月11日，革命黨即在武昌組建了中華民國軍政府鄂軍都督府。',
		'/臨時政府/孫文|1912/1/1~|:CE|君主=孫中山|君主號=逸仙;日新|據=Wikipedia|注=清朝宣統三年八月十九，革命黨人成功發動辛亥革命。隔年陽曆元旦，中華民國臨時政府在南京成立|注=1911年12月29日，各省都督府代表聯合會代表在南京召開中華民國臨時大總統選舉會，選舉孫文為中華民國臨時大總統。1912年1月1日，孫文在南京就任臨時大總統。|注=中華民國建國時官方認定黃帝紀元，清末辛亥年（孔子紀元2462年，西元1911年）為黃帝紀元4609年。|注=民國紀年採公元紀月日。',
		'/臨時政府/袁世凱|1912/3/10~|:CE|據=Wikipedia|注=2月13日，袁世凱通電共和，根據南方獨立各省及部分革命黨人的意願，孫文提出辭職咨文，準備將大總統一職讓位給袁世凱。2月15日，在臨時大總統選舉中，南京臨時參議院選舉袁世凱為臨時大總統，袁世凱於3月10日在北京宣誓就職',
		'=/北洋政府|1913/10/6~|:CE|據=Wikipedia|注=北洋政府於1913年10月6日袁世凱當選為首任中華民國大總統後正式形成',
		'/國民政府|1928/12/29~|:CE|據=Wikipedia|注=1928年12月29日，奉系領袖張學良除下五色旗、改掛青天白日滿地紅，並通電南京，表示接受國民政府管轄，史稱東北易幟。|注=1947年12月25日行憲，《中華民國憲法》生效，廢除國民政府主席一職，以總統取代|注=1948年5月20日，中華民國國民大會依循《中華民國憲法》間接選舉選出的第一任總統、副總統正式就職，國民政府即改組為中華民國政府',
		// [[臺灣戰後時期]], [[中華民國在臺灣]]
		'/蔣中正|1948/5/20~|:CE|據=Wikipedia|君主字=介石|生=1887年10月31日|卒=1975年4月5日|注=蔣介石幼名瑞元，譜名周泰，學名志清',
		// [[中華民國總統]], [[1949年#12月]]
		'/李宗仁|1949/1/21~|:CE|據=Wikipedia|君主字=德鄰|生=1891年8月13日|卒=1969年1月30日|注=1948年年底，國共內戰國軍節節敗退，各方逼迫蔣下野之聲不斷。1949年1月19日，蔣約見李宗仁商談時局，表示引退。1月21日，李宗仁宣布就代總統職代行職權，聲明願就毛澤東所提八項條件即行開始商談；旋即下令撤銷總動員令，停止戒嚴法之實施，改各剿匪總司令部為長官公署，並釋放政治犯。|注=1949年12月7日，中國人民解放軍彭德懷、徐向前等部入四川北部，會合林彪、劉伯承等部，對成都採取大包圍形勢。成都外圍展開激戰。蔣介石指示閻錫山作好當晚離開成都之準備。蔣立即決定中華民國政府遷移臺北，指示行政院召開緊急會議。是晚8時，行政院舉行會議，通過國府遷設臺北，隨即發布「總統令」：「政府遷設臺北，並在西昌設大本營，統率陸海空軍在大陸指揮作戰。此令。」成都設置防衛司令部。胡宗南接防成都市區。12月10日蔣中正帶著兒子蔣經國，從成都鳳凰山機場起飛往臺灣，下午飛返臺北，從此臺海兩岸分治，蔣中正再也沒回到中國。|注=中華民國臺灣省政府主席兼臺灣省警備總司令陳誠於1949年5月19日頒布的戒嚴令，內容為宣告自同年5月20日零時（中原標準時間）起在臺灣省全境實施戒嚴|注=國共戰爭國民黨戰敗後，1949年11月20日李宗仁以治病為由，宣布中樞軍政由行政院院長閻錫山負責，12月5日到美國治病，代行總統職權止於1950年3月1日總統蔣中正復行視事。',
		'/蔣中正|1950/3/1~|:CE|據=Wikipedia|注=蔣中正復行視事後，李宗仁並未就職副總統，並指蔣復職為違憲，後1954年3月10日由國大代表彈劾李宗仁去職。',
		'/嚴家淦|1975/4/6~|:CE|據=Wikipedia|君主字=靜波|生=1905年10月23日|卒=1993年12月24日|注=1975年4月5日，蔣中正病逝，依中華民國憲法規定，由副總統嚴家淦繼任總統。4月6日上午11時，嚴家淦宣誓就任總統。',
		// [[解嚴紀念日]], [[民主化時期]]
		'/蔣經國|1978/5/20~|:CE|據=Wikipedia|君主字=建豐|生=1910年4月27日|卒=1988年1月13日|注=1987年7月15日中華民國政府解除「臺灣省戒嚴令」。該戒嚴令自1949年5月19日頒布，次日開始行使',
		'/李登輝|1988/1/13~|:CE|生=1923年1月15日',
		'/陳水扁|2000/5/20~|:CE|生=1950年10月12日',
		'/馬英九|2008/5/20~|:CE|生=1950年7月13日',
		'/蔡英文|2016/5/20~|:CE|生=1956年8月31日',
		'/賴清德|2024/5/20~2028/5/19|:CE|生=1959年10月6日',

		// [[中华人民共和国历史]]
		// 中央領導集體的核心
		'中华人民共和国/毛泽东|1949/9/21~|:CE|生=1893年12月26日|卒=1976年9月9日|君主字=潤之|據=Wikipedia|注=1949年9月21日，中国人民政治协商会议第一届全体会议正式宣布成立中华人民共和国。「中华人民共和国的紀年採用公元，今年為一九四九年」|注=1949年10月1日，在北京天安门广场举行开国大典',
		'/邓小平|1978/12/18~|:CE|生=1904年8月22日|卒=1997年2月19日在北京病逝|君主名=邓先圣;邓希贤|據=Wikipedia|注=中国共产党第十一届中央委员会第三次全体会议，简称中共十一届三中全会，於1978年12月18日至12月22日在北京举行。',
		'/江泽民|1997/3/27~|:CE|生=1926年8月17日',
		'/胡锦涛|2002/11/15~|:CE|生=1942年12月25|注=江泽民等人在中共十六大上退出中央政治局和中央委员会，2002年11月让位给由新任总书记胡锦涛率领年轻的“第四代”领导集体。不过，江泽民依然在发挥影响力，并直到2004年底才辞去中央军委主席，交出军权。',
		'/习近平|2012/11/15~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|生=1953年6月15日|注=2012年11月中共十八屆一中全會上當選中國共產黨中央委員會總書記及中國共產黨中央軍事委員會主席。中共第十七屆和第十八屆中央政治局常務委員會委員、第十七屆中央書記處書記。2013年3月第十二屆全國人民代表大會第一次全體會議上當選中華人民共和國主席及中華人民共和國中央軍事委員會主席。'

]).minute_offset = 8 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"ryukyu"}
(CeL.era.pass_on.countries["琉球"] = [
		// 御主加那志、御主加那志前(御主/ウス)是琉球國中山王在國內的稱號。
		// 外交文件《歷代寶案》, 正史《中山世鑑》, 蔡溫本《中山世譜》, 《球陽記事》

		// 據=中山世譜/卷03
		// http://archive.library.pref.okinawa.jp/?type=book&articleId=50435
		'舜天王朝/舜天|1187/2/10~|:南宋|精=年|傳說|國名=流虬;流求;琉球;琉球國;琉球王国;沖縄;沖繩|據=中山世譜/卷03|朝代=舜天王統|神號=尊敦|生=宋乾道二年|卒=宋嘉煕元年|注=南宋淳煕年間，天孫氏二十五紀之裔孫徳微政衰，其臣利勇專權没，遂自弑君簒位。(球陽記事/卷之一:宋淳煕七年 權臣利勇專權，遂自弑君篡位)\n時浦添按司尊敦，倡義起兵，以討利勇。國人推戴尊敦，以就大位，是爲舜天王。|注=球陽記事/卷之一: 本國用夏正，自舜天王而然也歟。故《世譜》云：舜天王乾道二年丙戌降誕，淳熙十四年丁未即位。俗說徃右，以建未用為正。盖穀能養人，此月舊穀已遂，新穀和登，由是本國以六月為正月云爾。由是考之，本國用夏正自此而始',
		'/舜馬順熙|1238/1/18~|:南宋|精=年|傳說|君主=舜馬順煕;舜馬順熈|神號=其益美|生=宋淳煕十二年|卒=宋淳祐八年',
		'/義本|1249/1/16~|:南宋|精=年|傳說|生=宋開禧二年',

		'英祖王朝/英祖|1260/2/13~|:中國|精=年|疑|國名=瑠求|朝代=英祖王統|神號=英祖日子|生=宋紹定二年|卒=元大徳三年八月初五',
		'/大成|1300/1/23~|:中國|精=年|疑|生=南宋淳祐七年|卒=元至大元年十二月初八日',
		'/英慈|1309/2/11~|:中國|精=年|疑|生=南宋成淳四年|卒=元皇慶二年九月二十日',
		'/玉城|1314/1/17~|:中國|精=年|疑|生=元元貞二年|卒=元順帝至元二年三月十一日',
		'/西威|1337/2/1~|:中國|精=年|疑|生=元致和元年|卒=元至正九年四月十三日|注=《中山世鑑》西威在位十四年\n中山世譜/卷03 西威在位十三年，壽二十二。',

		'中山王國/察度|1350/2/7~|:中國|精=年|疑|時期=三山時代|朝代=中山王国;察度王朝;察度王統|神號=大眞物;大真物|生=元至治元年|卒=明洪武二十八年十月初五日',
		'/武寧|1396/2/10~1406/1/19|:中國|精=年|疑|神號=中之眞物|生=元至正十六年',

		// 據=中山世譜/卷04;Wikipedia
		'山北王國/怕尼芝|1322/1/18~|:中國|精=年|疑|時期=三山時代|朝代=北山王國;北山王国;怕尼芝王朝;怕尼芝王統|注=前一代山北王: 今歸仁|注=「おもろさうし」によれば、従兄弟の子で山北王である今帰仁按司を討ち、自ら山北王となったと言われている。\n文献では帕尼芝の在位は1322年から1392年もしくは1395年まで70年以上に渡るとされ、実際は親子数代で同じ名を使っていたのではと考察されている。名の由来が羽地按司であれば、その称号を使い続けたと考えられる。|注=1322年宣布脫離中山的統治，自稱北山王，割據沖繩本島北部自立。|注=中山世譜/卷04: 起元延祐年間，盡明永樂四年(14年?)丙戌。凡四主，歴九十餘年。',
		'/珉|1396/2/10~|:中國|精=年|疑|注=中山世譜/卷04: 珉【在位五年】|注=中山世譜: 明洪武二十九年丙子 山北王珉薨 其子攀安知立 (山北王怕尼芝薨 其子珉立??) 受封于朝 遣使入貢',
		'/攀安知|1401/1/15~1417/1/17|:中國|精=年|疑|注=攀安知や怕尼芝は、個人名ではなくいずれも王統名「羽地」の漢字音訳。|注=明永樂十四年，尚思紹王在羽地按司的勸說下，派世子巴志攻擊北山國。|注=中山世譜/卷04: 攀安知【在位二十一年】\n起元延祐年間，盡明永樂四年(14年?)丙戌。凡四主，歴九十餘年。',

		'山南王國/承察度|1337/2/1~|:中國|精=年|疑|時期=三山時代|朝代=南山王國;南山王国;大里王朝;大里王統|注=承察度は、大里（うふさと）の当て字と考えられている。北山王国の怕尼芝と同様、親子数代で同じ名を襲名したと考えられる。|注=前一代山南王: 大里|注=中山世譜/卷04: 十五年丁酉，王及世子尚巴志并山南王他魯毎\n起元延祐年間，盡明宣徳四年己酉。凡四主，歴一百餘年。',
		'/汪英紫|1398/1/19~|:中國|精=年|疑|生=元至正十六年|注=1397年，汪英紫與豐見城按司汪應祖（汪英紫的次子）、佐敷按司巴志合謀，圍攻南山國的都城島尻大里城（今沖繩縣今糸滿市北部）。承察度兵敗出奔。\n汪英紫本人並未稱王。但是承察度戰敗出奔之後，山南國出現了一段王位空缺時期。',
		'/汪應祖|1403/1/23~|:中國|精=年|疑',
		'/達勃期|1414/1/22~|:中國|精=年|疑|注=中山世譜/卷04: 永樂十二年，謀弑應祖纂位。【汪應祖在位十一年】各寨官并諸按司合兵誅達勃期，推應祖之長子他魯毎攝國事。',
		'/他魯每|1415/2/10~1430/1/23|:中國|精=年|疑|君主=他魯毎|注=名の他魯毎は、琉球名「太郎思い（たるもい）」の当て字と考えられている。|注=中山世譜/卷04: 他魯毎【在位二十五年】|注=他魯每於1429年發兵討伐中山。尚巴志將其擊敗，並乘勝攻佔他魯每的居城島尻大里城，他魯每被俘處死，南山王國也同時滅亡。',

		// 據=中山世譜/卷04
		// 《中山世鑒》洪武十六年、更流求曰琉球、賜以金符印、寵以章服。
		'第一尚氏王朝/尚思紹|1406/1/20~|:明|精=年|疑|神號=君志眞物|朝代=第一尚氏王統|卒=明永樂十九年',
		'/尚巴志|1422/1/23~1440/2/2|:明|疑|神號=勢治高眞物;勢治高真物|生=明洪武五年|卒=明正統四年四月二十日薨',
		// 據=中山世譜/卷05
		'/尚忠|1440/2/3~|:明|疑|生=明洪武二十四年|卒=明正統九年十月二十四日',
		'/尚思達|1445/2/7~|:明|疑|神號=君日|生=永樂六年|卒=明正統十四年十月十三日',
		'/尚金福|1450/1/14~|:明|疑|神號=君志|生=明洪武三十一年|卒=明景泰四年四月十八日',
		'/尚泰久|1454/1/29~|:明|疑|神號=那之志與茂伊|君主=大世主|生=明永樂十三年|卒=明天順四年六月初五日',
		'/尚德|1461/2/10~|:明|疑|神號=八幡之按司|君主=世高王|生=明正統六年|卒=明成化五年四月二十二日',

		// 據=中山世譜/卷06
		'第二尚氏王朝/尚圓|1470/2/1~|:中國|疑|朝代=第二尚氏王統|君主=金丸|神號=金丸按司添末續之王仁子|童名=思徳金;忠徳金|生=明永樂十三年|卒=明成化十二年七月二十八日|注=父尚稷王、明宣徳九年卒。母瑞雲|注=中山世譜/卷06: 尚稷王 妃：瑞雲【童名不傳。洪武二十九年丙子生，宣徳九年甲寅二月初二日卒。葬于葉壁陵】\n康煕三十八年二月初七日，以正統王祖之重，追尊稱王，奉祀于圓覚寺宗廟。|注=天保3年11月 源直温 改編本 中山世譜: 童名：忠徳金',
		'/尚宣威|1477/1/15~|:明|疑|諡=義忠|神號=西之世主|生=明宣徳五年|卒=明成化十三年八月初四日|注=在位六個月，退隱於越來。',
		'/尚真|1477/8/9~|:明|疑|童名=眞加戸樽金|神號=於義也嘉茂慧|生=成化元年|卒=明嘉靖五年十二月十一日|注=尚宣威王在位六個月退隱',
		// 據=中山世譜/卷07;天保3年11月 源直温 改編本 中山世譜
		'/尚清|1527/2/1~|:明|疑|童名=眞仁尭樽金|神號=天續之按司添|生=明弘治十年|卒=明嘉靖三十四年六月二十五日',
		'/尚元|1556/2/11~|:明|疑|君主=久米中城王子|神號=日始按司添|生=明嘉靖七年|卒=明隆慶六年四月初一日',
		'/尚永|1573/2/2~|:明|疑|君主=日豐操王;阿應理屋恵王子|神號=英祖仁耶添按司添|生=嘉靖三十八年|卒=明萬暦十六年十一月二十五日|注=尚懿生尚寧王。【稱浦添王子】其母乃尚永王之妹，名稱首星大君加那志，號一枝【詳載附巻】時尚永王無嗣，故尚寧王奉命，入繼大統。',
		// 此後之月日部分應該參照日本的曆法？
		'/尚寜|1589/2/15~|:明|疑|童名=思徳金|神號=日賀末按司添|生=嘉靖四十三年|卒=明萬暦四十八年九月十九日|注=天保3年11月 源直温 改編本 中山世譜: 童名：思徳金|注=慶長己酉，薩州太守家久公，遣樺山權左衛門尉、平田太郎左衛門尉，率兵征伐琉球，而擒國王返。',
		// 據=中山世譜/卷08;天保3年11月 源直温 改編本 中山世譜
		'/尚豐|1621/1/22~|:明|疑|童名=思五郎金|神號=天喜也未按司添|生=萬暦十八年庚寅十一月十三日|卒=明崇禎十三年五月初四日',
		'/尚賢|1641/2/10~|:明|疑|童名=思松金|生=明天啟五年九月十五日|卒=順冶四年九月二十二日',
		'/尚質|1648/1/25~|:中國|疑|童名=思徳金|生=崇禎二年己巳八月十五日|卒=康煕七年十一月十七日',
		'/尚貞|1669/2/1~|:中國|疑|童名=思五郎金|生=順治二年乙酉十二月初六日|卒=康煕四十八年己丑七月十三日|注=尚純王以世子薨，未及即位。止以正統之重，追尊稱王。故王統圖中，不敢稱王\n世子 童名：思徳金 順治十七年庚子正月初五日降誕。',
		// 據=中山世譜/卷09
		'/尚益|1710/1/30~|:清|疑|童名=思五郎金|生=康煕十七年戊午十月二十五日|卒=大清康煕五十一年七月十五日|注=康熙己丑十一月十八日，尚益王即位。',
		'/尚敬|1713/1/26~|:清|疑|童名=思徳金|生=康煕三十九年庚辰六月十九日|卒=乾隆十六年正月二十九日',
		// 據=中山世譜/卷10
		'/尚穆|1752/2/15~|:清|準=2日|童名=思五郎金|生=乾隆四年己未三月二十六日|卒=乾隆五十九年甲寅四月初八日|注=尚哲王以世子薨，未及即位。止以正統之重，追尊稱王。故王統圖中不敢稱王\n世子 童名：恩徳金。乾隆二十四年己卯五月初六日降誕。',
		'/尚溫|1795/1/21~|:清|準=2日|童名=恩五郎金|生=乾隆四十九年甲辰二月初一日|卒=嘉慶七年七月十一日',
		'/尚成|1803/1/23~|:清|準=2日|童名=思徳金|生=嘉慶五年庚申十月十八日|卒=嘉慶八年十二月二十六日',
		// 據=中山世譜/卷11
		'/尚灝|1804/2/11~|:清|準=2日|童名=思次良金|生=乾隆五十二年丁未五月二十九日|卒=道光十四年甲午五月二十九日',
		// 據=中山世譜/卷12
		'/尚育|1835/1/29~|:清|準=2日|童名=思眞蒲戸金;思徳金|生=嘉慶十八年癸酉七月二十四日|卒=大清道光二十六年九月十七日|注=大清道光八年戊子，因尚灝王染病，世子尚育攝位。十五年乙未即位。',
		// 據=中山世譜/卷13
		'/尚泰|1848/2/5~1879/4/4|:清|準=2日|童名=思次良金|生=道光二十三年癸卯七月初八日|卒=明治34年8月19日因急性黏膜炎死於東京|注=世子尚典童名：思徳金。同治三年甲子八月初二日降誕。|注=自1876年起，琉球國廢除清朝年號，改用日本年號。|注=元来、琉球は薩摩藩の附庸国かつ清の朝貢国として一定の独自性を保っていたが、他府県の廃藩置県も済んだ翌年の1872年（同治11年、明治5年）に、日本は琉球国王尚泰を琉球藩王に封じて華族とし、東京に藩邸を与えた。そうして1879年（光緒5年、明治12年）の琉球処分により琉球藩に沖縄県が設置されると、藩王の地位は無くなり居城の首里城も出ることとなり、琉球藩は消滅した。尚泰たちは琉球王家の屋敷の一つ中城御殿に移ったが、明治政府より東京移住を命令され、華族として東京へ居を移した。|1879年4月4日日本在琉球設立沖繩縣，以鍋島直彬為第一任知事，史稱第二次琉球處分。尚泰被遷出首里城，遷往中城御殿暫時居住。日本要求舊琉球藩王尚泰前往東京，但尚泰稱病不往。5月27日，尚泰亦乘坐「明治丸」號自那霸港出發，經鹿兒島、神戶、橫濱，於6月9日至東京，會見明治天皇。',

]).minute_offset = 9 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"japan"}
(CeL.era.pass_on.countries["日本"] = [
		// Japan: 中國農曆日期和韓國農曆日期也不一致。日本從1685年開始，就自行編製農曆，一直到明治六年。

		'日本書紀|-660/2/18~|-660/=46i 59l 3qub505 3psr47m 59m 4g4o579 47m 4ok43oq 579 3qs147p 39zu42y 59h 3que47p 42y 4of659m 3quj579 47e 4ojs59m 579 3ql047o 4okc42y 591 3qu147p 42y 4o1359l 47p 3mmr46i 4oiz59m 505 3pso47m 59m 4g4l579 47m 4ok13oq 4mg959h 47p 39zq42y 59h 3qub47p 3mn047e 59m 3qug505 47e 4ojo59m 505 3qkx47o 4oka3oq 591 3qty47p 3oq 4o0y59l 3quj47p 46i 4oiw59m 47p 3psk47m 59m 3qu9579 3qsa47o 59m 4mg759h 47o 4ok342y 4off59l 47p 3mmw47e 59l 3qud505 47e 4oip59m 4g4p591 47m 4ok63oq 591 3qs347p 39zw46i 59h 3qug47p 46i 4of859m 47p 3psh47e 4oju59m 579 3qs647o 59m 4mg259h 3qu447p 42y 4ofd59l 47p 3mmt47e 59l 3qu9505 3ql647m 59m 4g4n591 47m 4ok33oq 4o1759h 47p 39zs46i 59h 3qud47p 46i 4of559m 3quh579 47e 4ojq59m 579 3qkz47o 4okc42y 591 3qu047p 42y 4o1059l 47p 3mmp46i 4oiy59m 505 3psm47m 59m 4g4j579 3qsc47p 3oq 4mg959h 47p 39zp42y 59h 3qu947p 3mmy47e 59m 3quf505 47e 4ojn59m 4g4r591 47o 4ok83oq 591 3qtx47p 3oq 4o0y59l 3qui47p 46i 4oiu59m 47p 3psj47m 4ojw59m 579 3qs847o 59m 4mg559h 47p 39zm42y 4ofe59m 47p 3mmu47e 59m 3qub505 3ql847o 59m 4g4p591 47o 4ok53oq 591 3qtt47p 39zu46i 59l 3quf47p 46i 4oir59m 3quj579 47m 4ojs59m 579 3qs547o 59m 4mg259h 3qu247p 42y 4ofa59l 47p 3mms47e 4oj059m 505 3ql447m 59m 4g4l591 47m 4ok23oq 4o1659h 47p 39zq46i 59h 3qub47p 3pss47e 59m 3quh579 47e 4ojp59m 579 3qkx47o 4oka42y 591 3qtz47p 42y 4o0z59l 3quj505 46i 4oiw59m 505 3psm47m 59m 4g4i579 3qsa47p 3oq 4mg759h 47p 39zo42y 4ofg59m 47p 3pso47e 59m 3qud579 47e 4ojm59m 4mgb591 47o 4ok742y 591 3qtv47p 3mn046i 59l 3quh505 46i 4oit59m 505 3psh47m 4oka3oq 579 3qs747p 3oq 4mg359h 3quj47p 42y 4ofd59m 47p 3mmu47e 59m 3qua505 3ql647o 59m 4g4n591 47o 4ok43oq 4o1859l 47p 39zs46i 59l 3qud47p 46i 4oiq59m 3quj579 47m 4ojr59m 579 3qs347o 4okc42y 59h 3qu147p 42y 4of959l 47p 3mmp47e 4oiz59m 505 3ql447m 59m 4g4k591 3qsc47p 3oq 4o1559h 47p 39zq46i 59h 3qua47p 3psq47e 59m 3quf579 47m 4ojo59m 4mgc59h 47o 4ok842y 59h 3qtx47p 42y 4of659l 3quj505 47e 4oiv59m 505 3qkz47m 4okc3oq 591 3qs947p 3oq 4o1159h 47p 39zm46i 4off59m 47p 3pso47e 59m 3quc579 3ql847o 59m 4mg9591 47o 4ok642y 591 3qtu47p 3mmy46i 59l 3quf505 46i 4ois59m 4g4s579 47m 4ok93oq 579 3qs547p 3oq 4mg259h 3quj47p 42y 4ofb59m 47p 3mms47e 59m 3qu9505 3ql547o 59m 4g4l591 47o 4ok23oq 4o1759l 47p 39zs46i 59l 3quc47p 3pss47m 59m 3quh579 47m 4ojq59m 579 3qs247p 39zu42y 59h 3quf47p 42y 4of859m 47p 3mmp47e 4ojt59m 505 3ql147o 59m 4g4j591 3qu347p 3oq 4o1359l 47p 39zo46i 59l 3qu947p 3psp47m 59m 3qud579 47m 4ojm59m 4mgb59h 47o 4ok842y 59h 3qtw47p 3mn047e 59l 3quh505 47e 4oiu59m 505 3qky47m 4oka3oq 591 3qs747p 3oq 4o1059h 47p 39zl46i 4ofd59m 47p 3psm47e 59m 3qub579 3ql747o 59m 4mg7591 47o 4ok442y 591 3qtt47p 3mmy46i 59l 3que505 46i 4oiq59m 4g4r579 47m 4ok83oq 579 3qs447n 39zw42y 59h 3quh47p 46i 4ofa59m 47p 3psi47e 4oju59m 579 3ql447o 59m 4mg5591 47o 4ok142y 4o1559l 47p 3mmu46i 59l 3qub505 3psr47m 59m 4g4n579 47m 4ok43oq 579 3qs147p 39zu42y 59h 3que47p 42y 4of659m 3quj505 47e 4ojs59m 505 3ql047o 4okc3oq 591 3qu147p 3oq 4o1259l 47p 39zn46i 4oiz59m 47p 3pso47m 59m 3qud579 47m 4ojl59m 4mg959h 47o 4ok642y 59h 3qtv47p 3mmz47e 59l 3quf505 47e 4ois59m 505 3qkx47m 4oka3oq 591 3qs647p 3oq 4o0y59h 3quj47p 46i 4ofc59m 47p 3psk47m 59m 3qu9579 3qsa47o 59m 4mg759h 47o 4ok342y 4off59l 47p 3mmw47e 59l 3qud505 47e 4oip59m 4g4p591 47m 4ok63oq 591 3qs347p 39zv46i 59h 3quf47p 46i 4of859m 47p 3psh47e 4oju59m 579 3ql247o 59m 4mg2591 3qu447p 42y 4o1459l 47p 3mms46i 59l 3qu9505 3psq47m 59m 4g4n579 47m 4ok33oq 4mgb59h 47p 39zs42y 59h 3qud47p 42y 4of559m 3quh505 47e 4ojq59m 505 3qkz47o 4okc3oq 591 3qu047p 3oq 4o1059l 47p 39zm46i 4oiy59m 47p 3psm47m 59m 3qub579 3qsc47p 3oq 4mg859h 47p 39zo42y 59h 3qu947p 3mmy47e 59m 3quf505 47e 4ojn59m 4g4r591 47o 4ok83oq 591 3qtx47p 3oq 4o0x59l 3quh47p 46i 4oiu59m 47p 3psj47m 4ojw59m 579 3qs847o 59m 4mg559h 47o 4ok242y 4ofe59l 47p 3mmu47e 59l 3qub505 3ql847m 59m 4g4o591 47m 4ok53oq 591 3qs147p 39zu46i 59h 3quf47p 46i 4of759m 3quj579 47e 4ojs59m 579 3ql147o 59m 4mg1591 3qu147p 42y 4o1359l 47p 3mms46i 4oj059m 505 3pso47m 59m 4g4l579 47m 4ok23oq 4mga59h 47p 39zq46i 59h 3qub47p 3pss47e 59m 3quh579 47e 4ojp59m 579 3qkx47o 4oka42y 591 3qtz47p 42y 4o0z59l 3quj505 46i 4oiw59m 505 3psl47m 59m 4g4h579 3qsa47p 3oq 4mg759h 47p 39zo42y 4ofg59m 47p 3mmw47e 59m 3qud505 47e 4ojm59m 4g4q591 47o 4ok63oq 591 3qtv47p 39zw46i 59l 3quh47p 46i 4oit59m 47p 3psh47m 4oju59m 579 3qs747o 59m 4mg359h 3qu447p 42y 4ofd59l 47p 3mmu47e 59l 3qua505 3ql647m 59m 4g4n591 47m 4ok43oq 4o1859h 47p 39zs46i 59h 3qud47p 42y 4of659m 3qui505 47e 4ojq59m 505 3qkz47o 4okc42y 591 3qu147p 42y 4o1159l 47p 3mmp46i 4oiz59m 505 3psn47m 59m 4g4j579 3qsc47p 3oq 4mg959h 47p 39zp42y 59h 3qu947p 3mmy47e 59m 3quf505 47e 4ojo59m 4g4s591 47o 4ok83oq 591 3qtx47p 3oq 4o0y59l 3qui47p 46i 4oiu59m 47p 3psj47m 4ojw59m 579 3qs947p 3oq 4mg559h 47p 39zm42y 4off59m 47p 3mmv47e 59m 3qub505 3ql847o 59m 4g4p591 47o 4ok53oq 591 3qtt47p 39zu46i 59l 3quf47p 46i 4ois59m 3quk579 47m 4ojs59m 579 3qs547o 59m 4mg259h 3qu247p 42y 4ofa59l 47p 3mms47e 4oj059m 505 3ql447m 59m 4g4l591 47o 4ok23oq 4o1759l 47p 39zr46i 59l 3qub47p 3pss47m|傳說|參照用|注=base: 日本書紀暦日原典 (内田正男)',
		// 旧暦 1947閏月: HuTime != こよみのページ.
		// http://www.hutime.jp/basicdata/calendar/calendars/OldJapanese.html
		// HuTime: 神宮司廳 『神宮暦』（小暦）
		// （昭和24年～）昭和22年は、新暦4月21日同日に朔（13時19分）、中気（穀雨）（7時40分）があります。通常、朔と中気が同日の場合は時刻の前後にかかわらず新たな朔望月に中気が入れられるため、2月、閏2月の順で、新暦4月21日からの朔望月は3月となります。しかしながら、この年は例外的に中気（穀雨）を前の朔望月に入れ、2月、3月の順で、新暦4月21日からの朔望月を閏3月としています（大暦、小暦とも同じ）。通常とは異なりますが、『神宮暦』の表記に従います。
		'旧暦|593/2/7~2071/1/30|593/=59m 3quh579 47m 4ojp59m 579 3qs147o 4oka42y 59h 3qtz47p 42y 4of759l 3quj505 47e 4oiw59m 505 3ql147m 59m 4g4i591 3qsa47p 3oq 4o1359h 47p 39zo46i 4ofg59m 47p 3pso47e 59m 3qud579 47e 4ojm59m 4mgb59h 47o 4ok742y 59h 3qtv47p 3mn047e 59l 3quh505 47e 4oit59m 505 3qkx47m 4oka3oq 591 3qs747p 3oq 4o0z59h 3quj47p 46i 4ofd59m 47p 3psm47e 59m 3qua579 3ql647o 59m 4mg7591 47o 4ok442y 4o1859l 47p 3mmw46i 59l 3qv9505 46i 4oiq59l 4mu44h0 5es 3t6v52s 506 3pt04zu 5s9 3z4h4i0 4t943u1 3p1 31li3me 576 55425sh 408b4ia 3u2 3a93439 42u 4nys59g 5uq 408x4i4 3rd550q 46t 3mmu47e 5d0 4uqb4a0 4pln3px 3fu 4g4n579 47e 4sgz5e9 49w 4ppd3q1 38ex42y 591 3x3p4gy 5ea 3t4z4aa 3b6247u 42y 4o145r9 4h0 4t505ed 33x83hw 50a 4f3e4zu 5s9 3z864i8 5ew 4ihf3p0 4mh7592 56y 55485eq 44x 3bid5ew 59x 380h3o6 4o0p59e 5t0 3tz95as 48a 3a1v4vp 3d1747e 5e0 57d35uw 5as 3ret50q 505 3qkx4ei 4sh65e9 4a8 4pom5at 3n0 4mg258z 3yos4gy 5ea 3t534ac 449 3mn842y 59h 3fpt4h0 43ux5es 52s 3qzb3fe 4zu 42ar5s9 3xng4i0 4mg 4ihj3p0 57e 4m7958y 5s9 400h4i9 3ep53u1 3p1 37x342t 58y 55b75uq 40984ic 48a 3mw84z9 46g 5dp05dw 5us 40aq5as 3rca50q 46l 3mly47d 4h0 4upv5go 4ja43p0 50a 4g4o578 5s8 5elg4lt 3vt 3b1e3px 38ey42y 591 3qs749u 5ea 3rcz48i 3b1n47p 46i 4oft3t0 5us 4pl15es 48k 3npd505 3psq47e 5s9 3swm4aw 5bc 4gwj3os 4mho3o5 58y 55bc5e9 4b5 3bj93u2 3ot 37wy42t 4nyy59g 5gi 3txi4b8 48a 3mw44z9 3prw47d 5ac 4uq05go 5as 4gnp3fu 505 3psh47e 4shn3tf 3hl 3b1j3px 3my 4mgz591 3sd84gy 5ea 3t534aa 449 3mmt42y 59h 3z2p4h0 4t555es 4ac 3qyv506 46i 54835s9 3z8c4i9 3u0 4ihk3p0 57a 4fv958y 5sh 400i4i9 3ep648i 3p1 380n42t 58y 55c35uq 40985as 48a 3mw8505 46i 4oet5dw 5us 40aq5as 4gnu3oq 505 3ql34ga 5e1 3swj4a1 3b4s3q1 3oq 4mg9591 4gi 4so55ea 4aa 3b4y449 3mmy46i 5np 3z2u4h0 5es 3t504ac 3qz0506 46i 54895s9 4h4 4t515ew 52s 4g8y57a 4fve58y 5sh 400m4i9 3u1 33xg3p1 39lo42t 590 55c95uq 4ia 3rd148a 439 3mmp46i 4oga5dw 5us 4pl35as 50q 4fc3505 3ql847e 5e1 3swo4a1 3px 32513oq 579 3qkx4gi 4sp65ea 4aa 3b53449 42y 4o105np 3z304h0 5es 3t6w52s 44a 3mna4zu 5r9 3z4i4i0 4t963u0 52s 4g9j3mi 577 3qk347l 4i9 3eoh3u1 3a953p1 3oa 4mg5590 5ua 40824ia 3rd648a 439 3mmv46i 59g 57b75uw 5as 3rcx50q 4g4p579 47e 4sdh5e1 4a0 4poy3q1 32563oq 579 3qs74gi 5e9 3t444aa 3b5847u 42z 39h546d 4gy 4sp15es 4ac 3nsy50a 3mp64zv 46h 3z4m4i0 5ew 4ih059w 4g9o3mi 577 3ql547l 4i9 3eol3u1 3p1 380i3oq 4o2259g 5ua 40874ic 48a 3a90445 3mn046i 59h 3st54a0 5as 3rd250q 505 3psi47e 4si25e1 4a0 4pp33qh 3ho 4g4k579 3wws4gi 5e9 3t484b6 3q1 3a1y431 3o5 4nyq4gy 4t3e5gk 4b8 3nt350a 431 3mic47d 4h0 4t4x5go 4ih559w 50a 4f52577 47d 400i4i9 3eq2489 3p1 380n3oq 591 3qs349u 4i9 3rcx48a 3a95445 42y 4o125d1 49w 4pky5as 3rm252k 505 3pzr47e 5e1 3swk4a0 4q3g3qh 3os 4g5l591 576 4sh15e9 4b5 3bj73qh 3a2y431 3o5 4nyv59e 5eq 3txg4b8 48a 3mox46l 3mjd47d 59g 4upx5go 53o 3rcz50a 4g5m579 47d 4pav4lt 3vs 4plg3px 38f042y 591 3qsa49u 4lt 3sxy48i 3px 39zm42y 4o225d1 4h0 4pl35b8 48k 3npg505 3pss47e 5s9 3z9k4aw 5bc 4ihi3os 506 4fv758y 558q47l 4b5 3bjb3u1 3p1 37x142t 58y 55c15gi 3txl4b8 48a 3mw646l 46h 4oeq59g 4uru4a0 5as 3rk750q 505 3psk47d 5e1 3g9e4a0 4pll3px 3my 4mg6591 49e 4so25e9 3t564aa 3q1 3a6v42y 59h 3yok4h0 5ec 3t4x4ac 3nt5506 46i 54865s9 4h4 4t4z5ew 4iiy438 506 4g2f58y 5s9 400k4i9 3u1 3a8x3p1 37x542t 58y 55c55uq 4b6 3epv48a 3mx6505 46i 4opz5ac 5us 40as5as 50q 3mw1505 3psq47e 5e1 3swm4a0 5as 4gnn3oq 4mh6591 4gi 4so75e9 4aa 3b51449 3oq 4o0x59h 3z2y4h0 5es 3t524ac 47u 3mn746i 548b5s9 4h4 4t933u0 52s 4g9157a 4zu 55415sh 40214i9 3u1 3a923p1 3mi 4mdu58y 55fu49u 4ia 3eq048a 439 3mms46i 59g 57b55us 40ax5as 50q 4c6e505 47e 4of65e1 3sy24a0 5ax 32543oq 56d 3ql14gi 5e9 3swx4aa 3b61449 42y 4o135np 4gy 4soz5es 3t574ac 47u 3mnc46i 5r9 3z4k4i0 5ew 3t6q52s 4g9m3mi 4zv 3qjq5sh 4i0 4t8z3u1 3a973p1 3oa 4mg8590 5ua 40844ia 48a 3a8y439 3mmy46i 59g 57ba5us 5as 3rcz50q 4g4r505 47e 4rl55e1 4a0 4plh3q1 3fw 4g4h579 3ql64gi 5e9 3sx24aa 3q1 3a1f42z 39gr5r9 4gy 4sp35es 4ac 3nt147u 431 3mi946d 3z624i0 5ew 3t6u59w 50a 4f4z577 3qjw5sh 4i8 4t943u1 3p1 31p13oq 579 3qkh5ua 408b4ia 48a 3a93439 42y 4o0z59h 49u 408x5as 3rd450q 505 3psl47e 5dx 3ssx4a0 4pp53q1 3ho 4g4n579 47e 4sgz5e9 3t4b4b6 3q1 3a20431 3o5 4nys4gy 5ea 3txe4b8 3nt647u 431 3mie46h 4h0 4t4z5go 4ih859w 50a 4f54577 47d 400k4i9 3u0 4osy3p1 31p63oq 591 3qrr5ua 4i9 3eoz48a 3a97445 42y 4o155d1 49u 4pj95as 48i 3noh505 3psq47e 5e1 3st24a0 5bc 4gwk3ho 4g5o579 4ei 4sh45e9 4b5 3bj93qh 3ot 37wy3o5 4nyy59e 5eq 3txi4b8 48a 3mp0431 3mik47d 59g 4uq05go 53o 3rd150a 579 3qkz4gi 5e9 3swh4aa 3b5444a 3ot 37w542t 4gi 4soy5es 3t6x4ac 47u 3mp44yz 46d 3z4k4i0 5ew 3t6p52s 4g9k3fe 4zv 3qjp5s9 4i0 4t8y3u1 3a963p1 3mi 4mg7591 49e 40844ia 48a 3a8x439 3mmx46i 59h 3sr949w 5as 3rcz50s 4c6j505 46i 4rl35e1 4a0 4pok5ax 32583os 579 4fve4gi 5e9 3sx24aa 3q1 38gy3ot 39h742t 4gy 4sp35es 4ac 3b5w47u 3mp84yz 46d 4oex4i0 5ew 3t6u59w 50a 4f4z505 3qkc47l 4i9 3eon3u1 3p1 31p13oq 579 3qkx49e 4pii4ia 48a 3a92439 42y 4o0y59h 3srf49w 5as 3rlz50s 4wm 3mms47e 5dx 3ssx4a0 4q3c3qh 3fw 4g5y3md 56y 55425e9 3twr4b6 3qi 3a20431 3o6 4nys59e 5ea 3txd4b8 3eq047u 431 3mja46h 59g 55s35go 3tzf5as 50q 4fc7579 47e 4pb85e9 3vs 4pld3px 323d3oq 579 3ql149e 5e9 3sx04a2 3px 38eq42y 4o135d1 4gy 4sp15es 4ac 3nsz506 3mmw4zu 5s5 3z4l4aw 5bc 4ihg3hw 4g623me 56y 55465sh 4b5 3bj93u2 3p1 37wz3o6 4nyv59e 5sy 3txh4b8 48a 3a90439 3mn046h 59g 57d25uw 5as 3rd150q 4z9 3psj47e 4sh45e9 4a0 4plh3px 3fu 4g4k579 47m 4sgy5e9 3t464aa 3q2 38f942y 591 3yoi4gy 4sp35es 4ac 3nt1506 46j 3mhw5s9 4h0 4t4y5ew 4ihi3hx 3fe 4f3956y 5s9 3z834i9 3ep33u2 3p1 380m42e 58y 55c45uq 4ia 3epv48a 3a93439 42y 4o115d0 5us 40ar5as 3rd450q 505 3psm47e 5e1 3swk4a0 5aw 4gpf3my 4g4n591 4eq 4so55e9 4a9 3b503q2 3a0842z 3o5 3yom4h0 5es 3t504ac 3nt650a 4yz 3mhy5s9 4h0 4t515ew 52s 4g9f3fe 4f3c576 5s9 400l4i9 3u1 33xg3p1 3mi 4mg258z 3qrr5uq 4ia 3epx48a 439 3knn42y 4ofd5dx 49w 4pl15as 48a 3mw4505 46i 4of65e1 3swm4a0 5aw 4gph3n0 579 3qkz4gi 4sob5e9 4aa 3b523q2 3ot 37w542d 4gi 4soy5es 3t6v4ac 44a 3mp14yz 46d 3z4j4h4 4t545ew 52s 4g9i3fe 4zx 3pro47d 4i0 4t8z3u1 3a933p1 3mi 4mg5591 47m 40844ia|參照用|注=和暦(邦暦):旧暦+新暦。和暦(わごよみ)は、明治5年12月2日以前は旧暦、明治6年1月1日以降は新暦です。|注=base: 日本暦日原典 (内田正男)',

		// 日本史時代区分表

		// http://www.kunaicho.go.jp/ryobo/successive_list.html

		// 正字体
		// 読み: よみがな
		'縄文時代/神武天皇|日本書紀-660~|:日本書紀|傳說|時期=神話時代|読み=じんむてんのう|諡=神武天皇|生=庚午年1月1日 (-711/2/13, 平朔儀鳳暦, 魯桓公1年2月1日)|注=辛酉年春正月庚辰朔。天皇即帝位於橿原宮。...七十有六年春三月甲午朔甲辰。天皇崩于橿原宮。',
		'/綏靖天皇|日本書紀-581~|:日本書紀|傳說|読み=すいぜいてんのう|諡=綏靖天皇',
		'/安寧天皇|日本書紀-548~|:日本書紀|傳說|読み=あんねいてんのう',
		'/懿德天皇|日本書紀-510~|:日本書紀|傳說|読み=いとくてんのう|諡=懿徳天皇',
		'弥生時代/孝昭天皇|日本書紀-475~|:日本書紀|傳說|時期=神話時代|読み=こうしょうてんのう',
		'/孝安天皇|日本書紀-392~|:日本書紀|傳說|読み=こうあんてんのう',
		'/孝靈天皇|日本書紀-290~|:日本書紀|傳說|読み=こうれいてんのう|諡=孝霊天皇',
		'/孝元天皇|日本書紀-214~|:日本書紀|傳說|読み=こうげんてんのう',
		'/開化天皇|日本書紀-157~|:日本書紀|傳說|読み=かいかてんのう',
		'/崇神天皇|日本書紀-97~|:日本書紀|傳說|読み=すじんてんのう|諡=崇神天皇',
		'/垂仁天皇|日本書紀-29~|:日本書紀|傳說|読み=すいにんてんのう',
		'/景行天皇|日本書紀71~|:日本書紀|傳說|読み=けいこうてんのう',
		'/成務天皇|日本書紀131~|:日本書紀|傳說|読み=せいむてんのう',
		'/仲哀天皇|日本書紀192~|:日本書紀|傳說|読み=ちゅうあいてんのう',
		'/神功皇后|日本書紀201~|:日本書紀|傳說|君主性別=女|読み=じんぐうこうごう|諡=神功皇后|君主性別=女|注=日本書紀: 神功皇后摂政(じんぐうこうごうせっしょう)',
		// 大和時代は古墳時代と飛鳥時代を合わせた時代と言い換えることもできる。厳密には大和時代は弥生時代末期を含み、また飛鳥時代は古墳時代末期でもある。
		'古墳時代/應神天皇|日本書紀270~|:日本書紀|傳說|時期=大和時代|読み=おうじんてんのう|諡=応神天皇;應神天皇',
		'/仁德天皇|日本書紀313~|:日本書紀|傳說|読み=にんとくてんのう;仁徳天皇',
		'/履中天皇|日本書紀400~|:日本書紀|傳說|読み=りちゅうてんのう',
		'/反正天皇|日本書紀406~|:日本書紀|傳說|読み=はんぜいてんのう',
		'/允恭天皇|日本書紀412~|:日本書紀|傳說|読み=いんぎょうてんのう',
		'/安康天皇|日本書紀454~|:日本書紀|傳說|読み=あんこうてんのう',
		// 雄畧天皇: 本朝通鑑 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/雄畧天皇|日本書紀457~|:日本書紀|傳說|読み=ゆうりゃくてんのう|君主=雄略天皇',
		'/清寧天皇|日本書紀480~|:日本書紀|傳說|読み=せいねいてんのう|諡=淸寧天皇|注=在清寧天皇崩御後，飯豐青皇女曾短暫執政，被稱為忍海飯豐青尊，但她並沒有被列為正式的天皇。飯豊天皇とも呼ばれる。『日本書紀』によれば、執政期間は短くわずか10箇月余りで、清寧天皇5年11月に薨去',
		// 顕宗天皇: 本朝通鑑 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/顕宗天皇|日本書紀485~|:日本書紀|傳說|読み=けんぞうてんのう|諡=顯宗天皇',
		'/仁賢天皇|日本書紀488~|:日本書紀|傳說|読み=にんけんてんのう',
		'/武烈天皇|日本書紀499~|:日本書紀|傳說|読み=ぶれつてんのう',

		// <a
		// href="https://ja.wikipedia.org/wiki/%E5%9B%BD%E5%8F%B7#.E6.97.A5.E6.9C.AC.E3.81.AE.E5.9B.BD.E5.8F.B7"
		// accessdate="2013/4/1 23:41">日本の国号</a>
		// 継體天皇: 本朝通鑑 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/継體天皇|日本書紀507~|:日本書紀|読み=けいたいてんのう|君主=繼體天皇|諡=継体天皇|國號=日本國;日本国',
		'/安閑天皇|日本書紀534~|:日本書紀|注=在位：531年3月10日?〈継体天皇25年2月7日〉 - 536年1月25日?〈安閑天皇2年12月17日〉',
		'/宣化天皇|日本書紀536~|:日本書紀',
		'/欽明天皇|日本書紀540~|:日本書紀',
		'/敏達天皇|日本書紀572~|:日本書紀|諡=敏達天皇',
		'/用明天皇|日本書紀586~|:日本書紀',
		'/崇峻天皇|日本書紀588~|:日本書紀',
		'飛鳥時代/崇峻天皇|日本書紀592~|5/=:日本書紀|時期=大和時代|注=飛鳥時代は崇峻天皇5年（592年）から和銅3年（710年）の118年間にかけて飛鳥に宮・都が置かれていた時代を指す。',

		'/推古天皇|旧暦593~|:旧暦|君主性別=女|注=在位：593/1/15~628/4/15',
		'/舒明天皇|旧暦629~|:旧暦|注=在位：629/2/2~641/11/17',
		'/皇極天皇|旧暦642~|:旧暦|君主性別=女|注=在位：642/2/19~645/7/12|諱=寶女王;宝皇女|注=皇極天皇、重祚して斉明天皇',
		'/孝德天皇|645/7/12~|:旧暦|諡=孝徳天皇',
		'/=/大化|645/7/17~|:旧暦|読み=たいか|注=654年10月10日～686年7月20日、686年9月9日～701年3月21日：元号は定められませんでした。',
		'/白雉|650/3/22~|:旧暦|読み=はくち',
		'=/齊明天皇|旧暦655~|:旧暦|君主性別=女|諡=斉明天皇|注=在位：655/2/14~661/8/24|注=皇極天皇、重祚して斉明天皇',
		'/天智天皇|旧暦662~|:旧暦|注=在位：668/2/20~672/1/7|注=斉明天皇崩御（661年）後に即日中大兄皇子は称制して暦が分かりにくくなっているが、日本書紀では越年称元（越年改元とも言う）年代での記述を採用しているため、崩御翌年（662年）が天智天皇元年に相当する。',
		'/弘文天皇|旧暦672~|:旧暦|注=在位：672/1/9-672/8/21|君主=大友皇子',
		'/天武天皇|672/8/21~|:旧暦|注=在位：673/3/20-686/10/1',
		'/=/朱鳥|686/8/14~|:旧暦|読み=しゅちょう、すちょう、あかみとり',
		'=/=|686/10/2~|15/=:旧暦|注=在位：673/3/20-686/10/1',
		'/持統天皇|旧暦687~|:旧暦|君主性別=女|注=在位：690/2/14-697/8/22',
		'/文武天皇|697/8/22~|:旧暦|注=在位：697/8/22-707/7/18',
		'/=/大寶|701/5/3~|:旧暦|元号=大宝|読み=たいほう、だいほう',
		'/慶雲|704/6/16~|:旧暦|読み=けいうん、きょううん',
		'=/元明天皇/=|旧暦707~|4/=:旧暦|君主性別=女|読み=げんめい|注=在位：707/8/18-715/10月3日',
		'/和銅|708/2/7~|:旧暦|読み=わどう',

		'奈良時代/=/=|710/4/13~|3/=:旧暦|朝代=平城時代|注=710年（和銅3年）3月10日 (旧暦)に遷都',
		'/元正天皇/靈龜|715/10/3~|:旧暦|君主性別=女|元号=霊亀',
		'/養老|717/12/24~|:旧暦|注=[http://www.u4ren6.com/Moritsune/Moritsune.html 古代の暦]: 養老7年7月之 續日本紀 記載朔閏或早實曆1日，例如載甲子朔，實曆為乙丑朔；造成記載7月7日，實為7月6日。甚且這種前後差一日恐非偶發現象(安萬侶墓碑「養老七年十二月十五日乙巳」と建碑)，而是當時常發生之問題。是以史書不能確信為實曆。',
		'/聖武天皇/神龜|724/3/3~|:旧暦|元号=神亀',
		'/天平|729/9/2~|:旧暦',
		'/天平感寶|749/5/4~|:旧暦|元号=天平感宝',
		// TODO: 在本朝通鑑 https://dl.ndl.go.jp/info:ndljp/pid/771553
		// 中為 A03873-002 @
		// https://dict.variants.moe.edu.tw/variants/rbt/word_attribute.rbt?quote_code=QTAzODcz
		// @see https://zi-hi.com/sp/uni/2E639
		'/孝謙天皇/天平勝寶|749/8/19~|:旧暦|君主性別=女|元号=天平勝宝',
		'/=|755/2/19~|7/1/4=:旧暦|元号=天平勝宝|年名=歳|注=天平勝寶7年1月4日(755/2/19)、勅命により「年」が「歳」に改められた。このため以後は、天平勝寶七歳・天平勝寶八歳・天平勝寶九歳と表記されたが、天平寶字へ改元した際に「歳」を「年」へ復している。',
		'/天平寶字|757/9/6~|:旧暦|元号=天平宝字',
		'/淳仁天皇/=|758/9/7~|2/=:旧暦',
		'/稱德天皇/=|764/11/6~|8/=:旧暦|君主性別=女|諡=称徳天皇|注=孝謙天皇（こうけんてんのう）、重祚して称徳天皇（しょうとくてんのう；稱德天皇）',
		'/天平神護|765/2/1~|:旧暦|注=称徳天皇重祚による改元',
		// HuTime != 上綱秀治
		'/神護景雲|767/9/13~|:旧暦|注=一説神護景雲二年四月乙亥朔。(上綱秀治)|注=除上綱秀治の月の大小、[http://miko.org/~uraki/kuon/furu/text/syokki/syokki29.htm#skk29_02 新編 續日本紀 卷廿九　稱德天皇 高野天皇] "夏四月,乙亥朔戊寅"；餘皆為甲戌朔。如: [http://www.j-texts.com/jodai/shokuall.html 昭和15年朝日新聞社発行『増補　六国史』]；[http://dl.ndl.go.jp/info:ndljp/pid/991092 経済雑誌社 編	国史大系. 第２巻　続日本紀(1897-1901)]。',
		'/光仁天皇/寶龜|770/10/23~|:旧暦|元号=宝亀',
		'/天應|781/1/30~|:旧暦|元号=天応',
		'/桓武天皇/=|781/4/30~|:旧暦|注=在位:781/4/30-806/4/9',
		// HuTime != 上綱秀治
		'/延暦|782/9/30~|:旧暦|注=桓武天皇践祚による改元|注=一説桓武天皇延暦十三年五月癸酉朔。(HuTime)|注=[http://www.j-texts.com/chuko/koukiall.html 『日本後紀』朝日新聞本]\n《卷二逸文（『類聚國史』七三五月五日）延暦十三年（七九四）五月丁丑【六】》○五月丁丑。停馬射。以發大軍也。宴侍臣賜禄。\n《卷二逸文（『類聚國史』一六五烏）延暦十三年（七九四）五月乙未【廿四】》○乙未。甲斐國獻白烏二。\n《卷二逸文（『日本紀略』）延暦十三年（七九四）五月己亥【廿七】》○己亥。皇太子妃諱帶子、忽有病。移木蓮子院、頓逝。|注=[http://miko.org/~uraki/kuon/furu/text/kouki/kouki02.htm#kou02_05 新編 日本後紀卷第二　桓武天皇　日本根子皇統彌照天皇《逸文》]\n五月,壬申朔丁丑,停馬射.以發大軍也.宴侍臣,賜祿. 類聚國史73五月五日',

		'平安前期/=/=|794/11/19~|13/=:旧暦|時期=平安時代|注=十三年十月廿三日。天皇自南京、遷北京。',
		'/平城天皇/=|806/4/9~|25/=:旧暦|注=在位:806/4/9-809/5/18',
		'/大同|806/6/8~|:旧暦',
		'/嵯峨天皇/=|809/5/18~|4/=:旧暦|注=在位:809/5/18-823/5/29',
		'/弘仁|810/10/20~|:旧暦',
		'/淳和天皇/=|823/6/9~|14/=:旧暦|注=在位:823/6/9-833/3/22',
		'/天長|824/2/8~|:旧暦',
		'/仁明天皇/=|833/3/30~|10/=:旧暦|注=在位:833/3/30-850/5/4',
		'/承和|834/2/14~|:旧暦',
		'/嘉祥|848/7/16~|:旧暦',
		'/文德天皇/=|850/5/31~|3/=:旧暦|諡=文徳天皇|注=在位:850/5/31-858/10/7',
		'/仁壽|851/6/1~|:旧暦|元号=仁寿',
		'/齊衡|854/12/23~|:旧暦|元号=斉衡',
		'/天安|857/3/20~|:旧暦',
		'/清和天皇/=|858/12/15~|2/=:旧暦|諡=淸和天皇|注=在位:858/12/15-876/12/18',
		'/貞觀|859/5/20~|:旧暦|元号=貞観',
		'/陽成天皇/=|876/12/18~|18/=:旧暦|注=在位:876/12/18-884/3/4',
		'/元慶|877/6/1~|:旧暦',
		'/光孝天皇/=|884/3/23~|8/=:旧暦|注=在位:884/3/23-887/9/17',
		'/仁和|885/3/11~|:旧暦',
		'/宇多天皇/=|887/9/17~|3/=:旧暦|注=在位:887/9/17-897/8/4',
		'/寬平|889/5/30~|:旧暦|元号=寛平',
		'/醍醐天皇/=|897/8/14~|9/=:旧暦|注=在位:897/8/14-930/10/16',
		'/昌泰|898/5/20~|:旧暦|注=4月16日（5月10日）、8月16日（9月5日）の説もある。',
		'/延喜|901/8/31~|:旧暦',
		'平安中期/=/延長|923/5/29~|:旧暦|時期=平安時代',
		'/朱雀天皇/=|930/12/14~|8/=:旧暦|注=在位:930/12/14-946/5/16',
		'/承平|931/5/16~|:旧暦',
		'/天慶|938/6/22~|:旧暦',
		'/村上天皇/=|946/5/31~|9/=:旧暦|注=在位:946/5/31-967/7/5',
		'/天暦|947/5/15~|:旧暦',
		'/天徳|957/11/21~|:旧暦',
		'/應和|961/3/5~|:旧暦',
		'/康保|964/8/19~|:旧暦',
		'/冷泉天皇/=|967/11/15~|4/=:旧暦|注=在位:967/11/15-969/9/27',
		'/安和|968/9/8~|:旧暦',
		'/圓融天皇/=|969/11/5~|2/=:旧暦|諡=円融天皇|注=在位:969/11/5-984/9/24',
		'/天祿|970/5/3~|:旧暦|元号=天禄',
		'/天延|974/1/16~|:旧暦',
		'/貞元|976/8/11~|:旧暦',
		'/天元|978/12/31~|:旧暦',
		'/永觀|983/5/29~|:旧暦|元号=永観',
		'/花山天皇/=|984/11/5~|2/=:旧暦|注=在位:984/11/5-986/8/1',
		'/寬和|985/5/19~|:旧暦|元号=寛和',
		// http://www.kunaicho.go.jp/ryobo/guide/066/
		'/一條天皇/=|986/8/1~|2/=:旧暦|読み=いちじょうてんのう|諡=一条天皇|注=在位:986/8/1-1011/7/16',
		'/永延|987/5/5~|:旧暦',
		'/永祚|989/9/10~|:旧暦',
		'/正暦|990/11/26~|:旧暦',
		'/長德|995/3/25~|:旧暦|元号=長徳',
		'/長保|999/2/1~|:旧暦',
		'/寛弘|1004/8/8~|:旧暦',
		'/三條天皇/=|1011/7/16~|8/=:旧暦|諡=三条天皇|注=在位:1011/7/16-1016/3/10',
		'/長和|1013/2/8~|:旧暦',
		'/後一條天皇/=|1016/3/18~|5/=:旧暦|諡=後一条天皇|注=在位:1016/3/18-1036/5/15',
		'/寬仁|1017/5/21~|:旧暦|元号=寛仁',
		'/治安|1021/3/17~|:旧暦',
		'/萬壽|1024/8/19~|:旧暦|元号=万寿',
		'/長元|1028/8/18~|:旧暦',
		'平安後期/後朱雀天皇/=|1036/5/15~|9/=:旧暦|時期=平安時代|注=在位:1036/5/15-1045/2/5',
		'/長暦|1037/5/9~|:旧暦',
		'/長久|1040/12/16~|:旧暦',
		'/寬德|1044/12/16~|:旧暦|元号=寛徳',
		'/後冷泉天皇/=|1045/2/5~|2/=:旧暦|注=寛徳2/1/16（1045/2/5）、後一条天皇が譲位。寛徳2年（1045年）4月8日、即位。',
		'/永承|1046/5/22~|:旧暦',
		'/天喜|1053/2/2~|:旧暦',
		'/康平|1058/9/19~|:旧暦',
		'/治暦|1065/9/4~|:旧暦',
		'/後三條天皇/=|1068/5/22~|4/=:旧暦|諡=後三条天皇|注=在位:1068/5/22-1073/1/18',
		'/延久|1069/5/6~|:旧暦',
		'/白河天皇/=|1073/1/18~|4/=:旧暦|注=在位:1073/1/18-1087/1/3',
		'/承保|1074/9/16~|:旧暦',
		'/承暦|1077/12/5~|:旧暦',
		'/永保|1081/3/22~|:旧暦',
		'/應德|1084/3/15~|:旧暦|元号=應徳',
		'/堀河天皇/=|1087/1/26~|3/=:旧暦|注=在位:1087/1/3-1107/8/9',
		'/寬治|1087/5/11~|:旧暦|元号=寛治',
		'/嘉保|1095/1/23~|:旧暦',
		'/永長|1097/1/3~|:旧暦',
		'/承德|1097/12/27~|:旧暦|元号=承徳',
		'/康和|1099/9/15~|:旧暦',
		'/長治|1104/3/8~|:旧暦',
		'/嘉承|1106/5/13~|:旧暦',
		'/鳥羽天皇/=|1107/8/9~|2/=:旧暦|諡=鳥羽天皇|注=在位:嘉承2/7/19（1107/8/9）-保安4年正月28日（1123/2/25）',
		'/天仁|1108/9/9~|:旧暦',
		'/天永|1110/7/31~|:旧暦',
		'/永久|1113/8/25~|:旧暦',
		'/元永|1118/4/25~|:旧暦',
		'/保安|1120/5/9~|:旧暦',
		'/崇德天皇/=|1123/2/25~|4/=:旧暦|諡=崇徳天皇|注=在位:旧暦1123/1/28-1141/12/7',
		'/天治|1124/5/18~|:旧暦',
		'/大治|1126/2/15~|:旧暦',
		'/天承|1131/2/28~|:旧暦',
		'/長承|1132/9/21~|:旧暦',
		'/保延|1135/6/10~|:旧暦',
		'/永治|1141/8/13~|:旧暦',
		'/近衞天皇/=|1142/1/5~|:旧暦|諡=近衛天皇|注=在位:在位:永治元年12月7日（1142/1/5）-久寿2/7/23（1155/8/22）',
		'/康治|1142/5/25~|:旧暦',
		'/天養|1144/3/28~|:旧暦',
		'/久安|1145/8/12~|:旧暦',
		'/仁平|1151/2/14~|:旧暦',
		'/久壽|1154/12/4~|:旧暦|元号=久寿',
		'/後白河天皇/=|1155/8/23~|2/=:旧暦|注=在位：久寿2/7/24（1155/8/23）-保元3/8/11（1158/9/5）',
		'/保元|1156/5/18~|:旧暦',
		'/二條天皇/=|1158/9/5~|3/=:旧暦|諡=二条天皇|注=在位：保元3/8/11（1158/9/5）-永万元年6月25日（1165/8/3）',
		'/平治|1159/5/9~|:旧暦',
		'/永暦|1160/2/18~|:旧暦',
		'/應保|1161/9/24~|:旧暦',
		'/長寬|1163/5/4~|:旧暦|元号=長寛',
		'/永萬|1165/7/14~|:旧暦|元号=永万',
		'/六條天皇/=|1165/8/3~|:旧暦|諡=六条天皇|注=在位:永万元年6月25日（1165/8/3）-仁安3/2/19（1168/4/9）',
		'/仁安|1166/9/23~|:旧暦',
		'/高倉天皇/=|1168/4/9~|3/=:旧暦|注=在位：仁安3/2/19（1168/4/9）-治承4/2/21（1180/3/18）',
		'/嘉應|1169/5/6~|:旧暦',
		'/承安|1171/5/27~|:旧暦',
		'/安元|1175/8/16~|:旧暦',
		'/治承|1177/8/29~|:旧暦',
		'/安德天皇/=|1180/5/18~|4/=:旧暦|諡=安徳天皇|注=在位：治承4/4/22（1180/5/18）-寿永4/3/24（1185/4/25）',
		'/養和|1181/8/25~|:旧暦|注=1182年～1184年：平氏は養和を用いましたが、源氏は治承を継続使用しました。',
		'/壽永|1182/6/29~|:旧暦|元号=寿永',
		'/後鳥羽天皇/=|1183/9/8~|2/=:旧暦|諡=後鳥羽天皇|注=在位：寿永2/8/20（1183/9/8）-建久9/1/11（1198/2/18）',
		'/元暦|1184/5/27~|:旧暦|注=1185年：源氏は元暦を用いましたが、平氏は寿永を継続使用しました。',
		'/文治|1185/9/9~|:旧暦',

		'鎌倉朝廷/=/=|1185/12/21~|:旧暦|時期=鎌倉時代|注=始期については諸説あるが、東国支配権の承認を得た1183年説と守護・地頭設置権を認められた1185/12/21「文治の勅許」説が有力視されている。',
		'/建久|1190/5/16~|:旧暦',
		'/土御門天皇/=|1198/2/18~|9/=:旧暦|注=在位：建久9/1/11 （1198/2/18）-承元4/11/25（1210/12/12）',
		'/正治|1199/5/23~|:旧暦',
		'/建仁|1201/3/19~|:旧暦',
		'/元久|1204/3/23~|:旧暦',
		'/建永|1206/6/5~|:旧暦',
		'/承元|1207/11/16~|:旧暦',
		'/順德天皇/=|1210/12/12~|4/=:旧暦|諡=順徳天皇|注=在位：承元4/11/25（1210/12/12）-承久3/4/20（1221/5/13）',
		'/建暦|1211/4/23~|:旧暦',
		'/建保|1214/1/18~|:旧暦',
		'/承久|1219/5/27~|:旧暦',
		'/仲恭天皇/=|1221/5/13~|3/=:旧暦|注=在位:承久3/4/20（1221/5/13）-承久3/7/9（1221/7/29）',
		'/後堀河天皇/=|1221/7/29~|3/=:旧暦|注=在位：承久3/7/9（1221/7/29）-貞永元年10月4日（1232/11/17）',
		'/貞應|1222/5/25~|:旧暦|元号=貞応',
		'/元仁|1224/12/31~|:旧暦',
		'/嘉祿|1225/5/28~|:旧暦|元号=嘉禄',
		'/安貞|1228/1/18~|:旧暦',
		'/寛喜|1229/3/31~|:旧暦',
		'/貞永|1232/4/23~|:旧暦',
		'/四條天皇/=|1232/11/17~|:旧暦|諡=四条天皇|注=在位：貞永元年10月4日（1232/11/17）-仁治3/1/9（1242/2/10）',
		'/天福|1233/5/25~|:旧暦',
		'/文暦|1234/11/27~|:旧暦',
		'/嘉禎|1235/11/1~|:旧暦',
		'/暦仁|1238/12/30~|:旧暦',
		'/延應|1239/3/13~|:旧暦|元号=延応',
		'/仁治|1240/8/5~|:旧暦',
		'/後嵯峨天皇/=|1242/2/21~|3/=:旧暦|注=在位：仁治3/1/20（1242/2/21）-寛元4/1/29（1246/2/16）',
		'/寛元|1243/3/18~|:旧暦',
		'/後深草天皇/=|1246/2/16~|4/=:旧暦|注=在位：寛元4/1/29（1246/2/16）-正元元年11月26日（1260/1/9）',
		// http://base1.nijl.ac.jp/iview/Frame.jsp?DB_ID=G0003917KTM&C_CODE=HOKU-00434&PROC_TYPE=ON&SHOMEI=%E5%90%BE%E5%A6%BB%E9%8F%A1&REQUEST_MARK=%EF%BC%A4%EF%BC%A9%EF%BC%A7%EF%BC%8D%EF%BC%A8%EF%BC%AF%EF%BC%AB%EF%BC%B5%EF%BC%8D%EF%BC%94%EF%BC%93%EF%BC%94,%201797%E3%82%B3%E3%83%9E,%20Y&OWNER=%E5%8C%97%E5%A4%A7%E5%9B%B3&BID=100240884&IMG_NO=10
		'/寳治|1247/4/5~|:旧暦|元号=宝治;寶治',
		'/建長|1249/5/2~|:旧暦',
		'/康元|1256/10/24~|:旧暦',
		'/正嘉|1257/3/31~|:旧暦',
		'/正元|1259/4/20~|:旧暦',
		// 亀山天皇: 本朝通鑑 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/亀山天皇/=|1260/1/9~|:旧暦|君主=龜山天皇|諡=亀山天皇|注=在位：正元元年11月26日（1260/1/9）-文永11/1/26（1274/3/6）',
		'/文應|1260/5/24~|:旧暦|元号=文応',
		'/弘長|1261/3/22~|:旧暦',
		'/文永|1264/3/27~|:旧暦',
		'/後宇多天皇/=|1274/3/6~|11/=:旧暦|注=在位：文永11/1/26（1274/3/6）-弘安10/10/21（1287/11/27 ）',
		'/建治|1275/5/22~|:旧暦',
		'/弘安|1278/3/23~|:旧暦',
		'/伏見天皇/=|1287/11/27~|10/=:旧暦|注=在位:弘安10/10/21（1287/11/27）-永仁6/7/22（1298/8/30）',
		'/正應|1288/5/29~|:旧暦|元号=正応',
		'/永仁|1293/9/6~|:旧暦',
		'/後伏見天皇/=|1298/8/30~|6/=:旧暦|注=在位：永仁6/7/22（1298/8/30）-正安3/1/21（1301/3/2）',
		'/正安|1299/5/25~|:旧暦',
		'/後二條天皇/=|1301/3/2~|3/=:旧暦|諡=後二条天皇|注=在位：正安3/1/21（1301/3/2）-徳治3/8/25（1308/9/10）',
		'/乾元|1302/12/10~|:旧暦',
		'/嘉元|1303/9/16~|:旧暦',
		'/徳治|1307/1/18~|:旧暦',
		'/延慶|1308/11/22~|:旧暦',
		'/花園天皇/=|1308/12/28~|:旧暦|注=在位：延慶元年11月16日（1308/12/28）-文保2/2/26（1318/3/29）',
		'/應長|1311/5/17~|:旧暦|元号=応長',
		'/正和|1312/4/27~|:旧暦',
		'/文保|1317/3/16~|:旧暦',
		'/後醍醐天皇/=|1318/3/29~|2/=:旧暦|注=在位：文保2/2/26（1318/3/29）-延元4年/暦応2/8/15（1339/9/18）',
		'/元應|1319/5/18~|:旧暦|元号=元応',
		'/元亨|1321/3/22~|:旧暦',
		'/正中|1324/12/25~|:旧暦',
		'/嘉暦|1326/5/28~|:旧暦',
		'/元徳|1329/9/22~|:旧暦|元徳3年（1331年）、後醍醐天皇（大覚寺統）の倒幕計画発覚後、天皇は「元弘」に改元した。しかし、鎌倉幕府は改元を認めず、「元徳」を使い続けるとともに光厳天皇（持明院統）を擁立した。',

		// 南北朝時代の始期はは延元元年12月21日、建武の新政の崩壊を受けて足利尊氏が新たに光明天皇（北朝側）を擁立したのに対抗して京都を脱出した後醍醐天皇（南朝側）が吉野行宮に遷った時期であり、
		// 終期は明徳3年閏10月5日、南朝第4代の後亀山天皇が北朝第6代の後小松天皇に譲位するかたちで両朝が合一した時期である（明徳の和約）。
		'南朝/=/元弘|1331/9/11~|:旧暦|政權=大覚寺統|時期=室町時代',
		'/建武|1334/3/5~|:旧暦',
		'/延元|1336/4/11~|:旧暦',
		'/後村上天皇/=|1339/9/18~|4/=:旧暦|注=在位：延元4年/暦応2/8/15（1339/9/18）-正平23年/応安元年3月11日（1368/3/29）',
		'/興國|1340/5/25~|:旧暦',
		'/正平|1347/1/20~|:旧暦|注=『七巻冊子』は同年4月、『南朝編年記略』・『南朝公卿補任』は7月24日（8月11日）、『続史愚抄』などは7月4日（7月22日）とするが、全て誤りである。|注=正平6年（1351年）10月、尊氏を中心とする室町幕府勢力は足利直義との対抗上の必要から南朝と講和し、結果として光厳院政及び光厳の子崇光天皇の皇位がともに廃されることとなった（正平一統）。在京であり光厳・光明・崇光の直系尊属である広義門院が上皇の代理として伝国詔宣を行う案が立てられた。6月19日にようやく承諾を取り付けるに至った。6月27日には「官位等を正平一統以前の状態に復旧する」内容の広義門院令旨（天下一同法）が発令され、この令旨により、それまで停滞していた政務・人事・儀式などが全て動き始めることとなった。弥仁王も同年8月に無事践祚を終え後光厳天皇となった。正平8年（1353年）に後光厳へ政務権を継承した後も北朝家督者として君臨し続け、正平12年（1357年）に66歳で没した。',
		'/長慶天皇/=|1368/3/29~|23/=:旧暦|注=在位：正平23年/応安元年（1368年） 3月（鴨脚本『皇代記』による。ただし、日付の記録を欠いているため、3月11日（1368/3/29）の後村上天皇崩御を受けてのものか、あるいはそれに先だって行われた譲位によるものか、確認しがたい。おそらく前者であろう。しかし、近世の南朝系図は何によってか、3月9日（1368/3/27）受禅としているものが多いようである。）-弘和3年/永徳3年（1383年）冬。',
		'/建徳|1370/8/16~|:旧暦|注=『南朝編年記略』･『南朝公卿補任』によるが、鴨脚本『皇代記』は同年4月22日（5月17日）とし、『伊勢之巻』は1月21日（2月17日）とする。また、村田正志は、『大徳寺文書』にある建徳元年2月5日（1370/3/3）付の畠田売券を根拠として、当日以前に改元が行われたと指摘するが、この類の文書では恣意的に日付を遡及して記す場合もしばしばあったことを勘案しておく必要があろう（服部英雄 「未来年号考」 『古文書研究』第20号 吉川弘文館、1983年2月）。',
		'/文中|1372/4/26~|:旧暦|疑|注=建徳3年4月某日（ユリウス暦1372年5月某日）改元、災異によるか。正確な改元日については、史料を欠くために明確にし難い。史料上の初出は、『金剛寺文書』にある文中元年4月28日（1372/5/31）付の長慶天皇綸旨であり、これ以前に改元が行われたことは確実視される。したがって、『南朝編年記略』･『続史愚抄』等が同年10月4日（10月30日）とするのは誤り。『七巻冊子』のみは3月22日（4月26日）とし、森本角蔵の著作『日本年号大観』もこの説を採るが、他に所見がないために確証を得ない。',
		'/天授|1375/6/26~|:旧暦|注=『南朝編年記略』・『南朝公卿補任』によるが、『七巻冊子』は同年2月上旬とする。',
		'/弘和|1381/3/6~|:旧暦|注= 『南朝公卿補任』･『続史愚抄』等によるが、『南朝編年記略』は同年2月14日（3月10日）とする。なお、史料上の初出は、『金剛寺文書』『河合寺文書』にある弘和元年6月21日（1381/7/13）付の長慶天皇綸旨である。',
		// 後亀山天皇: 本朝通鑑 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/後亀山天皇/=|1383/11~|3/=:旧暦|君主=後龜山天皇|諡=後亀山天皇|注=在位：弘和3年/永徳3年（1383年）冬-元中9年/明徳3年閏10月5日（1392/11/19）',
		'/元中|1384/5/18~1392/11/18|:旧暦',

		'北朝/光嚴天皇/元弘|1331/10/22~|:旧暦|時期=室町時代|諡=光厳天皇|政權=持明院統|注=在位：元弘元年9月20日（1331/10/22）-元弘3年/正慶2/5/25（1333/7/7）',
		'/正慶|1332/5/23~1333/7/7|:旧暦|在位：配流先の隠岐から帰京した後醍醐天皇は、光厳天皇の即位と「正慶」の元号の無効を宣言。天皇親政を始めた後醍醐天皇は、「建武」に改元する（建武の新政）。',

		'/光明天皇/建武|1336/9/20~|3/=:旧暦|注=在位：延元元年/建武3/8/15（1336/9/20）-正平3年/貞和4/10/27（1348/11/18）',
		'/暦應|1338/10/11~|:旧暦|元号=暦応',
		'/康永|1342/6/1~|:旧暦',
		'/貞和|1345/11/15~|:旧暦',
		'/崇光天皇/=|1348/11/18~|4/=:旧暦|注=在位：正平3年/貞和4/10/27（1348/11/18）-正平6年/觀應2/11/7（1351/11/26）',
		'/觀應|1350/4/4~|:旧暦|元号=観応',
		'/後光嚴天皇/=|1352/9/25~|3/=:旧暦|諡=後光厳天皇|注=在位：正平8年/觀應3/8/17（1352/9/25）-建徳2年/応安4/3/23（1371/4/9）',
		'/文和|1352/11/4~|:旧暦',
		'/延文|1356/4/29~|:旧暦',
		'/康安|1361/5/4~|:旧暦',
		'/貞治|1362/10/11~|:旧暦',
		'/應安|1368/3/7~|:旧暦|元号=応安',
		'/後圓融天皇/=|1371/4/9~|4/=:旧暦|諡=後円融天皇|注=在位：建徳2年/応安4/3/23（1371/4/9）-弘和2年/永徳2/4/11（1382/5/24）',
		'/永和|1375/3/29~|:旧暦',
		'/康暦|1379/4/9~|:旧暦',
		'/永徳|1381/3/20~|:旧暦',
		'/後小松天皇/=|1382/5/24~|2/=:旧暦|注=在位：永徳2年/弘和2/4/11（1382/5/24）-応永19/8/29（1412/10/5）',
		'/至徳|1384/3/19~|:旧暦',
		'/嘉慶|1387/10/5~|:旧暦',
		'/康應|1389/3/7~|:旧暦|元号=康応',
		'/明徳|1390/4/12~|:旧暦',

		// 南北朝統一(合一)後
		'室町朝廷/=/=|1392/11/19~|3/=:旧暦|時期=室町時代|注=建武新政を含む最初の約60年間を南北朝時代、応仁の乱（1467年）または明応の政変（1493年）以後の時代を戦国時代と区分して、南北朝合一（1392年）から応仁の乱勃発または明応の政変までの約75～100年間を室町時代と区分する場合も多い。',
		'/應永|1394/8/2~|:旧暦|元号=応永',
		'/稱光天皇/=|1412/10/5~|19/=:旧暦|諡=称光天皇|注=在位： 応永19/8/29（1412/10/5）-正長元年7月20日（1428/8/30）',
		'/正長|1428/6/10~|:旧暦',
		'/後花園天皇/=|1428/9/7~|/=:旧暦|注=在位：正長元年7月28日（1428/9/7）-寛正5/7/19（1464/8/21）',
		'/永享|1429/10/3~|:旧暦',
		'/嘉吉|1441/3/10~|:旧暦',
		'/文安|1444/2/23~|:旧暦',
		'/宝徳|1449/8/16~|:旧暦',
		'/享徳|1452/8/10~|:旧暦',
		'/康正|1455/9/6~|:旧暦',
		'/長禄|1457/10/16~|:旧暦',
		'/寛正|1461/2/1~|:旧暦',
		'/後土御門天皇/=|1464/8/21~|5/=:旧暦|注=在位:寛正5/7/19（1464/8/21）-明応9/9/28（1500/10/21）',
		'/文正|1466/3/14~|:旧暦',

		'戦国時代/=/應仁|1467/4/9~|:旧暦|時期=室町時代|元号=応仁|注=一般に1467年の応仁の乱もしくは1493年の明応の政変を始まり、1568年の織田信長入京、もしくは1573年に室町将軍足利義昭が信長によって追放されたのを終わりとすることが多い。',
		'/文明|1469/6/8~|:旧暦',
		'/長享|1487/8/9~|:旧暦|注=改元後も幕府側の準備不足の為、8月9日（8月27日）まで公家も武家も「文明」の年号を使用した。',
		'/延徳|1489/9/16~|:旧暦',
		'/明應|1492/8/12~|:旧暦|元号=明応|注=室町幕府は改元吉書始を7月28日（8月21日）に行い、この日から新元号を採用している。',
		'/後柏原天皇/=|1500/11/16~|9/=:旧暦|注=在位：明応9/10/25（1500/11/16）-大永6/4/7（1526/5/18）',
		'/文龜|1501/3/18~|:旧暦|元号=文亀',
		'/永正|1504/3/16~|:旧暦',
		'/大永|1521/9/23~|:旧暦',
		'/後奈良天皇/=|1526/6/9~|6/=:旧暦|注=在位：大永6/4/29（1526/6/9）-弘治3/9/5（1557/9/27）',
		'/享禄|1528/9/3~|:旧暦',
		'/天文|1532/8/29~|:旧暦',
		'/弘治|1555/11/7~|:旧暦',
		'/正親町天皇/=|1557/11/17~|3/=:旧暦|注=在位：弘治3/10/27（1557/11/17）-天正14/11/7（1586/12/17）',
		'/永禄|1558/3/18~|:旧暦',
		'/元龜|1570/5/27~|:旧暦|元号=元亀',

		'安土桃山朝廷/=/天正|1573/8/25~|:旧暦|時期=安土桃山時代|注=織田信長と豊臣秀吉が中央政権を握っていた時代である。織豊時代（しょくほうじだい）ともいう。',
		'/後陽成天皇/=|1586/12/17~|14/=:旧暦|注=在位：天正14/11/7（1586/12/17）-慶長16/3/27（1611/5/9）',
		'/文祿|1593/1/10~|:旧暦|元号=文禄',
		'/慶長|1596/12/16~|:旧暦',

		'江戸朝廷/=/=|1603/3/24~|8/=:旧暦|時期=江戸時代|注=慶長8/2/12（1603/3/24）に徳川家康が征夷大将軍に任命されて江戸（現在の東京）に幕府を樹立してから慶応4年／明治元年4月11日（1868/5/3）に江戸城が明治政府軍に明け渡されるまでの265年間を指す。',
		'/後水尾天皇/=|1611/5/9~|16/=:旧暦|注=在位：慶長16/3/27（1611/5/9）-寛永6/11/8（1629/12/22）',
		'/元和|1615/9/5~|:旧暦',
		'/寛永|1624/4/17~|:旧暦',
		'/明正天皇/=|1629/12/22~|6/=:旧暦|君主性別=女|注=在位：寛永6/11/8（1629/12/22）-寛永20/10/3（1643/11/14）',
		'/後光明天皇/=|1643/11/14~|20/=:旧暦|注=在位：寛永20/10/3（1643/11/14）-承応3/9/20（1654/10/30）',
		'/正保|1645/1/13~|:旧暦',
		'/慶安|1648/4/7~|:旧暦',
		'/承応|1652/10/20~|:旧暦',
		'/後西天皇/=|1655/1/5~|4/=:旧暦|注=在位：承応4/11/28（1655/1/5）-寛文3/1/26（1663/3/5）',
		'/明暦|1655/5/18~|:旧暦',
		'/萬治|1658/8/21~|:旧暦|元号=万治',
		'/寛文|1661/5/23~|:旧暦',
		'/靈元天皇/=|1663/3/5~|3/=:旧暦|諡=霊元天皇|注=在位：寛文3/1/26（1663/3/5）-貞享4/3/21（1687/5/2）',
		'/延寳|1673/10/30~|:旧暦|元号=延宝;延寶',
		'/天和|1681/11/9~|:旧暦',
		'/貞享|1684/4/5~|:旧暦',
		'/東山天皇/=|1687/5/6~|4/=:旧暦|注=在位：貞享4/3/25（1687/5/6）-宝永6/6/21（1709/7/27）',
		'/元禄|1688/10/23~|:旧暦',
		'/宝永|1704/4/16~|:旧暦',
		'/中御門天皇/=|1709/7/27~|6/=:旧暦|注=在位:宝永6/6/21（1709/7/27）-享保20/3/21（1735/4/13）',
		'/正徳|1711/6/11~|:旧暦',
		'/享保|1716/8/9~|:旧暦',
		'/櫻町天皇/=|1735/4/13~|20/=:旧暦|諡=桜町天皇|注=在位:享保20/3/21（1735/4/13）-延享4/5/2（1747/6/9）',
		'/元文|1736/6/7~|:旧暦',
		'/寛保|1741/4/12~|:旧暦',
		'/延享|1744/4/3~|:旧暦',
		'/桃園天皇/=|1747/6/9~|4/=:旧暦|注=在位：延享4/5/2（1747/6/9）-宝暦12/7/12（1762/8/31）',
		'/寛延|1748/8/5~|:旧暦',
		'/宝暦|1751/12/14~|:旧暦',
		'/後櫻町天皇/=|1762/9/15~|12/=:旧暦|君主性別=女|君主=後桜町天皇|注=在位：宝暦12/7/27（1762/9/15）-明和7/4/28（1770/5/23）',
		'/明和|1764/6/30~|:旧暦|注=当初1月28日（2月29日）改元の予定であったが、朝鮮通信使の来日中の改元は事務上の問題に加えて外聞の問題も生じるとして4ヶ月延期された。',
		'/後桃園天皇/=|1770/5/23~|7/=:旧暦|注=在位：明和7/4/28（1770/5/23）-安永8/11/9（1779/12/16）',
		'/安永|1772/12/10~|:旧暦',
		'/光格天皇/=|1780/1/1~|8/=:旧暦|注=在位：安永8/11/25（1780/1/1）-文化14/3/22（1817/5/7）',
		'/天明|1781/4/25~|:旧暦',
		'/寛政|1789/2/19~|:旧暦',
		'/享和|1801/3/19~|:旧暦',
		'/文化|1804/3/22~|:旧暦',
		'/仁孝天皇/=|1817/10/31~|14/=:旧暦|注=在位：文化14/9/21（1817/10/31）-弘化3/1/26（1846/2/21）',
		'/文政|1818/5/26~|:旧暦',
		'/天保|1831/1/23~|:旧暦',
		'/弘化|1845/1/9~|:旧暦',
		'/孝明天皇/=|1846/3/10~|3/=:旧暦|注=在位:1846/3/10（弘化3/2/13）‐ 1867/1/30（慶応2/12/25）',
		'/嘉永|1848/4/1~|:旧暦',
		'/安政|1855/1/15~|:旧暦',
		'/萬延|1860/4/8~|:旧暦|元号=万延',
		'/文久|1861/3/29~|:旧暦',
		'/元治|1864/3/27~|:旧暦',
		'/慶應|1865/5/1~1868/10/23|:旧暦|元号=慶応',

		// 御称号(幼名),和風諡号,別称
		'/明治天皇/明治|旧暦1868~|:旧暦|元号=㍾|称号=祐宮|諱=睦仁|生=嘉永5年9月22日|卒=明治45年7月30日午前0時43分|注=実際に改元の詔書が出されたのは慶応4/9/8（1868/10/23）で慶応4/1/1に遡って明治元年とすると定めた。改元の詔書には「改慶應四年爲明治元年」（慶応4年を改めて明治元年と為す）とあり、改元が年の呼称を改めるということから、慶応4/1/1（1868/1/25）に遡って適用された。法的には慶応4/1/1より明治元年となる。',

		'明治以降/=/=|1868/5/3~|:旧暦|江戸時代（えどじだい）は、明治元年4月11日（1868/5/3）に江戸城が明治政府軍に明け渡されるまでの265年間を指す。',

		// <a
		// href="http://ja.wikipedia.org/wiki/%E3%82%B0%E3%83%AC%E3%82%B4%E3%83%AA%E3%82%AA%E6%9A%A6#.E6.97.A5.E6.9C.AC.E3.81.AB.E3.81.8A.E3.81.91.E3.82.8B.E3.82.B0.E3.83.AC.E3.82.B4.E3.83.AA.E3.82.AA.E6.9A.A6.E5.B0.8E.E5.85.A5"
		// accessdate="2013/4/1 23:29">グレゴリオ暦#日本におけるグレゴリオ暦導入</a>
		// 「太陰暦ヲ廃シ太陽暦ヲ頒行ス」日本では、明治5年（1872年）に、従来の太陰太陽暦を廃して翌年から太陽暦を採用することが布告された。
		'/=|1873/1/1~|6/=:CE|注=天保暦は明治5/12/2（1872/12/31）まで使われていた。その翌日の12月3日をもって明治6年（1873年）1月1日に改められ、グレゴリオ暦（太陽暦）に改暦された。改暦は明治5/11/9（1872/12/9）に布告し、翌月に実施された。|注=大日本帝國は1889年（明治22年）の大日本帝國憲法発布時に憲法典の名称として使用されたことから権威づけられ、1947年（昭和22年）の日本国憲法施行時までの約58年間、天皇が大日本帝國憲法を通じて統治する日本として使用された国号のひとつとされる。',
		'/大正天皇/大正|1912/7/30~|:CE|元号=㍽|称号=明宮|諱=嘉仁|生=明治12年8月31日午前8時20分|卒=大正15年12月25日|注=大正改元の詔書（1912年（明治45年）7月30日）: 朕菲德ヲ以テ大統ヲ承ケ祖宗ノ威靈ニ誥ケテ萬機ノ政ヲ行フ茲ニ先帝ノ定制ニ遵ヒ明治四十五年七月三十日以後ヲ改メテ大正元年ト爲ス主者施行セヨ（以下略）',
		// 旧字体: 1946年に制定した当用漢字で採用された新しい字体、すなわち新字体に対してそれ以前に慣用されていた字体を指す。
		'/昭和天皇/昭和|1926/12/25~|:CE|元号=㍼|称号=迪宮|諱=裕仁|生=明治34年4月29日22時10分|卒=昭和64年1月7日午前6時33分|注=昭和改元の詔書（1926年〔大正15年〕12月25日）: 朕皇祖皇宗ノ威靈ニ賴リ大統ヲ承ケ萬機ヲ總フ茲ニ定制ニ遵ヒ元號ヲ建テ大正十五年十二月二十五日以後ヲ改メテ昭和元年ト爲ス（以下略）',
		'/明仁天皇/平成|1989/1/8~|:CE|元号=㍻|君主=今上天皇|称号=継宮|諱=明仁|生=昭和8年12月23日 午前6時39分|注=「元号を改める政令」（昭和64年政令第1号）は新天皇の允裁（いんさい）を受けた後、官報号外によって公布され、翌1月8日から施行された。|注=天皇陛下譲位は平成31年4月30日、改元は5月1日。天皇の譲位は光格天皇以来、約200年ぶりとなる。',
		// 第126代天皇
		// https://ja.wikisource.org/wiki/%E5%85%83%E5%8F%B7%E3%82%92%E6%94%B9%E3%82%81%E3%82%8B%E6%94%BF%E4%BB%A4_(%E5%B9%B3%E6%88%90%E4%B8%89%E5%8D%81%E4%B8%80%E5%B9%B4%E6%94%BF%E4%BB%A4%E7%AC%AC%E7%99%BE%E5%9B%9B%E5%8D%81%E4%B8%89%E5%8F%B7)
		'/徳仁天皇/令和|2019/5/1~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|元号=㋿|称号=浩宮|諱=徳仁|生=1960年2月23日|注=平成31年4月1日内閣告示第1号: 元号を改める政令（平成三十一年政令第百四十三号）の規定により定められた元号の読み方は、次のとおりである。 令和',

		// ------------------------------------------------

		// 幕府 https://ja.wikipedia.org/wiki/%E5%B9%95%E5%BA%9C
		// http://www.7key.jp/data/syougun.html
		// http://www.geocities.jp/tougoku_busyou/seii.htm
		// http://www.ne.jp/asahi/histrian/takasaki/history2.html
		// http://www.sogonenpyo.jpn.org/main-nenpyo.php

		// '征夷大将軍/坂上田村麻呂|797/11/27~811/6/17|:旧暦|時期=平安時代|読み=さかのうえのたむらまろ|生=天平宝字2年|卒=弘仁2年5月23日|父=坂上苅田麻呂|注=出家。',
		// '/文室綿麻呂|813/7/1~816/12/1|:旧暦|読み=ふんやのわたまろ|生=天平神護元年|卒=弘仁14年4月24日|父=三諸大原',
		// '/藤原忠文|940/2/29~947/7/16|:旧暦|読み=ふじわらのただぶみ|生=貞観15年|卒=天暦元年6月26日|父=藤原枝良|母=息長息継の娘|注=宇治民部卿とも呼ばれる。',
		// '/源義仲|1184/2/28~1184/3/4|:旧暦|読み=みなもとのよしなか|生=久寿元年|卒=寿永3年1月20日|父=源義賢|母=小枝御前|注=討死[宇治川の戦い]。',

		// 鎌倉将軍一覧
		// https://ja.wikipedia.org/wiki/%E9%8E%8C%E5%80%89%E5%B0%86%E8%BB%8D%E4%B8%80%E8%A6%A7
		'鎌倉幕府/源頼朝|1192/8/21~1199/2/9|:旧暦|時期=鎌倉時代|読み=みなもとのよりとも|生=久安3年4月8日|卒=建久10年1月13日|父=源義朝|母=由良御前|注=出家。',
		'/源頼家|1202/8/11~|:旧暦|読み=みなもとのよりいえ|生=寿永元年8月12日|卒=元久元年7月18日|父=源頼朝|母=北条政子|注=北条氏の手兵によって殺害。',
		'/源実朝|1203/10/13~|:旧暦|読み=みなもとのさねとも|生=建久3年8月9日|卒=建保7年1月27日|父=源頼朝|母=北条政子|注=鶴岡八幡宮で公暁に襲われ落命。',
		'/北条政子|1219/2/13~1225/8/16|:旧暦|読み=ほうじょう まさこ|生=保元2年|卒=嘉禄元年7月11日|父=北条時政|注=尼将軍。『吾妻鏡』では実朝死去から政子死去まで、北条政子を鎌倉殿と扱っている。',
		'/藤原頼經|1226/2/25~|:旧暦|君主名=藤原頼経|読み=ふじわらのよりつね|生=建保6年1月16日|卒=建長8年8月11日|父=九条道家|母=西園寺?子|注=九条頼経とも呼ばれる。出家。行賀と号す。',
		'/藤原頼嗣|1244/6/5~1252/3/31|:旧暦|読み=ふじわらのよりつぐ|生=延応元年11月21日|卒=建長8年9月25日|父=藤原頼経|母=大宮殿|注=九条頼嗣とも呼ばれる。',
		'/宗尊親王|1252/5/10~1266/8/21|:旧暦|読み=むねたかしんのう|生=仁治3年11月22日|卒=文永11年8月1日|父=後嵯峨天皇|母=平棟子|注=二月騒動[北条教時の乱]。出家。佐渡へ配流。',
		'/惟康親王|1266/8/25~1289/9/29|:旧暦|読み=これやすしんのう|生=文永元年4月29日|卒=嘉暦元年10月30日|父=宗尊親王|母=近衛宰子|注=出家。',
		'/久明親王|1289/10/24~1308/8/20|:旧暦|読み=ひさあきしんのう|生=建治2年9月11日|卒=嘉暦3年10月14日|父=後深草天皇|母=三条房子|注=出家。',
		'/守邦親王|1308/8/26~1333/7/4|:旧暦|読み=もりくにしんのう|生=正安3年5月12日|卒=元弘3年8月16日|父=久明親王|母=惟康親王の娘|注=出家。',
		// '/護良親王|1333/7/13~1335/8/12|:旧暦|読み=もりよししんのう|生=延慶元年|卒=建武2年7月23日|父=後醍醐天皇|母=源親子|注=足利直義によって殺害。',
		// '/成良親王|1335/1/26~1336|:旧暦|読み=なりよししんのう|生=嘉暦元年|卒=康永3年1月6日|父=後醍醐天皇|母=阿野廉子|注=毒殺。',

		// 鎌倉幕府の執権一覧
		// https://ja.wikipedia.org/wiki/%E9%8E%8C%E5%80%89%E5%B9%95%E5%BA%9C%E3%81%AE%E5%9F%B7%E6%A8%A9%E4%B8%80%E8%A6%A7
		// 鎌倉幕府の連署一覧
		// https://ja.wikipedia.org/wiki/%E9%8E%8C%E5%80%89%E5%B9%95%E5%BA%9C%E3%81%AE%E9%80%A3%E7%BD%B2%E4%B8%80%E8%A6%A7
		'鎌倉幕府執権/北条時政|1203/10/7~|:旧暦|読み=ほうじょう ときまさ|生=保延4年|卒=建保3年1月6日|時期=鎌倉時代|注=牧氏事件: 元久2年閏7月20日に、遂に政子と義時は協力して時政を執権から廃して、牧の方と共に強制的に出家させた。',
		'/北条義時|1205/9/5~1224/7/1|:旧暦|読み=ほうじょう よしとき|生=長寛元年|卒=元仁元年',
		'/北条泰時|1224/7/16~|:旧暦|読み=ほうじょう やすとき|生=寿永2年|卒=仁治3年6月15日',
		'/北条経時|1242/7/14~|:旧暦|読み=ほうじょう つねとき|生=元仁元年|卒=寛元4年閏4月1日',
		'/北条時頼|1246/4/10~|:旧暦|読み=ほうじょう ときより|生=嘉禄3年5月14日|卒=弘長3年11月22日',
		'/北条長時|1256/12/10~1264/7/27|:旧暦|読み=ほうじょう ながとき|生=寛喜2年2月27日|卒=文永元年8月21日',
		'/北条政村|1264/9/2~|:旧暦|読み=ほうじょう まさむら|生=元久2年6月22日|卒=文永10年5月27日',
		'/北条時宗|1268/4/18~|:旧暦|読み=ほうじょう ときむね|生=建長3年5月15日|卒=弘安7年4月4日',
		'/北条貞時|1284/4/20~|:旧暦|読み=ほうじょう さだとき|生=文永8年12月12日|卒=応長元年10月26日',
		'/北条師時|1301/9/24~1311/11/2|:旧暦|読み=ほうじょう もろとき|生=建治元年|卒=応長元年9月22日',
		'/北条宗宣|1311/11/13~1312/7/4|:旧暦|読み=ほうじょう むねのぶ|生=正元元年|卒=正和元年6月12日',
		'/北条煕時|1312/7/6~|:旧暦|読み=ほうじょう ひろとき|生=弘安2年|卒=正和4年7月18日',
		'/北条基時|1315/8/12~1316/7/28|:旧暦|読み=ほうじょう もととき|生=弘安9年|卒=元弘3年5月22日',
		'/北条高時|1316/7/29~1326/3/17|:旧暦|読み=ほうじょう たかとき|生=嘉元3年|卒=元弘3年5月22日',
		'/北条貞顕|1326/4/19~1326/4/29|:旧暦|読み=ほうじょう さだあき|生=弘安元年|卒=元弘3年5月22日',
		'/北条守時|1326/5/26~1333/6/30|:旧暦|読み=ほうじょう もりとき|生=永仁3年|卒=元弘3年5月18日',

		// 足利将軍一覧
		// https://ja.wikipedia.org/wiki/%E8%B6%B3%E5%88%A9%E5%B0%86%E8%BB%8D%E4%B8%80%E8%A6%A7
		'室町幕府/足利尊氏|1338/9/24~1358/6/7|:旧暦|読み=あしかがたかうじ|生=嘉元3年|卒=延文3年4月30日|父=足利貞氏|母=上杉清子|時期=室町時代',
		// '/興良親王|1339/2/10~1364/9/10|:旧暦|読み=おきよししんのう|生=嘉暦元年|卒=正平19年8月14日病没?',
		// '/宗良親王|1352/1/18~1368|:旧暦|読み=むねよししんのう|生=応長元年|卒=至徳2年8月10日|父=後醍醐天皇|母=二条為子',
		'/足利義詮|1359/1/7~1367/12/28|:旧暦|読み=あしかが よしあきら|生=元徳2年6月18日|卒=貞治6年12月7日|父=後醍醐天皇|母=阿野廉子',
		'/足利義満|1369/2/7~1395/1/8|:旧暦|読み=あしかがよしみつ|生=延文3年8月22日|卒=応永15年5月6日|父=足利義詮|母=紀良子',
		// '/尹良親王|1386/9/2~1424/9/7|:旧暦|読み=ゆきよししんのう|生=貞治3年?|卒=応永31年8月15日|父=宗良親王|注=敵軍[北朝側]に囲まれ、自害。',
		'/足利義持|1395/1/8~|:旧暦|読み=あしかがよしもち|生=至徳3年2月12日|卒=応永35年1月18日|父=足利義満|母=藤原慶子|注=出家。',
		'/足利義量|1423/4/28~|:旧暦|読み=あしかがよしかず|生=応永14年7月24日|卒=応永32年2月27日|父=足利義持|母=日野栄子',
		'/足利義持|1425/3/17~1428/2/3|:旧暦|読み=あしかがよしもち|生=至徳3年2月12日|卒=応永35年1月18日|父=足利義満|母=義量早世に伴う将軍代理|注=出家。',
		'/足利義教|1429/4/18~1441/7/12|:旧暦|読み=あしかがよしのり|生=明徳5年6月14日|卒=嘉吉元年6月24日|父=足利義満|母=藤原慶子|注=義宣→義教',
		'/足利義勝|1442/12/9~1443/8/16|:旧暦|読み=あしかがよしかつ|生=永享6年2月9日|卒=嘉吉3年7月21日|父=足利義教|母=日野重子',
		'/足利義政|1449/5/21~|:旧暦|読み=あしかがよしまさ|生=永享8年1月2日|卒=延徳2年正月7日|父=足利義教|母=日野重子|注=義成→義政',
		'/足利義尚|1474/1/7~|:旧暦|読み=あしかがよしひさ|生=寛正6年11月23日|卒=長享3年3月26日|父=足利義政|母=日野富子|注=義尚→義煕',
		'/足利義政|1489/4/26~1490/1/27|:旧暦|読み=あしかがよしまさ|生=永享8年1月2日|卒=延徳2年正月7日|父=足利義教|母=日野重子|注=義量早世に伴う将軍代理',
		'/足利義材|1490/7/22~1493/8/11|:旧暦|読み=あしかがよしき|生=文正元年7月30日|卒=大永3年4月9日|父=足利義視|母=日野重政の娘|注=義材→義尹→義稙',
		'/足利義澄|1495/1/23~1508/5/15|:旧暦|読み=あしかがよしずみ|生=文明12年12月15日|卒=永正8年8月14日|父=足利政知|母=武者小路隆光の娘|注=義高→義遐→義澄',
		'/足利義稙|1508/7/28~|:旧暦|読み=あしかがよしたね|生=文正元年7月30日|卒=大永3年4月9日|父=足利義視|母=日野重政の娘|注=義材→義尹→義稙(義材再任)',
		'/足利義晴|1522/1/22~|:旧暦|読み=あしかがよしはる|生=永正8年3月5日|卒=天文19年5月4日|父=足利義澄|母=日野永俊の娘',
		'/足利義輝|1547/1/11~1565/6/17|:旧暦|読み=あしかがよしてる|生=天文5年3月10日|卒=永禄8年5月19日|父=足利義晴|母=慶寿院|注=義藤→義輝',
		'/足利義栄|1568/3/6~1568/10/20|:旧暦|読み=あしかがよしひで|生=天文7年|卒=永禄11年9月|父=足利義維|母=大内義興の娘|注=義親→義栄(-9月末)',
		'/足利義昭|1568/11/7~1588/2/9|:旧暦|読み=あしかがよしあき|生=天文6年11月3日|卒=慶長2年8月8日|父=足利義晴|母=慶寿院|注=義秋→義昭',

		'織田政権/織田信長|1573/8/25~1582/6/21|:旧暦|時期=安土桃山時代|生=天文3年5月12日?|卒=天正10年6月2日|注=天正10年6月2日早朝、本能寺の変。',
		'/織田秀信|1582/7/16~1583/8/17|:旧暦|時期=安土桃山時代|生=天正8年|卒=慶長10年5月27日|注=天正10年6月27日に開かれた、清洲会議|注=天正11年の6月までは「織田体制」として政権は機能していたとされている',
		'豊臣政権/豐臣秀吉|1585/1/31~|:旧暦|時期=安土桃山時代|君主=豊臣秀吉|生=天文6年2月6日?|卒=慶長3年8月18日|注=羽柴氏政権とも言われる。',
		'/豐臣秀賴|1598/9/18~|:旧暦|君主=豊臣秀頼|生=文禄2年8月3日|卒=慶長20年5月8日|注=慶長19年からの大坂の陣において、家康により滅ぼされた。',

		// 徳川将軍一覧
		// https://ja.wikipedia.org/wiki/%E5%BE%B3%E5%B7%9D%E5%B0%86%E8%BB%8D%E4%B8%80%E8%A6%A7
		'江戸幕府/徳川家康|1603/3/24~|:旧暦|時期=江戸時代|読み=とくがわいえやす|生=天文11年12月26日|卒=元和2年4月17日|父=松平広忠|母=於大|注=松平元信→松平元康→徳川家康|注=慶長八年二月十二日、家康は征夷大将軍の官職を獲得。',
		'/徳川秀忠|1605/2/18~|:旧暦|読み=とくがわひでただ|生=天正7年4月7日|卒=寛永9年正月24日|父=徳川家康|母=西郷局',
		'/徳川家光|1623/1/31~|:旧暦|読み=とくがわいえみつ|生=慶長9年7月17日|卒=慶安4年4月20日|父=徳川秀忠|母=崇源院',
		'/徳川家綱|1651/2/20~|:旧暦|読み=とくがわいえつな|生=寛永18年8月3日|卒=延宝8年5月8日|父=徳川家光|母=宝樹院',
		'/徳川綱吉|1680/2/1~|:旧暦|読み=とくがわつなよし|生=正保3年正月8日|卒=宝永6年正月10日|父=徳川家光|母=桂昌院',
		'/徳川家宣|1709/2/10~1712/2/7|:旧暦|読み=とくがわいえのぶ|生=寛文2年4月25日|卒=正徳2年10月14日|父=徳川綱重|母=長昌院|注=綱豊→家宣',
		'/徳川家継|1713/1/26~|:旧暦|読み=とくがわいえつぐ|生=宝永6年7月3日|卒=正徳6年4月30日|父=徳川家宣|母=月光院',
		'/徳川吉宗|1716/8/9~|:旧暦|読み=とくがわよしむね|生=貞享元年6月20日|卒=寛延4年6月20日|父=徳川光貞|母=浄円院|注=松平頼方→徳川吉宗',
		'/徳川家重|1745/2/1~|:旧暦|読み=とくがわいえしげ|生=正徳元年12月21日|卒=宝暦11年6月12日|父=徳川吉宗|母=深徳院',
		'/徳川家治|1760/2/17~1786/1/30|:旧暦|読み=とくがわいえはる|生=元文2年5月22日|卒=天明6年8月25日|父=徳川家重|母=至心院',
		'/徳川家斉|1787/2/18~|:旧暦|読み=とくがわいえなり|生=安永2年10月5日|卒=仁孝天皇天保12年閏正月30日|父=徳川治済|母=慈徳院',
		'/徳川家慶|1837/2/5~|:旧暦|読み=とくがわいえよし|生=寛政5年5月14日|卒=嘉永6年6月22日|父=徳川家斉|母=香琳院',
		'/徳川家定|1853/2/8~|:旧暦|読み=とくがわいえさだ|生=文政7年4月8日|卒=安政5年7月6日|父=徳川家慶|母=本寿院|注=家祥→家定',
		'/徳川家茂|1858/2/14~1866/2/15|:旧暦|読み=とくがわいえもち|生=弘化3年閏5月24日|卒=慶応2年7月20日|父=徳川斉順|母=実成院|注=慶福→家茂',
		'/徳川慶喜|1867/1/10~1868/1/3|:旧暦|読み=とくがわよしのぶ|生=仁孝天皇天保8年9月29日|卒=大正2年11月22日|父=徳川斉昭|母=吉子女王|注=昭致→慶喜',

		// ------------------------------------------------

		// 臺灣日治時期 武裝反抗日本對臺灣殖民統治發動起義而建立的政權
		'臺灣民主國/唐景崧/永清|1895/5/25~|:清|疑|時期=日治臺灣|總統=唐景崧|注=臺灣通史/卷4:光緒二十一年夏五月朔，臺灣人民自立為民主國，奉巡撫唐景崧為大總統。...初二日，紳士邱逢甲率人民等公上大總統之章。景崧受之，建元永清，旗用藍地黃虎。|注=1895年5月25日，大總統唐景崧於《臺灣民主國獨立宣言》中，首度公布並使用此年號。|注=1895年5月8日馬關條約生效。1895年6月17日，首任臺灣總督樺山資紀在原布政使司衙門宣布在臺灣「始政」。|注=1895年6月6日唐景崧和陳季同搭乘德國 Arthur 號內渡',
		'/劉永福/=|1895/6/26~10/21|:清|疑|時期=日治臺灣|總統=劉永福|據=Wikipedia|注=Wikipedia: 1895年6月26日，餘眾在臺南擁立民主國大將軍劉永福為第二任大總統。|注=Wikipedia: 1895年10月19日劉永福兵敗逃離，10月21日日軍攻入臺南，10月23日控制全臺灣，臺灣民主國滅亡，國祚150天。|注=臺灣通史/卷4:十三日，日軍以一大隊迫獅球嶺。臺人請景崧駐八堵，為死守計，不從。...景崧既入，攜巡撫印奔滬尾，乘德商輪船逃。...十四日夜半至城外，城兵猶守戰。黎明乃陷。十五日，川村景明入臺北，以騎兵略淡水。十八日，能久親王至。二十一日，總督樺山資紀亦至，遂開府於此，以理軍民之政。...臺南既聞臺北之報，議奉永福為大總統。不從。請移駐郡治，強之乃許。...六月二十日，日軍攻頭份，新楚軍副將楊紫雲戰歿，維義敗回。日軍攻苗栗，前敵諸軍請濟師，永福苦無以應。...初四日辰刻，日軍入城，海軍亦至安平，遺兵二十餘人被殺，而臺灣民主國亡。',

		'鐵國山/九千歲/天運|1896/6/14~|:清|疑|時期=日治臺灣|君主名=簡義;簡宜;簡精華|表字=精華|生=1835年|卒=1898年|據=Wikipedia|注=Wikipedia: 明治29年2月（1896年）於古坑大坪頂鐵國山自立為王...劉永福舊屬簡義為首領，稱「九千歲」...1896年6月14日，簡義於鐵國山大會群雄，豐備牲禮，祭告天地，稱「天運」元年...1896年10月05日，簡義獨自一人下山歸順投降日本。',
		'/霸王/=|1896/10/6~12/14|:清|疑|時期=日治臺灣|君主名=柯鐵;柯鐵虎|君主號=鐵虎|生=1876年|卒=1900年|據=Wikipedia|注=Wikipedia: 簡義叛離後，劉得杓、黃才、張呂赤、賴福來等首領，共舉柯鐵為鐵國山「總統」，稱「霸王」。...1899年放棄抵抗，歸順日本官方，於1900年病逝，而柯鐵虎義軍旋即遭總督府派兵全數殲滅。',

		// 大靖政權
		'大靖/黃國鎮/大靖|1897~1899/3|:CE|疑|時期=日治臺灣|君主名=黃國鎮|據=Wikipedia|注=Wikipedia: 1897年1月至1898年11月25日止，臺灣抗日義軍首領黃國鎮在近兩年內控制嘉義東堡（山地）49個莊，組織聯莊自衛，並自稱皇帝，定年號為「大靖」。',

		'大明慈悲國/余清芳|1915/7/6~|:CE|疑|時期=日治臺灣|據=Wikipedia|注=Wikipedia: 西來庵事件 1915年7月6日，在遭公家通緝下，以「大明慈悲國奉旨平臺征伐天下大元帥余」名義發表了《大元帥余告示文》，發動起事',
		'/江定|1915/8/22~1916/416|:CE|疑|據=Wikipedia|注=Wikipedia: 1915年8月22日，余清芳在王萊莊（今臺南市楠西區），鄉人設宴款待，卻在酒酣耳熱之際，將余清芳綁縛，送交日軍。9月被處決。江定1916年4月16日出山接受招安。日人於五月十八日將其逮捕，並判處死刑；9月13日行刑。'

]).minute_offset = 9 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"korea"}
(CeL.era.pass_on.countries["한국"] = [
		// Korean

		'衛滿朝鮮/衛滿|-194~-161||疑|國名=衛氏朝鮮|注=第二代王衛滿兒子，史失其名',
		'/右渠王|-129~-108||疑|君主=衛右渠|注=衛滿的孫子。前109年，衛右渠與西漢發生衝突，致使漢武帝派兵侵略朝鮮。翌年，衛右渠被屬下暗殺，隨後衛氏朝鮮為西漢所滅，設置漢四郡。',

		// 朝鮮三國時代

		'新羅/赫居世居西干|-57/6/8~|/4/28=:中國|疑|朝代=신라;斯羅;斯盧;駟盧;사라;사로|君主=혁거세거서간;赫居世居瑟邯;혁거세거슬한|據=時間規範資料庫',
		'/南解次次雄|4/5/8~|4=:中國|疑|君主=남해차차웅;南解慈充',
		'/儒理尼師今|24/11/20~|10=:中國|疑|君主=유리이사금;弩尼叱今;弩禮尼師今;儒理尼叱今;弩禮尼叱今',
		'/脫解尼師今|57/11/16~|10=:中國|疑|君主=탈해이사금;吐解尼師今;脫解尼叱今;吐解尼叱今',
		'/婆娑尼師今|80/10/3~|9=:中國|疑|君主=파사이사금;婆娑尼叱今',
		'/祇摩尼師今|112/12/7~|11=:中國|疑|君主=지마이사금;祇味尼師今;祇摩尼叱今;祇味尼叱今;祇磨尼師今;祇磨尼叱今',
		'/逸聖尼師今|134/10/6~|9=:中國|疑|君主=일성이사금;逸聖尼叱今',
		'/阿達羅尼師今|154/4/1~|3=:中國|疑|君主=아달라이사금;阿達羅尼叱今',
		'/伐休尼師今|184/4/28~|4=:中國|疑|君主=벌휴이사금;發暉尼師今;발휘이사금;伐休尼叱今;發暉尼叱今',
		'/奈解尼師今|196/6/14~|5=:中國|疑|君主=나해이사금;奈解尼叱今',
		'/助賁尼師今|230/4/30~|4=:中國|疑|君主=조분이사금;諸貴尼師今;助賁尼叱今;諸貴尼叱今',
		'/沾解尼師今|247/7/20~|6=:中國|疑|君主=첨해이사금;沾解尼叱今;理解尼師今;理解尼叱今;詀解尼師今;詀解尼叱今',
		'/味鄒尼師今|262/2/6~|:中國|疑|君主=미추이사금;味照尼師今;味鄒尼叱今;味照尼叱今;未鄒尼師今;未鄒尼叱今;未召尼師今;未召尼叱今;味炤尼師今;味炤尼叱今;未祖尼師今;未祖尼叱今',
		'/儒禮尼師今|284/11/25~|11=:中國|疑|君主=유례이사금;儒禮尼叱今;儒理尼叱今;世里智王',
		'/基臨尼師今|299/1/19~|12=:中國|疑|君主=기림이사금;基立尼師今;基立尼叱今;基臨尼叱今',
		'/訖解尼師今|310/8/12~|7=:中國|疑|君主=흘해이사금;訖解尼叱今;乞解尼師今;乞解尼叱今',
		'/奈勿尼師今|356/6/15~|5=:中國|疑|君主=나물이사금;那密尼師今;나밀이사금;奈勿尼叱今;那密尼叱今;奈勿麻立干',
		'/實聖尼師今|402/4/18~|3=:中國|疑|君主=실성이사금;實聖尼叱今;實聖麻立干;實主王;寶金王',
		'/訥祇麻立干|417/6/30~|6=:中國|疑|君主=눌지마립간;訥祗麻立干;內只王',
		'/慈悲麻立干|458/9/24~|9=:中國|疑|君主=자비마립간',
		'/炤知麻立干|479/4/8~|3=:中國|疑|君主=소지마립간;毗處麻立干;비처마립간;知王',
		'/智證麻立干|501/1/5~|12=:中國|疑|君主=지증마립간;智訂麻立干;智哲麻立干;智度路王',
		'/法興王|514/9/5~|8=:中國|疑|君主=법흥왕',
		'/法興王/建元|536/2/8~|:中國|疑|年號=건원',
		'/眞興王/=|540/9/17~|5/8/=:中國|疑|君主=진흥왕',
		'/開國|551/1/23~|:中國|疑|君主=진흥왕|年號=개국',
		'/大昌|568/2/14~|:中國|疑|君主=진흥왕|年號=태창',
		'/鴻濟|572/1/31~|:中國|疑|君主=진흥왕|年號=홍제',
		'=/眞智王|576/10/8~|9=:中國|疑|君主=진지왕;舍輪王;真智王;사륜왕',
		'/眞平王|579/8/24~|/7/17=:中國|疑|君主=진평왕;白淨王;真平王;백정왕',
		'/=/建福|584/3/17~|2=:中國|疑|君主=진평왕;白淨王;백정왕|年號=건복',
		'/善德王/=|632/2/26~|49/2/=:中國|疑|君主=선덕왕;善德女王;선덕여왕|君主性別=女',
		'/=/仁平|634/2/4~|:中國|疑|年號=인평',
		'/眞德王/=|647/2/17~|14/1/8=:中國|疑|君主=진덕왕;眞德女王|君主性別=女',
		'/眞德王/太和|647/8/6~|7=:中國|疑|年號=태화',
		'=/武烈王|654/4/22~|4=:中國|疑|君主=태종무열왕|諡=武烈|廟號=太宗',
		'/文武王|661/8/1~|7=:中國|疑|君主=문무왕;文虎王',
		'/神文王|681/7/21~|7=:中國|疑|君主=신문왕',
		'/孝昭王|692/9/16~|8=:中國|疑|君主=효소왕',
		// 應付久視元年十月甲寅恢復寅正。
		'/=|700/5/23~|9/5/=:唐|疑',
		'/聖德王|702/8/28~|8=:中國|疑|君主=성덕왕',
		'/孝成王|737/4/5~|3=:中國|疑|君主=효성왕',
		'/景德王|742/7/7~|6=:中國|疑|君主=경덕왕',
		'/惠恭王|765/7/23~|7=:中國|疑|君主=혜공왕',
		'/宣德王|780/6/7~|5=:中國|疑|君主=선덕왕',
		'/元聖王|785/2/27~|/1/14=:中國|疑|君主=원성왕',
		'/昭聖王|799/2/10~|:中國|疑|君主=소성왕;昭成王',
		'/哀莊王|800/7/25~|7=:中國|疑|君主=애장왕',
		'/憲德王|809/9/13~|8=:中國|疑|君主=헌덕왕',
		'/興德王|826/12/3~|11=:中國|疑|君主=흥덕왕',
		'/僖康王|837/1/11~|12=:中國|疑|君主=희강왕',
		'/閔哀王|838/2/28~|2=:中國|疑|君主=민애왕;敏哀王',
		'/神武王|839/3/9~|/閏1/20=:中國|疑|君主=신무왕;神虎王',
		'/文聖王|839/9/4~|/7/23=:中國|疑|君主=문성왕',
		'/憲安王|857/10/22~|10=:中國|疑|君主=헌안왕',
		'/景文王|861/3/15~|2=:中國|疑|君主=경문왕',
		'/憲康王|875/8/13~|/7/9=:中國|疑|君主=헌강왕',
		'/定康王|886/8/9~|/7/6=:中國|疑|君主=정강왕',
		'/眞聖王|887/7/29~|/7/6=:中國|疑|君主=진성왕;眞聖女王|君主性別=女',
		'/孝恭王|898/1/1~|/12/5=:中國|疑|君主=효공왕',
		'/神德王|912/5/20~|5=:中國|疑|君主=신덕왕',
		'/景明王|917/8/21~|8=:中國|疑|君主=경명왕',
		'/景哀王|924/10/2~|9=:中國|疑|君主=경애왕',
		'/敬順王|927/11/27~935/12/28|11=:中國|疑|君主=경순왕',

		'高句麗/東明聖王|-37/2/2~|:中國|疑|朝代=고구려;高勾麗|君主=동명성왕|據=時間規範資料庫',
		'/琉璃明王|-19/11/5~|10=:中國|疑|君主=유리명왕;琉璃王;瑠璃王;累利王',
		'/大武神王|18/10/29~|11=:中國|疑|君主=대무신왕;大解朱留王;大虎神王',
		'/閔中王|44/11/9~|10=:中國|疑|君主=민중왕',
		'/慕本王|48/8/28~|8=:中國|疑|君主=모본왕',
		'/太祖王|53/12/29~|12=:中國|準=2年|君主=大祖大王;태조대왕;國祖王',
		'/次大王|147/1/20~|12=:中國|疑|君主=차대왕',
		'/新大王|165/12/21~|11=:中國|疑|君主=신대왕',
		'/故國川王|179/11/17~|10=:中國|疑|君主=고국천왕;故國壞王',
		'/山上王|197/7/3~|6=:中國|疑|君主=산상왕',
		'/東川王|227/7/2~|6=:中國|疑|君主=동천왕;東襄王',
		'/中川王|248/11/3~|10=:中國|疑|君主=중천왕;中壤王',
		'/西川王|270/11/30~|11=:中國|疑|君主=서천왕;西壤王',
		'/烽上王|292/4/4~|3=:中國|疑|君主=봉상왕;雉葛王',
		'/美川王|300/9/30~|9=:中國|疑|君主=미천왕;好壤王;妙禳王',
		'/故國原王|331/4/24~|3=:中國|疑|君主=고국원왕;國罡上王;岡上王',
		'/小獸林王|371/11/17~|/10/24=:中國|疑|君主=소수림왕;小解朱留王',
		'/故國壤王|384/12/29~|12=:中國|疑|君主=고국양왕',
		'/廣開土王/永樂|391/7/18~|6=:中國|疑|君主=광개토왕|年號=영락',
		'=/長壽王|413/2/17~|:中國|疑|君主=장수왕',
		'/=/延壽|451/2/17~|:中國|疑|年號=연수',
		'=/文咨王|492/2/14~|:中國|疑|君主=文咨明王;문자명왕;明治好王',
		'/安臧王|520/1/6~|12=:中國|疑|君主=안장왕;安藏王',
		'/安原王|531/6/30~|6=:中國|疑|君主=안원왕',
		'/陽原王|545/4/27~|4=:中國|疑|君主=양원왕;陽崗上好王',
		'/平原王|559/4/23~|4=:中國|疑|君主=평원왕;平崗上好王;平岡王',
		'/嬰陽王|590/12/3~|11=:中國|疑|君主=영양왕;平陽王',
		'/榮留王|618/10/24~|10=:中國|疑|君主=영류왕',
		'/寶臧王|642/11/28~668/12/8|11=:中國|疑|君主=보장왕',

		'百濟/溫祚王|-18/2/2~|:中國|疑|朝代=백제|君主=온조왕|據=時間規範資料庫',
		'/多婁王|28/4/14~|3=:中國|疑|君主=다루왕',
		'/己婁王|77/11/5~|10=:中國|疑|君主=기루왕',
		'/蓋婁王|129/1/8~|12=:中國|疑|君主=개루왕',
		'/肖古王|166/8/14~|7=:中國|疑|君主=초고왕;素古王',
		'/仇首王|214/12/20~|11=:中國|疑|君主=구수왕;貴須王',
		'/古尒王|234/8/13~|7=:中國|疑|君主=고이왕',
		'/責稽王|287/1/2~|12=:中國|疑|君主=책계왕;靑稽王',
		'/汾西王|298/11/21~|10=:中國|疑|君主=분서왕',
		'/比流王|304/12/14~|11=:中國|疑|君主=비류왕',
		'/契王|344/12/21~|11=:中國|疑|君主=계왕',
		'/近肖古王|346/10/31~|10=:中國|疑|君主=근초고왕',
		'/近仇首王|376/1/8~|12=:中國|疑|君主=근구수왕;諱須王',
		'/枕流王|384/6/5~|5=:中國|疑|君主=침류왕',
		'/辰斯王|386/1/17~|12=:中國|疑|君主=진사왕',
		'/阿莘王|392/12/30~|12=:中國|疑|君主=아신왕;阿芳王;河芳王',
		'/腆支王|405/11/8~|10=:中國|疑|君主=전지왕;直支王;真支王',
		'/久尒辛王|420/4/29~|4=:中國|疑|君主=구이신왕',
		'/毗有王|428/1/3~|12=:中國|疑|君主=비유왕',
		'/蓋鹵王|455/10/27~|10=:中國|疑|君主=개로왕;近蓋婁王',
		'/文周王|475/11/14~|10=:中國|疑|君主=문주왕;汶洲王;文明王',
		'/三斤王|477/10/23~|10=:中國|疑|君主=삼근왕;壬乞王;三乞王',
		'/東城王|479/12/29~|12=:中國|疑|君主=동성왕',
		'/武寧王|501/12/26~|12=:中國|疑|君主=무령왕;虎寧王',
		'/聖王|523/6/29~|6=:中國|疑|君主=성왕',
		'/威德王|554/9/13~|8=:中國|疑|君主=위덕왕',
		'/惠王|599/1/2~|12=:中國|疑|君主=혜왕;献王',
		'/法王|599/7/28~|7=:中國|疑|君主=법왕',
		'/武王|600/7/16~|6=:中國|疑|君主=무왕;武康王;武廣王;虎王',
		'/義慈王|641/5/15~660/8/11|4=:中國|疑|君主=의자왕',

		// 後三國時代

		'後百濟/甄萱/正開|901/1/23~936/10/17|:中國|疑|朝代=후백제|君主=견훤|年號=정개|據=時間規範資料庫',

		'摩震/弓裔|901/1/23~|:中國|疑|國號=마진;後高句麗;후가우리|君主=궁예|君主名=金弓裔|注=後高句麗(高麗)904年建國號摩震。911年又改國號為泰封。918年被部將王建的高麗所滅。《資治通鑒》中作「大封國」。|據=時間規範資料庫',
		'/=/武泰|904/1/21~|:中國|疑|年號=虎泰;무태',
		'/聖冊|905/2/7~|:中國|疑|年號=성책',
		'泰封/=/水德萬歲|911/2/2~|:中國|疑|國號=태봉;摩震|年號=수덕만세',
		'/政開|914/4/28~|4=:中國|疑|年號=정개',

		// 음력(陰曆)
		'음력|917/1/26~2051/2/10|917/=4nyy59g 5gi 3txi4b8 48a 3mw44z1 3prw47d 59g 4uq05go 5as 4gnp3fu 505 3psh47e 4pbv3tf 3hl 3b1j3px 3my 4mg3591 3sd84gy 5ea 3t534aa 449 3mmt42y 59h 3z2p4h0 4sqx5es 4ac 3qvb505 46i 4rkz5s9 3z8c4aw 5bc 4ihk3p0 57a 4fv958y 5sh 400i4b5 3ep648a 3p1 37x342t 58y 55c35uq 40984ic 48a 3mw946t 46i 4oet5dw 5us 40aq5as 4gne57u 505 3ql347d 5e1 3swj4a0 4plo3px 3oq 4mg9591 4gi 4so55ea 4aa 3b4y449 3mmy46i 5np 3z2u4h0 5es 3t504ac 3qz0505 46i 54895sa 4h4 4t913u0 52s 4g9e3me 4fve51u 5u9 400m4i9 3u1 3a903p1 39i442v 3o4 56x55uq 4ic 3rd148a 439 3mm95re 4oez5dw 5us 4pl35as 50q 4g4j505 3qks5u2 5e1 3swo4a1 3q1 32513oq 579 3qkx4gi 4sob5eq 4aa 3b5347t 42y 4o105np 4gy 4se95gk 3t6x52s 47u 3mna4zu 5r9 3z4i4i0 4t983u0 52s 4g9k3mi 56z 3qjo5sh 3ha 3eoi3u1 3a953p1 3oa 4mg659e 5ua 40824ic 3rd648a 439 3mmw46i 59g 57d05go 5as 3rcx50q 4cyx579 47e 4sh15e1 4a0 4poz3q1 32573oq 579 3wwo4gi 5e9 3t444aa 3q2 38gy42z 39gq5r9 4gy 4sp25es 4ac 3nt050a 3mp74zv 47d 3z4o4fc 5ew 4ih059w 4g9o3mi 577 3qju5u9 4i9 3eom3u1 3p1 380i3oq 4o1759g 5uq 40874ig 48a 3a91439 42y 4o0x5d0 57dl4a0 5as 3rd250q 505 3psj47e 4sh75e9 4a0 4pp33q1 3fw 4g4l579 4ei 4sgy5e9 3t4a4aa 3q1 3a1y431 3o5 4nyq4gy 4t3g5es 4ac 3qyw50a 42z 3mic47d 4h0 4t4y5ew 4ih559w 50a 4f53577 47d 400j4i9 3eos3u1 3p1 380o42y 591 3qrp5uq 4i9 3epu48a 3a95445 42y 4o135d1 49w 4pl05as 3rf050s 505 3pso462 5e1 3swk4a0 5aw 4gpe3ho 4fd6579 576 4sh25e9 4a9 3b503q1 3a23431 42d 4nyx59k 5eq 3t514ac 47u 3mox431 3mij47d 4h0 4t525ew 52s 4g8z50a 4fxn577 47d 55bc5ep 4aa 3b5x44a 431 2yfm42t 3z2y4h0 5es 3t6u4ac 47u 3mp04yz 3prw47d 4i0 4t8o5ew 52s 4g9h3mi 579 3qk149d 408b4i9 3u1 3a933p1 3oq 4mg3591 49e 40814ic 3sy048a 445 3mmt46i 5d1 3sr54a0 4pl55aw 50s 4g5j505 47e 4sdf5e1 3sik4b5 3qh 32543p1 3md 4m6t58y 5e9 3twi4b6 3bka47u 431 39h346d 59e 4t375gk 4b8 3bk147u 3mp54zx 46h 4oet4i0 5go 3tz75as 3qze3my 579 3qk749d 5ap 3g9f4a1 3b1n3px 3oq 4mg9591 49e 4pid5as 48i 3b1e445 3mmy46i 5d1 3sra4a0 5b8 3rlw52k 4g5o579 47e 550p5s9 3wo 4q393u1 3hw 4g5v3md 4m6z58y 5sh 3twn4b6 3qi 3a90431 3m5846d 59e 57bd5gk 4b8 3rd148a 431 3mmp47d 4of05e0 5go 4pl35as 50q 4fc4579 3wws49d 5e9 3swo4a1 3px 323a3oq 591 3qs24gx 4sob5es 4aa 3b4n445 42y 4o105r9 4h0 4sqp5es 3t6x52s 506 3psm4zu 5s9 3z824i0 4t973u1 3hw 4g5z3md 576 55435u9 4i9 3eoy3u2 3a95439 42e 4nyu59g 5uq 408y4ic 3rd650q 4vp 3mmw47d 5ac 57d05uw 5as 3rcx50q 4g4p579 47e 4sh15e9 4a0 4poz3px 38ez42y 591 3yon4gy 5e9 3t504aa 3q2 39zl42y 4o155r9 4h0 4t515ew 4ac 3nt0506 3pss56y 5s9 3z884i8 5ew 4ihg3p1 31p83o6 58y 554a5u9 5ap 3ep23u2 3p1 380i42u 4nz059g 5uq 40934ic 48a 3mw54z9 46i 4oep5dw 57d55uw 5as 3rdi3fu 505 3psj47e 4sh75e9 4a0 4ppj3q1 3my 4mg5591 4gi 4so25e9 3t564aa 3q2 3a0642y 5np 3z2q4h0 4t585ew 4ac 3nt450a 4yz 3pno5s9 4i0 4t8i5ew 4ihl3p1 3fe 4fvq58y 5s9 407n4i9 3ep748a 3p1 380o436 590 56x05uq 4ia 3ema48a 3mw9505 46i 4ofa5dw 5us 4pkz5as 3rdn3fu 505 3pso4ei 5e1 3swk4a8 5ax 324y3oq 4mga591 4gi 4so65ep 4aa 3b503q2 3a2342z 42t 3z2w4h0 5es 3t6s4ac 47u 3mox4yz 3pnv5s9 4i0 4t8m5ew 52s 4g9f3mi 4fvv58y 5s5 407r4i9 3u1 3a913p1 3mi 4mg3591 3sd349u 4ia 3rd248a 439 3mms46i 59h 3sr649w 4pl35as 50s 4c6d505 46e 4rkz5e1 3swo4a9 3q1 32523ot 3md 4fv858y 5e9 3twj4aa 3b5z4ey 3ot 39h142t 59e 4soz5eq 3t6v4ac 47u 3mp24z1 46d 4oes4i0 5ew 4igz4aa 4g9j3mi 579 3qk547l 4i9 3eoj3u1 3a943p1 3oq 4mg6591 49e 4pic5aq 48a 33xf439 3mmv4dm 59h 3sr949w 5as 3rlw50s 4g5l505 47e 4rl25e1 4a0 4q383qh 3fw 4g5v3md 4m6v58y 5e9 3t514b6 3qi 3a1w431 39i146d 59e 55c65gk 4b8 3o7948a 431 3mj646h 4oev5ag 5go 4j9h5as 50q 4fc3579 3ql649e 5e9 3z864a1 3px 32393oq 579 3qkz49e 4so75ec 48i 3b1h445 42y 4o105d1 4gy 4sqq5es 3rly52s 506 3mms4zu 5s5 3z4i4i0 4q3a3qh 3hw 4g5x3me 56y 55435sh 4b5 3bj63u2 3a92431 42e 4nys59e 5uq 3txf4b8 3rd348a 439 3mmt46i 59g 57d05uw 4pl55as 50q 4fc6579 47e 4pb85e9 4a0 4plf3px 323b3oq 579 3qs559e 5e9 3sxw4aa 3b60446 42y 4o135r9 4gy 4sqt5es 4ac 3nsz506 3pt44zu 5s9 3z4l4i0 5ew 4ihg3hx 31p63me 576 55465sh 4i9 3ep13u2 3p1 380j42e 4nyv59g 5uq 40914ic 48a 3a90439 42y 4o0y59g 57d25uw 5as 3rdh3fu 505 3psj47e 4sh45e9 4a0 4pph3q1 3my 4g4k591 4eq 4so25e9 3t464aa 3q2 38f942y 591 3yoi4gy 4sp35es 4ac 3nt1506 46j 3mhw5s9 4h0 4t4y5ew 4ihi3hx 3fe 4f3956y 5s9 3z834i9 3ep33u2 3p1 380m42e 58y 55c45uq 4ia 3epu48a 3a93439 42y 4o115d0 5us 40ar5as 3rd450q 505 3psm47e 5e1 3swk4a0 5aw 4gpf3my 4g4n591 4eq 4so55e9 4a9 3b503q2 3a0842z 3o5 3yom4h0 5es 3t504ac 3nt650a 4yz 3mhy5s9 4h0 4t515ew 52s 4g9f3fe 4f3c576 5s9 400l4i9 3u1 33xg3p1 3mi 4mg258z 3qrr5uq 4ia 3epx48a 439 3knn42y 4ofd5dx 49w 4pl15as 48a 3mw4505 46i 4of65e1 3swm4a0 5aw 4gph3n0 579 3qkz4gi 4sob5e9 4aa 3b523q2 3ot 37w542d 4gi 4soy5es 3t6v4ac 44a 3mp14yz 46d 3z4j|參照用|據=한국표준연력',

		'泰封/弓裔/政開|917/1/26~|4/=:음력',

		'高麗/太祖/天授|918/7/25~|:음력|注=高麗史1卷-世家1-太祖1-01-01-0918: (戊寅)元年夏六月丙辰，卽位于布政殿，國號高麗，改元天授。',
		// TODO: 16/=:後唐
		'=/=|933/4/2~|16/=:음력|注=高麗史2卷-世家2-太祖2-16-01-0933: 十六年春三月辛巳唐遣王瓊楊昭業來冊王..又賜曆日自是除天授年號行後唐年號',
		'=/惠宗|음력944~|:음력|注=高麗史2卷-世家2-惠宗-00-01-0000: (943年)二十六年五月丙午太祖薨奉遺命卽位.',
		'/定宗|음력946~|:음력|注=高麗史2卷-世家2-定宗-00-01-0000: (945年)惠宗二年九月戊申群臣奉王卽位.949年三月丙辰逝世。',
		'/光宗|음력:950~975|:음력|注=高麗史2卷-世家2-光宗-00-01-0000: (949年)定宗四年三月丙辰受內禪卽位.',
		'/=/光德|949/4/13~951/12/30|:음력|注=《고려사》에서는 950년을 광종 1년으로 잡고 있지만, 그때는 조선과는 달리 유년칭원법(踰年稱元法)을 쓰지 않았기 때문에 각종 금석문의 자료에서 나타나는 것처럼 949년을 광종 1년 즉 광덕 원년으로 보는 것이 타당하다.;高麗史2卷-世家2-光宗-02-02-0951: 冬十二月始行後周年號.;2年（951年） - 後周の年号の使用開始（『高麗史』光宗世家）。ただし、今西龍によると、光徳は4年まで続き、953年に後周の冊封を受けて広順の年号を使用したという。',
		'/峻豐|960/1/31~963/11/18|:음력|注=高麗光宗的峻豐年號，其實就是建隆年號，只是使用避諱代字。建隆的建避太祖王建的建改為峻，建隆的隆避世祖王隆的隆改為豐。',
		'=/景宗|음력976~|:음력',
		'/成宗|982/1/28~|:음력',
		'/穆宗|998/1/31~|:음력',
		'/顯宗|1010/1/18~|:음력',
		'/德宗|1032/2/14~|:음력',
		'/靖宗|1035/2/11~|:음력',
		// 遼史/第44卷/志14/歷象誌下
		// 宋元豐元年十二月，詔司天監考遼及高麗、日本國歷與《奉元歷》同異。遼己未歲氣朔與《宣明歷》合，日本戊午歲與遼歷相近，高麗戊午年朔與《奉元歷》合，氣有不同。
		'/文宗|1047/1/29~|:음력',
		'/順宗|1083/1/21~|:음력',
		'/宣宗|1084/2/9~|:음력',
		'/獻宗|1095/2/8~|:음력',
		'/肅宗|1096/1/28~|:음력',
		'/睿宗|1106/2/6~|:음력',
		'/仁宗|1123/1/29~|:음력',
		'/毅宗|1147/2/2~|:음력',
		'/明宗|1171/2/7~|:음력',
		'/神宗|1198/2/8~|:음력',
		'/熙宗|1205/1/22~|:음력',
		'/康宗|1212/2/5~|:음력',
		'/高宗|1214/2/12~|:음력',
		'/元宗|1260/2/13~|:음력',
		'/忠烈王|1275/1/29~|:음력',
		'/忠宣王|1309/2/11~|:음력',
		'/忠肅王|1314/1/17~|:음력',
		'/忠惠王|1331/2/8~|:음력',
		'/忠肅王/後|1332/2/27~|:음력|注=高麗史35卷-世家35-忠肅王2-17-02-1330: (十七年)秋閏七月甲申王如元.[王傳國後至復位凡二十四月在忠惠世家.]|注=高麗史36卷-世家36-忠惠王-02-01-1332: (壬申)二年[二月以後,入忠肅後元年]|注=高麗史35卷-世家35-忠肅王2-후8-01-1339: 八年春三月癸未王薨于寢. 在位前後二十五年壽四十六',
		'/忠惠王/後|1340/1/29~|:음력',
		'=/忠穆王|1345/2/3~|:음력',
		'/忠定王|1349/1/19~|:음력',
		'/恭愍王|1352/1/18~|:음력|注=Wikipedia: 高麗王朝自1370年起始行大明年號，朝鮮王朝1392年建立後沿用大明年號',
		'/禑王|1375/2/1~|:음력',
		'/昌王|1388/2/8~|:음력',
		'/恭讓王|1389/1/28~|:음력',

		'大為國/妙清/天開|음력1135~1136/3/23|:음력|注=高麗史16卷-世家16-仁宗2-12-57-1134: (高麗仁宗12年)十二月戊寅右正言黃周瞻希妙淸鄭知常意奏請稱帝建元不報(高麗仁宗14年2月)丁巳金富軾會諸軍攻西京城陷趙匡自焚死|注=高麗史16卷-世家16-仁宗2-13-17-1135: 以天開表其年元以忠義號其軍額',

		// 李氏朝鮮
		'朝鮮/太祖|1392/8/5~|:음력|國號=大朝鮮國;朝鮮國|注=朝鮮王朝實錄/太祖康獻大王實錄/元年 洪武二十五年 七月十七日丙申, 太祖卽位于壽昌宮。|注=Wikipedia: 朝鮮沿用大明年號',
		'/正宗|1399/2/6~|:음력',
		'/太宗|1401/1/15~|:음력',
		'/世宗|1419/1/26~|:음력',
		'/文宗|1451/2/2~|:음력',
		'/端宗|1453/2/9~|:음력',
		'/世祖|1455/1/18~|:음력',
		'/睿宗|1469/1/13~|:음력',
		'/成宗|1470/2/1~|:음력',
		'/燕山君|1495/1/26~|:음력',
		'/中宗|1506/1/24~|:음력',
		'/仁宗|1545/1/13~|:음력',
		'/明宗|1546/2/1~|:음력',
		'/宣祖|1568/1/29~|:음력',
		'/光海君|1609/2/5~|:음력',
		'/仁祖|1623/1/31~|:음력',
		'/孝宗|1650/2/1~|:음력',
		'/顯宗|1660/2/11~|:음력',
		'/肅宗|1675/1/26~|:음력',
		'/景宗|1721/1/28~|:음력',
		'/英祖|1725/2/13~|:음력',
		'/正祖|1777/2/8~|:음력',
		'/純祖|1801/2/13~|:음력',
		'/憲宗|1835/1/29~|:음력',
		'/哲宗|1850/2/12~|:음력',
		'/高宗|1864/2/8~|:음력|君主名=李載晃;이재황;李㷩;이희|注=高宗接管大權後，經常需要明成皇后閔妃幫忙打理國內外事務。',
		'/=/開國|1894/7/27~|503/=:음력|注=以朝鮮王朝開國之年（1392年）為元年，金弘集進行甲午改革，1894年7月27日採用。',
		'/建陽|1896~|:CE|注=1896年採用西曆，同時改元建陽。',
		'/光武|1897/8/16~|:CE|注=1897年8月16日改元光武，10月12日高宗稱帝，改國號大韓帝國',
		'大韓帝國/=/=|1897/10/12~|:CE|注=國號:大韓帝國',
		'/純宗/隆熙|1907/8/2~|:CE|注=1907年7月20日–1910年8月22日期間在位。1910年8月29日日韓併合，廢除隆熙年號。',

		'일제 강점기/明治天皇/明治|1910/8/29~|43/=:CE|注="日帝强占期"應從日本年號。|注=일제시대(日帝時代), 일본 통치기(日本統治期), 왜정 시대(倭政時代), 왜치 시대(倭治時代), 일정 시대(日政時代)',
		'/大正天皇/大正|1912/7/30~|:CE|注="日帝强占期"應從日本年號。',
		'/昭和天皇/昭和|1926/12/25~1945/8/15|:CE|注="日帝强占期"應從日本年號。',

		'大金/大金皇帝|음력1453~1453/10/20|:음력|君主名=李澄玉|生=1399年|卒=1453/10/20年|注=武臣李澄玉叛亂朝鮮朝廷，因為咸吉道是女真人居住區，是金國故地，於是李澄玉自稱大金皇帝',

		'대한민국/대한민국/대한민국|1919/3/1~|:CE|紀年=大韓民國|注=대한민국 임시 정부는 1919년 4월 11일, 날짜를 "대한민국 원년 4월 11일"로 표기한 대한민국 임시헌장을 제정·공포하면서부터 이 연호를 공식적인 기년법(紀年法)으로 채택하여 입법, 재정, 외교, 군사문서는 물론 한인애국단, 한국광복군 등 산하기관의 서류를 포함한 모든 공문서에 사용하였다.',
		'/단군기원|1948/9/25~|4281/=:CE|紀年=檀君紀元;단기;檀紀|注=이가 단군(檀君)이며 국호(國號)는 조선(朝鮮)이었는데, 바로 당요(唐堯) 무진년(戊辰年: 기원전 2333년)이었다.',
		'/서력기원|1962~' + CeL.era.pass_on.last_day
				+ '|1962/=:CE|紀年=西曆紀元;약칭 서기;西紀',

		// 主體年號 e.g., "主體107年" http://www.rodong.rep.kp/cn/
		'조선//주체연호|1912~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|紀年=主體;주체;主體|政權=朝鮮;공화국;조선민주주의인민공화국;朝鮮民主主義人民共和國|注=주체력(主體曆)|注=朝鮮民主主義人民共和國成立以來一直以西曆紀元。1997年7月8日，朝鮮開始實行主體年號。追尊主體思想創立人及朝鮮建國者金日成的出生年1912年為主體元年。'

]).minute_offset = 9 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"vietnam"}
(CeL.era.pass_on.countries['Việt Nam'] = [

		// https://vi.wikipedia.org/wiki/Ni%C3%AAn_bi%E1%BB%83u_l%E1%BB%8Bch_s%E1%BB%AD_Vi%E1%BB%87t_Nam

		'蜀/安陽王|-257~||精=年|君主名=蜀泮',

		// Bắc thuộc, Thời kỳ phong kiến phương Bắc đô hộ, 北屬時期, 北属期
		// Thời phong kiến phương Bắc đô hộ
		// gettext_config:{"id":"chinese-domination-of-vietnam","mark_type":"part_of_string"}
		'南越/武帝|-208/11/25~|:中國|準=年|朝代=趙朝|君主名=趙佗|時期=Bắc thuộc|注=《欽定越史通鑑綱目·卷之一》67頁：「甲午趙武王元年秦二世三年」。該年當系趙佗成為南海郡太守的年份。|注=約前203年，趙佗以番禺為都城在嶺南地區建立南越國，自稱「南越武王」。|注=目前越南大部分學者亦不承認趙朝，僅有少數人堅持認為趙朝是越南的一個朝代。',
		'/文王|-137~|:中國|準=年|君主名=趙眜;趙胡|注=「趙胡」係《史記》所載南越文王之名。據1983年發現的南越王墓中所發掘的文物，文王的真實名字應是「趙眜」。',
		'/明王|-125~|:中國|準=年|君主名=趙嬰齊',
		'/哀王|-113~|:中國|準=年|君主名=趙興',
		'/術陽侯|-112~-111|:中國|準=年|君主名=趙建德|君主=高昌侯',

		'徵/徵女王|40/2/2~43/7/25|:中國|準=年|君主名=徵側;徵貳;𠄩婆徵;二徵夫人;徵氏姐妹|時期=Bắc thuộc|君主性別=女',

		'士/士王|187/1/27~|:中國|準=年|君主名=士燮;士爕|時期=Bắc thuộc|注=欽定越史通鑑綱目:士爕',
		'/士徽|226/2/16~227/2/3|:中國|準=年|注=226年，士燮病逝，年90歲。兒子士徽背叛吳國而自立，最終為東吳攻滅。|注=為使"士王40年"存，稍改本條起始日。',
		// 趙嫗;趙氏貞;趙貞娘，225年－248年 248年孫吳起義領袖，被越南人視為民族英雄。尚有待考證。

		'前李/南帝|542/1/2~|:中國|準=年|君主=李南帝|君主名=李賁|時期=Bắc thuộc|注=李賁於541年十二月集合交州數州人士起兵。',
		'/=/天德|544/2/9~|:中國|準=年|君主=南越帝|國號=萬春|年號=大德|注=大越史記全書:甲子天德元年梁大同十年春正月，帝因勝敵，自稱南越帝，即位建元，置百官，建國號曰萬春，望社稷至萬世也。|注=鄧洪波 東亞歷史年表: 正月，李賁稱帝，國號爲萬春國，建元大德，是爲南帝。',
		'=/趙越王|548/4/13~571/2/10|:中國|準=年|君主名=趙光復|注=大越史記全書外紀卷之四: 春三月辛亥，南帝在屈獠洞中，日久，肙瘴病薨。',
		'/桃郎王|549/2/13~|:中國|準=年|君主名=李天寶|國號=野能',
		'/李佛子|555/2/7~|:中國|準=年',
		'/後李南帝|571/2/11~603/2/15|:中國|準=年|君主名=李佛子|朝代=後李',

		'梅/黑帝|722/9/2~12/31|:中國|準=年|君主名=梅叔鸞|時期=Bắc thuộc|注=新唐書:（玄宗開元）十年..七月..丙戌，安南人梅叔鸞反，伏誅。',

		// Thời kỳ độc lập, 獨立時期, 独立王朝時代

		// gettext_config:{"id":"late-dynastic-epoch","mark_type":"part_of_string"}
		'吳/前吳王|939/1/23~|:中國|準=年|君主名=吳權|時期=Thời kỳ độc lập',
		'/楊三哥|945/2/15~|:中國|準=年|君主=楊平王|君主名=楊紹洪',
		'/天策王|951/2/9~954|:中國|準=年|君主名=吳昌岌|注=與弟共治',
		'/後吳王|951/2/9~|:中國|準=年|君主名=吳昌文|注=與兄吳昌岌共治',
		'/吳使君|966/1/25~|:中國|準=年|君主名=吳昌熾',

		'丁/先皇帝/太平|968/2/2~|:中國|準=年|國號=大瞿越|君主名=丁部領|時期=Thời kỳ độc lập',
		'/=/太平|970/2/9~|:中國|準=年',
		'/廢帝/=|979/10/24~|:中國|準=年',

		'前黎/太祖/天福|980/8/14~|:中國|準=年|君主名=黎桓|君主=黎大行|時期=Thời kỳ độc lập|注=大越史記全書本紀卷之一: 庚辰十一年廢帝仍太平年號，七月以後，黎大行天福元年。',
		'/興統|989/2/9~|:中國|準=年',
		'/應天|994/2/13~|:中國|準=年',
		'/中宗/=|1005/11/5~|12/=:中國|準=年|諱=龍鉞|注=大行皇帝崩後，帝與東城、中國二王，及同母弟開明王爭立，相持八月，中國無主。冬十月，東城王敗奔莒隆，帝追捕之，又奔占城，未至，為石河州人殺于機羅海口今奇羅是也。時國人亦奔附禦北王於扶蘭寨。帝郎位三日，為龍鋌所殺，群臣皆奔亡，惟殿前軍李公蘊抱屍而哭。龍鋌立，追諡帝曰中宗皇帝，拜公蘊四廂軍副指揮使。',
		'/莊宗/=|1005/12/4~|12/=:中國|準=年|君主名=黎至忠|諱=龍铤',
		'/景瑞|1008/2/10~|:中國|準=年|注=冬十月辛亥，帝崩于寢殿，號臥朝..是月癸丑日，李公蘊自立為帝。',

		'後李/太祖/=|1009/11/21~|2/=:中國|準=年|君主名=李公蘊|時期=Thời kỳ độc lập',
		'/順天|1010/1/18~|:中國|準=年',
		'/太宗/天成|1028/4/1~|:中國|準=年|君主名=李德政|注=順天..十九年..三月..己亥，太子佛瑪即位於柩前。尊母黎氏曰靈顯太后。大赦，改元天成元年。',
		'/通瑞|1034/4/21~|:中國|準=年|注=四月..是月改元通瑞元年',
		'/乾符有道|1039/6/25~|:中國|準=年|注=六月，群臣請改元曰乾符有道，及增尊號曰金湧銀生儂平藩伏八字。',
		'/明道|1042/12/15~|:中國|準=年|注=冬十月..詔改元明道元年',
		'/天感聖武|1044/11/23~|:中國|準=年|注=冬十一月，賜伐占城有功者，六品以上錦袍，七品以下羅衣。群臣請改元曰天感聖武，增號曰聖德天感宣威聖武八字。',
		'/崇興大寶|1049/4/5~|:中國|準=年|注=己丑六年 三月以後崇興大寶元年，宋皇祐元年 春二月，改元崇興大寳元年。',
		'/聖宗/龍瑞太平|1054/11/3~|:中國|準=年|君主名=李日尊|注=冬十月一日，帝崩于長春殿。太子即位于柩前，改元龍瑞太平元年。追尊大行皇帝，謚庙號太宗，母枚氏為金天皇太后。建國號曰大越。',
		'/彰聖嘉慶|1059/2/15~|:中國|準=年',
		'/龍章天嗣|1066/2/24~|:中國|準=年|注=春正月二十五日亥時，皇子乾德生。後日立爲皇太子，改元大赦',
		'/天貺寳象|1068/3/7~|:中國|準=年|年號=天貺寶象|注=二月以後天貺寳象元年，宋神宗熙寧元年。按清化珉昇平塔記，以是年爲神武元年也。..真登州獻白象二，因此改元天貺寳象元年。',
		'/神武|1069/7/21~|:中國|準=年|注=秋七月，帝還自占城，獻俘于太廟，改元神武元年。',
		'/仁宗/太寧|1072/2/1~|:中國|準=年|君主名=李乾德|注=春正月庚寅，帝崩于會僊殿。..皇太子乾德即位于柩前，改元太寕元年。時方七歲',
		'/英武昭勝|1076/5/6~|:中國|準=年|注=夏四月，赦改元英武昭勝元年。',
		'/廣祐|1085/1/29~|:中國|準=年',
		'/會豊|1092/9/5~|:中國|準=年|年號=會豐|注=秋八月，改元會豊元年。',
		'/龍符|1101/1/31~|:中國|準=年|注=春正月，改元',
		'/會祥大慶|1110/1/22~|:中國|準=年',
		'/天符睿武|1120/2/1~|:中國|準=年|注=春正月，朔，群臣上表勸加上尊號，仍請改元。',
		'/天符慶壽|1127/2/13~|:中國|準=年|注=丁未天符慶壽元年宋靖康二年，五月以後高宗構建炎元年。',
		'/神宗/=|1128/1/15~|:中國|準=年|君主名=李陽煥|注=十二月..丁卯，帝崩于永光殿。..皇太子即位于柩前',
		'/天順|1128/2/3~|:中國|準=年|注=春正月丙戌，朔，改元大赦。',
		'/天彰寶嗣|1133/2/7~|:中國|準=年',
		'/英宗/=|1138/10/31~|6/=:中國|準=年|君主名=李天祚|注=九月..二十六日，帝崩于永光殿殯于殿之西陛。群臣上尊號曰廣仁崇孝文武皇帝，廟號神宗。',
		'/紹明|1138/11/5~|:中國|準=年|注=冬十月，朔，皇太子天祚即位于柩前，年方三歲，改元紹明元年。',
		'/大定|1140/2/20~|:中國|準=年|注=二月，改元大定元年',
		'/政隆寳應|1163/2/5~|:中國|準=年|年號=政隆寶應|注=政隆寳應元年..宋封帝爲安南國王，改交趾爲安南國。',
		'/天感至寳|1174/3/5~|:中國|準=年|年號=天感至寶|注=二月，改元天感至寳元年。',
		'/高宗/=|1175/8/14~|2/=:中國|準=年|君主名=李龍𣉙;李龍翰|注=秋七月，乙巳，帝崩于瑞光殿。..太子龍𣉙即位于柩前',
		'/貞符|1176/2/13~|:中國|準=年|注=春正月，改元大赦。',
		'/天資嘉瑞|1186/7/18~|:中國|準=年|注=秋七月，獲白象，賜名天資，詔改元天資嘉瑞元年。',
		'/天嘉寳祐|1202/8/19~|:中國|準=年|年號=天嘉寶祐|注=秋八月，皇次子忱生，改元天嘉寳祐元年。',
		'/治平龍應|1205/3/22~|:中國|準=年|注=大越史記全書:春三月，改元治平龍應元年。|注=越史略:九月壬辰(1205/10/22)，改元為平治龍應元年。',
		'/惠宗/=|1210/11/15~|:中國|準=年|君主名=李旵|注=大越史記全書:庚午六年宋嘉定三年..冬十月，帝弗豫，召杜敬脩受顧託命。二十八日(27?)壬午，帝崩于聖壽宫。|注=越史略:冬十月，王不豫。壬午，王寢疾，忽見二青衣執杖立座側，王問執杖者為誰，左右曰：“無所見。”是夜，王薨於勝夀殿，年三十七。',
		'/建嘉|1211/1/17~|:中國|準=年|注=春正月，改元。',
		'/昭皇/天彰有道|1224/11/13~|:中國|準=年|君主名=李佛金;李天馨|君主性別=女|注=大越史記全書:冬十月，詔昭聖公主爲皇太子以傳位，帝出家，居大内真教禪寺。昭聖即位，改元天彰有道元年，尊號曰昭皇。|注=越史略:乙酉建嘉十五年..六月，王遜位於第二昭聖公主，諡昭王。尊王為太上王。改元天彰有道。',

		'陳/太宗/建中|1226/1/10~|:中國|準=年|君主名=陳日煚;陳煚|時期=Thời kỳ độc lập|注=大越史記全書:本月二十一日(戊寅)，群臣進朝拜賀。..十二月十一日戊寅(丁酉?)，昭皇設大會于天安殿御寳床，百官朝服，進朝拜于庭下。昭皇乃降服，勸進陳煚即皇帝位。改元建中元年|注=越史略:乙酉建嘉十五年..十二月初一日受禪，即位於天安殿，尊順貞皇后為太后，降昭王為昭聖王后，改元建中。',
		'/天應政平|1232/8/10~|:中國|準=年|注=秋七月二十二日，改元天應政平元年。',
		'/元豊|1251/2/22~|:中國|準=年|年號=元豐|注=春二月改元元豊元年。',
		'/聖宗/紹隆|1258/3/30~|:中國|準=年|君主名=陳光昺|注=戊午八年..二月二十四日，帝傳位于皇太子晃，遜居北宫。|注=陳氏家法..子既長，即使承正位，而父退居聖慈官，以上皇稱，同聽政，其實但傳大器，以定後事，備倉卒爾，事皆取決於上皇，嗣主無異於皇太子也。',
		'/寶符|1273/1/21~|:中國|準=年|注=春正月朔，改元。',
		'/仁宗/紹寶|1278/11/8~|:中國|準=年|君主名=陳日烜|注=寶符六年..冬十月二十二日，帝禪位于皇太子昑。',
		'/重興|1285/9/30~|:中國|準=年|注=九月，改元重興元年。大赦。',
		'/英宗/興隆|1293/4/16~|:中國|準=年|君主名=陳烇|注=春三月九日，帝禪位於皇太子烇即皇帝位。改元興隆元年，大赦。',
		'/明宗/大慶|1314/4/3~|:中國|準=年|君主名=陳奣|注=春三月，勑中書頒本朝名諱，增入寕皇及宣慈保慈二太后諱。十八日，帝禪位於皇太子奣。奣即皇帝位，改元大慶元年。大赦，稱寕皇。',
		'/開泰|1324/1/27~|:中國|準=年|注=春正月朔，改元。',
		'/憲宗/開祐|1329/3/7~|:中國|準=年|君主名=陳旺|注=春二月七日，冊東宫太子旺為皇太子。十五日，禪位。旺即皇帝位，改元開祐元年，大赦。稱哲皇。',
		'/裕宗/紹豐|1341/10/2~|:中國|準=年|君主名=陳日煃|注=秋八月二十一日，上皇迎皇子暭即皇帝位，改元紹豊元年，大赦，稱裕皇。',
		'/大治|1358/2/9~|:中國|準=年|注=春正月朔，改元。',
		'/昏德公/大定|1369/7/18~|:中國|準=年|君主名=陳日禮;楊日禮|注=夏五月..二十五日，帝崩于正寝，廟號裕宗。|注=六月..十五日，憲慈皇太后使人迎故恭肅大王昱庶子日禮即位，改元大定元年。',
		'/藝宗/紹慶|1370/12/3~|:中國|準=年|君主名=陳暊|注=十一月，帝及恭宣、天寕俱領軍回京。十三日至建興府舊名顯慶，下令廢日禮為昏德公。十五日，即皇帝位，改元大赦，稱義皇。',
		'/睿宗/隆慶|1373/1/24~|:中國|準=年|君主名=陳曔|注=十一月九日，帝禪位于皇太子曔，曔即皇帝位，大赦，稱欽皇。..春正月，朔，改元。',
		'/廢帝/昌符|1377/6/19~|:中國|準=年|君主名=陳晛|注=夏五月十三日，上皇以帝當國難崩，立帝長子建德大王暊為嗣，即皇帝位。稱簡皇，改元昌符元年，大赦。|注=《明史》作陳日煒',
		'/順宗/光泰|1389/1/24~|:中國|準=年|君主名=陳顒|注=十二月..二十七日，上皇立少子昭定王顒為皇帝。顒即位改元光泰元年，大赦，稱元皇。',
		'/少帝/建新|1398/4/2~|:中國|準=年|君主名=陳𤇼|注=春三月十五日，黎季犛逼帝禪位于皇太子𤇼(上安/下火)。',

		'胡/國祖/聖元|1400/3/26~|:中國|準=年|君主名=胡一元;黎季犛|注=原名黎季犛|國號=大虞|諡=章皇帝|時期=Thời kỳ độc lập|注=建新二年..夏四月，季犛逼令帝出家..六月，季犛自稱國祖章皇..庚辰三年 是歲陳亡。三月以後季犛篡國，稱聖元元年..二月二十八日，黎季犛逼帝禪位，及劫宗室群臣三上表勸進，偽為固辞曰：「大地有期，將何面目見先帝於地下乎。」已而，自為帝，建元聖元，國號大虞，改姓胡。',
		'/胡漢倉/紹成|1401/1/15~|:中國|準=年|君主名=胡𡗨|注=庚辰三年..冬十二月..季犛以位與其子漢蒼，自稱太上皇，同聽政。|注=《明實錄》和《明史》稱之為胡𡗨|注=紹成元年..春二月..漢蒼改陳氏協紀曆，行順天曆。',
		'/開大|1403/1/23~|:中國|準=年|注=開大四年..十二月..十二日..明人入東都',

		'後陳/簡定帝/興慶|1407/11/1~|:中國|準=年|君主名=陳頠|時期=Thời kỳ độc lập|注=冬十月初二日，簡定帝即位于長安州謨渡，建元興慶。',
		'/重光帝/重光|1409/4/2~1413/12/22|:中國|準=年|君主名=陳季擴|注=三月十七日，帝御位於支羅，改元重光|注=癸巳五年..十一月..帝奔老撾..陳遂亡。',

		// 初黎朝, Nhà Lê sơ
		'初黎/太祖/順天|1428/1/17~|:中國|準=年|君主名=黎利|國號=大越|朝代=後黎|時期=Thời kỳ độc lập|注=春正月，明人既還國，帝遂混一天下，以是年爲大定之年。',
		'/太宗/=|1433/10/20~|6/=:中國|準=年|君主名=黎元龍|注=秋九月八日，太子元龍即皇帝位，大赦改元，以明年為紹平元年。',
		'/紹平|1434/2/9~|:中國|準=年',
		'/大寶|1440/2/3~|:中國|準=年|注=十一月，大赦改元。期以明年正月改大寶初年，大赦天下。',
		'/仁宗/=|1442/9/15~|:中國|準=年|君主名=黎邦基|在位=1442年8月(1442/9/4)-1459年10月(1459/11/25)|注=壬戌三年..八月四日，帝至嘉定縣茘枝園，遽得虐疾崩。..十二日大臣鄭可、阮熾、黎受等受遺命，與黎列、黎盃等奉皇太子邦基即位。年方二歲，以明年為大和元年。',
		'/大和|1443/1/31~|:中國|準=年',
		'/延寧|1454/1/29~|:中國|準=年|注=癸酉十一年..冬十一月..二十一日，帝初親政，改元大赦，以明年正月為延寧元年。',
		'/前廢帝/天興|1459/11/1~|:中國|準=年|君主名=黎宜民|注=己卯六年 明天順三年 冬十月三日，諒山王宜民夜作梯，分三道上東門城，盗入宫禁。帝及宣慈皇太后俱遇害。..初七日，諒山王宜民自立即皇帝位，大赦，改元天興 十月三日以前著延寧六年七日，以後著宜民天興元年。..迺於今年十月初七日即位，改號天興。',
		'/聖宗/光順|1460/6/26~|:中國|準=年|君主名=黎灝|注=光順元年 六月以前宜民僣稱天興二年..六月..初八日帝即位于祥光殿改元光順元年大赦天下',
		'/洪德|1470/2/1~|:中國|準=年|注=己丑十年..冬十一月十六日大赦改元以明年為洪德元年',
		'/憲宗/=|1497/3/9~|:中國|準=年|君主名=黎暉|注=丁巳二十八年..春正月..三十日壬子帝崩于寶光殿..至今年春正月三十日辰時崩于寶光宮..二月..初六日戊寅太保平涼侯黎志兵部上書定功伯鄭公旦西軍都督府左都督崇溪伯黎永就弘文殿奉迎皇太子即位以明年改為景統元年',
		'/景統|1498/1/22~|:中國|準=年',
		'/肅宗/泰貞|1504/7/17~|:中國|準=年|君主名=黎敬甫|注=甲子七年..五月..二十四日帝崩于圖治殿..六月初六日中軍都督府左都督屏山侯黎廣度南軍都督府左都督駙馬都尉臨淮伯黎達昭暨駙馬五府六部東閣翰林院六寺科臺等官詣皇極殿奉皇太子㵮即位 大赦 改元以是年爲泰貞元年',
		'/威穆帝/=|1505/1/22~|:中國|準=年|君主名=黎濬|注=十二月..八日甲子崩于皇極殿..十八日甲戌中軍都督府左都督屏山侯黎廣度宗人令叙恩使黎能讓暨公侯伯駙馬都尉五府六部御史臺東閣翰林六寺六科提刑十三道等官詣興明殿奉迎憲宗第二子濬即皇帝位 大赦改元以明年爲端慶元年',
		'/端慶|1505/2/4~|:中國|準=年',
		'/襄翼帝/洪順|1510/1/10~|:中國|準=年|君主名=黎瀠',
		'/昭宗/光紹|1516/5/2~|:中國|準=年|君主名=黎椅',
		'/黎榜/大德|1518/2/10~|:中國|準=年',
		'/黎槱/天憲|1518/2/10~|:中國|準=年',
		'/恭帝/統元|1522/8/21~|:中國|準=年|君主名=黎椿|在位=1522年7月(1522/7/23)-1527年6月(1527/7/28)',
		//
		'莫/太祖/明德|1527/6/28~|:中國|準=年|君主名=莫登庸|時期=Thời kỳ độc lập',
		'/太宗/大正|1530/1/29~|:中國|準=年|君主名=莫登瀛',
		'/憲宗/廣和|1541/1/27~|:中國|準=年|君主名=莫福海|在位=1540年1月(1540/2/8)-1546年5月(1546/6/28)',
		'/宣宗/永定|1547/1/22~|:中國|準=年|君主名=莫福源|在位=1546年5月(1546/5/29)-1561年12月(1562/2/4)',
		'/景曆|1548/2/10~|:中國|準=年',
		'/茂洽/淳福|1562/2/4~|:中國|準=年|在位=1561年12月(1562/1/5)-1592年1月(1592/3/14)',
		'/崇康|1566/1/21~|:中國|準=年',
		'/延成|1578/2/7~|:中國|準=年',
		'/端泰|1586/2/18~|:中國|準=年',
		'/興治|1588/1/28~|:中國|準=年',
		'/洪寧|1591/1/25~|:中國|準=年',
		'/景宗/武安|1592/2/13~|:中國|準=年|君主名=莫敬邦',
		'/閔宗/寶定|1593/1/3~|:中國|準=年|君主名=莫敬止',
		'/康佑|1593/2/1~|:中國|準=年',
		'/代宗/乾統|1593/3/3~1625/2/6|:中國|準=年|君主名=莫敬恭',
		'/光祖/隆泰|1618/1/26	~|:中國|精=年|準=年|君主名=莫敬寬|《欽定越史通鑑綱目》莫敬寬於1618年建元隆泰，之後與父親莫敬恭分據高平。',
		'/永祚|1625/2/7~|:中國|精=年|準=年|注=1625年，後黎朝討滅莫敬恭，莫敬寬投降，被封為太尉通國公，以後莫朝開始使用後黎朝的年號，直到1638年，改元順德。',
		'/明宗/順德|1638/2/14~1678/1/22|:中國|精=年|準=年|君主名=莫敬宇|注=1638年莫敬寬死後繼位，改年號為順德（Thuận Đức）。1677年，鄭柞借黎熙宗的名義，以丁文左、阮有登等為將，再次討伐盤踞高平的莫氏。莫敬宇兵敗，逃往中國廣西的龍州。',
		// 中興黎朝, Nhà Lê trung hưng 國號:大越國
		'後黎/莊宗/元和|1533/1/25~|:中國|準=年|君主名=黎寧|時期=Thời kỳ độc lập',
		'/中宗/順平|1549/1/29~|:中國|準=年|君主名=黎暄|在位=1548年1月(1548/2/10)-1556年(1557/1/30)',
		'/英宗/天祐|1557/1/30~|:中國|準=年|君主名=黎維邦|在位=1556年(1556/2/11)-1572年(1573/2/2)',
		'/正治|1558/1/20~|:中國|準=年',
		'/世宗/洪福|1572/1/15~|:中國|準=年|君主名=黎維禫',
		'/嘉泰|1573/2/2~|:中國|準=年',
		'/光興|1578/2/7~|:中國|準=年',
		'/敬宗/慎德|1600/2/14~|:中國|準=年|君主名=黎維新|在位=1599年7月(1599/8/21)-1619年5月(1619/7/11)',
		'/弘定|1600/12/6~|:中國|準=年',
		'/神宗/永祚|1619/7/11~|:中國|準=年|君主名=黎維祺',
		'/德隆|1629/4/23~|:中國|準=年',
		'/陽和|1635/11/10~|:中國|準=年',
		'/真宗/福泰|1643/11/11~|:中國|準=年|君主名=黎維祐;黎維禔|注=1643年，鄭梉脅迫黎神宗禪位給兒子黎維祐。1648年，鄭梉挾持黎真宗南下討伐阮主，在長德大敗，御林軍（鄭軍）損失慘重。此時黎真宗死去（有些人認為黎真宗之死是這場戰役所導致的），黎神宗復位。',
		'/神宗/慶德|1649/11/4~|:中國|準=年|注=1648年，鄭阮戰爭後，黎真宗死去，黎神宗復位。',
		'/盛德|1653/2/28~|:中國|準=年',
		'/永壽|1658/3/4~|:中國|準=年',
		'/萬慶|1662/10/12~|:中國|準=年',
		'/玄宗/景治|1663/2/8~|:中國|準=年|君主名=黎維禑|在位=1662年11月(1662/12/11)-1671年10月(1671/12/1)',
		'/嘉宗/陽德|1672/1/30~|:中國|準=年|君主名=黎維禬|在位=1671年10月(1671/11/2)-1675年4月(1675/5/25)',
		'/熙宗/永治|1676/2/14~|:中國|準=年|君主名=黎維祫|在位=1675年4月(1675/4/25)-1705年4月(1705/5/23)',
		'/正和|1680/11/21~|:中國|準=年',
		'/裕宗/永盛|1705/1/25~|:中國|準=年|君主名=黎維禟|在位=1705年4月(1705/4/23)-1729年(1730/2/17)',
		'/保泰|1720/2/8~|:中國|準=年',
		'/後廢帝/永慶|1729/1/29~|:中國|準=年|君主名=黎維祊',
		'/純宗/龍德|1732/9/19~|:中國|準=年|君主名=黎維祥',
		'/懿宗/永佑|1735/1/24~|:中國|準=年|君主名=黎維振|在位=1735年4月(1735/4/23)-1740年4月(1740/5/25)',
		'/顯宗/景興|1740/4/26~|:中國|準=年|君主名=黎維祧',
		'/愍帝/昭統|1787/2/18~1790/2/13|:中國|準=年|君主名=黎維祁;黎維謙|在位=1786年6月(1786/6/26)-1789年1月(1789/2/25)|時期=Thời kỳ độc lập',
		//
		'西山朝/阮文岳/泰德|1778/1/28~|:中國|準=年|時期=Thời kỳ độc lập|政權=歸仁朝廷;歸仁政府|在位=1776年(1776/2/19)-1793年(1794/1/31)',
		'/阮太祖/光中|1788/12/22~|:中國|準=年|君主名=阮惠;阮文惠;阮光平|注=十一月二十五日，阮惠在御屏山登基稱帝，改年號為「光中」。',
		'/阮光纘/=|1792/9/16~|:中國|準=年|注=1792年，阮惠逝世，遺命由阮光纘繼位，讓陳文紀、陳光耀輔政。阮光纘登基稱帝，改元景盛，當時年僅十歲。',
		'/景盛|1793/2/11~|:中國|準=年|在位-1802/7/22(1802/8/28)',

		// <a
		// href="https://vi.wikipedia.org/wiki/Ni%C3%AAn_hi%E1%BB%87u_Vi%E1%BB%87t_Nam"
		// accessdate="2014/3/13 23:29">Niên hiệu Việt Nam</a>

		'Âm lịch|1800/1/25~'
				+ CeL.era.pass_on.last_day
				+ '|1800/=3psj47e 5s5 3z4h4aw 4q3c3qh 3hw 4g5y3md 56y 55425sh 4b5 3bj63u2 3a92431 42e 4nys59e 5uq 3txf4b8 3rd348a 439 3mmt46i 59g 57d05uw 4pl55as 50q 4fc6579 47e 4pb85e9 4a0 4plv3px 323b3oq 579 3qs54gy 5e9 3sxw4aa 3b60446 42y 4o135r9 4gy 4sqt5es 4ac 3nsz506 3pt44zu 5s9 3z4l4i0 5ew 4ihg3hx 31p63me 576 55465sh 4i9 3ep13u2 3p1 380j42e 4nyv59g 5uq 40914ic 48a 3a90439 42y 4of659g 57d25uw 5as 3rdh3fu 505 3psj47e 4sh45e9 4a0 4pph3q1 3my 4mg4591 4eq 4so25e9 3t524aa 3q2 3a1x42z 3o5 3yoi4h0 4t535ew 4ac 3nt150a 4yy 54845s9 4h4 4t8i5ew 4ihi3p1 3fe 4f39576 5s9 400j4i9 3ep33u2 3p1 380m42y 591 3qro5uq 4ia 3epu48a 3mw74z9 42y 4of95d1 49w 4pkz5as 3rdk3fu 505 3psm47e 5e1 3swk4a0 5ax 324z3mz 37w73o5 4gi 4so55ea 4aa 3b5w44a 3a2042z 42t 4nyu4h0 5es 3t6s4ac 47u 3moy4z1 3po747d 4i0 4t8l5ew 52s 4g9f3fe 4g4o591 47m 40114i9 3u1 3a903p1 3mi 4mg2591 3sd349u 4ic 3rd148a 439 3mms46i 4ofd5dx 49w 4pl25aw 50s 4c78505 46i 4rky5e1 3swm4a9 3q1 32513ot 3md 4m6r58y 4sob5eq 4aa 3b5y44a 431 37x142t 59e 4soy5es 3t6v4ac 47u 3mp14z1 46h 4oer5ag 4t943u0 59w 4g9i3mi 579 3ql047m 5ap 3eoj3u2 3a933p1 3my 4mg5591 49e 4pic5as 3rd448c 43a 3mmu46i 59h 3st04a0 5as 3rlv50s 4g5j505 46i 54bp5s9 4a0 4q383qh 325k3ot 3me 4m6u58y 5sh 3t444b6 3qi 3a8y431 39hz|紀年=陰曆越南|參照用',

		'西山朝/阮光纘/景盛|Âm lịch 1800~|8/=:Âm lịch|國號=大越',
		'/寶興|Âm lịch:1801/6~1802/6/23|:Âm lịch|注=大南正編列傳初集卷三十: 五月下旬至阮光垂府後連旬積雨，以為不祥，因之改元寶興。',

		// TODO: 鄭主

		// 國朝正編撮要 https://lib.nomfoundation.org/collection/1/volume/336/page/2
		'阮主/阮福暎|1780/2/5~1800/1/24|:中國|準=年|君主名=阮福映|時期=Thời kỳ độc lập|注=根據《大南實錄》記載，嘉隆帝名「阮福暎」。其中「阮」是姓氏，「福」是祧字，「暎」是其名。「暎」是「映」的異體字，故而不少中文書籍將其名字寫作「阮福映」。|政權=Chúa Nguyễn;廣南國|注=對外仍用後黎朝的年號(景興/昭統)，《國朝正編撮要》使用「壬戌二十三年」之類來紀年',
		// '/阮福暎/景興|1780/2/5~|41/=:中國|準=年',
		// '/阮福暎/景興|Âm lịch 1800~|61/=:Âm lịch|...',
		'=/阮福暎|Âm lịch 1800~|21/=:Âm lịch',

		'阮/世祖/嘉隆|Âm lịch:1802/5~|:Âm lịch|君主名=阮福暎;阮福映|國號=越南|政權=阮朝|時期=Thời kỳ độc lập|注=1802年陰曆五月，阮福映改富春為順化，定為都城，登基稱帝。阮福映宣佈停止使用的後黎朝的年號景興；從「嘉定」、「昇隆」（昇龍）中各取一字，改用新年號「嘉隆」，象徵越南的南北統一。|注=「越南」是清朝嘉慶帝所賜國號。阮福映在位期間，改國號為「越南」，但有時候仍然使用「大越」為國號。明命帝在位時期，國號改為「大南」。',
		'/聖祖/明命|Âm lịch:1820~|:Âm lịch|國號=大南|注=1820年2月3日（嘉隆己卯年臘月十九），嘉隆帝駕崩。臨終前，嘉隆帝指定讓黎文悅、范登興擔任輔政大臣。2月14日（正月初一），30歲的皇太子阮福膽正式舉行登基大典，改年號為「明命」，並尊生母陳氏璫為皇太后。',
		'/憲祖/紹治|1841/2/11~|:Âm lịch|注=1841年1月20日，明命帝逝世。2月11日，阮福綿宗改名阮福暶，在太和殿正式登基，是為紹治帝。',
		'/翼宗/嗣德|1848/10/29~|:Âm lịch|注=1848年10月29日，嗣德帝繼位。',
		'/育德帝/=|1883/7/20~|36/=:Âm lịch|君主=恭宗|注=生前長住於皇城的育德堂，後世尊稱為育德皇帝。|注=Ông lên ngôi vua ngày 20 tháng 7 năm 1883, nhưng tại vị chỉ được mấy ngày. Theo Đại Nam chính biên liệt truyện (quyển 4), thì vua Dục Đức "nối ngôi mới được 5 ngày" (Nxb Văn học, 2004, bản dịch: trang 86). Việt Nam sử lược (Trần Trọng Kim soạn. Nxb Tân Việt, 1968, tr. 533) chép là “được 3 ngày”.',
		'/協和帝/=|1883/7/25~|36/=:Âm lịch',
		'/簡宗/=|1883/12/2~|:Âm lịch|注=lên ngôi ngày 2 tháng 12 năm 1883',
		'/建福|Âm lịch 1884~|:Âm lịch',
		'/咸宜帝/=|1884/8/2~|:Âm lịch|注=Sáng ngày 12 tháng 6 Giáp Thân, tức ngày 2 tháng 8 năm 1884, Ưng Lịch được dìu đi giữa hai hàng thị vệ, tiến vào điện Thái Hòa để làm lễ lên ngôi hoàng đế, đặt niên hiệu là Hàm Nghi.',
		'/咸宜|Âm lịch 1885~|:Âm lịch',
		// TODO: 同慶乙酉年
		'/景宗/同慶|1885/7/4~|乙酉/=:Âm lịch|注=1885年7月4日（咸宜元年五月廿二）改元，當年稱同慶乙酉年，明年始稱元年，共計4年。|注=Ngày 6 tháng 8 năm Ất Dậu, tức ngày 19 tháng 9 năm 1885, Nguyễn Phúc Ưng Kỷ phải thân hành sang bên Khâm sứ Pháp làm lễ thụ phong, được tôn làm vua, lấy niên hiệu là Đồng Khánh.',
		'/=|Âm lịch 1886~|:Âm lịch',
		'/成泰帝/成泰|1889/2/2~|:Âm lịch|注=Ngày 2 tháng 2 năm 1889 Bửu Lân lên ngôi lấy hiệu là Thành Thái.',
		'/維新帝/維新|1907/9/5~|:Âm lịch|注=Ngày 5 tháng 9 năm 1907, Vĩnh San lên ngôi lấy niên hiệu là Duy Tân.',
		'/弘宗/啟定|1916/5/18~|:Âm lịch|注=Ngày 18 tháng 5 năm 1916, Nguyễn Phúc Bửu Đảo lên ngôi lấy niên hiệu là Khải Định.',
		'/保大帝/=|君主名=阮福永瑞|Âm lịch 1926~|:Âm lịch|注=Vua Khải Định mất ngày 6 tháng 11 năm 1925, Vĩnh Thụy về nước thọ tang vua cha và ngày 8 tháng 1 năm 1926, Vĩnh Thụy được tôn lên kế vị làm vua lấy niên hiệu Bảo Đại.',
		'/保大|Âm lịch 1926~|:Âm lịch',
		'帝國越南/皇帝保大|1945/3/11~8/23|:CE|注=未確定是否使用公曆！|時期=法越戰爭|注=1925/11/6~1945/8/30在位|注=1945年3月11日（保大二十年農曆正月廿七日）上午，日本大使橫山前往順化，在太和殿覲見保大， 以「亞洲歸亞洲人」鼓動保大，於是在當天下午，保大就召集六部尚書和王公親貴，發布《獨立宣言》，宣布廢除越南與法國1884年簽訂的不平等條約，脫離法國保護，宣告越南成立獨立自主的國家，並加入以日本為首的「大東亞共榮圈」，決定與日本政府合作。4月17日任命著名歷史學家陳仲金為越南歷史上首位內閣總長〈亦即首相〉。',

		'越南陰曆|1945/3/11~' + CeL.era.pass_on.last_day + '|1945/=:Âm lịch',

		// Thời kỳ Chiến tranh Đông Dương 1945-1975
		'國家越南|1949/6/14~|1949/=:CE|國號=Quốc gia Việt Nam;越南國|時期=法越戰爭',
		'越南共和|1955/10/26~1975/4/30|1955/=:CE|國號=Việt Nam Cộng hòa;越南共和國;南越|時期=法越戰爭',

		'共和沔南越南|1969/6/8~1976/7/1|1969/=:CE|國號=Cộng hòa miền Nam Việt Nam;南越南共和國|時期=法越戰爭',

		'越南民主共和|1945/9/2~|1945/=:CE|國號=Việt Nam Dân chủ Cộng hòa;北越|時期=法越戰爭|注=1953年越南民主共和國所發行的紙幣，上印有「越南民主共和」字樣。',
		'共和社會主義越南|1976/7/2~' + CeL.era.pass_on.last_day
				+ '|1976/=:CE|國號=Cộng hòa Xã hội chủ nghĩa Việt Nam;越南社會主義共和國'

]).minute_offset = 7 * 60;

// ---------------------------------------------------------------------//
// 泰國君主列表

// gettext_config:{"id":"thailand"}
(CeL.era.pass_on.countries["ไทย"] = [
		// 泰國陰陽曆: 依照這邊的設定，新年（換年分）大致比公元提早一兩個月。但實際應晚五個月，每年陰陽曆5/5新年。
		// https://www.myhora.com/%E0%B8%9B%E0%B8%8F%E0%B8%B4%E0%B8%97%E0%B8%B4%E0%B8%99/
		// 除了拉瑪九世之後，泰國佛曆與公元的新年同步之外，之前的王以陰陽曆為主。因為技術性原因，現在還沒有辦法僅僅以曆數資料配合函式庫，來表現出正確的年分。因此泰國佛曆必須以本紀年工具的所列出的日期，才能與達到與資料來源相同的表達。
		'ปฏิทินจันทรคติไทย|1756/12/21~2042/1/21|2300/2=3oq 4ofc58q 4ofc59m 59m 4ofc58q 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 59m 4ofc59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 58q 4ofc59m 59m 4ofc59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc58q 59m 4ofc58q 59m 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc58q 59m 4ofc58q 59m 4ofc59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc58q 59m 4ofc59m 59m 4ofc59m 4ofc58q 58q 4ofc59m 59m 4ofc59m 4ofc58q 59m 4ofc58q 59m 4ofc59m 59m 4ofc58q 4qo|參照用|紀年=泰國陰曆;จันทรคติ;ปฏิทินจันทรคติ|閏月名=雙|注=此處之年份僅為與公元年份約略參考用！僅月份與日期較可資參考。詳見說明。',

		// [[en:List of monarchs of Thailand]]
		// 年份未按照實際歷史編排！
		// [[th:รายพระนามพระมหากษัตริย์ไทย]]
		// gettext_config:{"id":"phra-ruang-dynasty","mark_type":"part_of_string"}
		// gettext_config:{"id":"sukhothai-kingdom","mark_type":"part_of_string"}
		'ราชวงศ์พระร่วง/พ่อขุนศรีอินทราทิตย์|1238~||疑|準=年|時期=อาณาจักรสุโขทัย|君主=พ่อขุนบางกลางหาว;Pho Khun Sri Indraditya;Pho Khun Bang Klang Hao|生=1188|關係=First King of Sukhothai Ally with Pha Mueang defeating the Khmer.',
		'/พ่อขุนบานเมือง|1270~||疑|準=年|君主=Pho Khun Ban Mueang|關係=Son of Sri Indraditya',
		'/พ่อขุนรามคำแหงมหาราช|1279~||疑|準=年|君主=พ่อขุนรามราช;Pho Khun Ram Khamhaeng the Great the Great;Pho Khun Ram Racha|生=1237|關係=Younger brother of Ban Muang;Son of Sri Indraditya',
		'/พระยาเลอไทย|1298~||疑|準=年|君主=Phaya Loethai|關係=Son of Ram Khamhaeng',
		'/พระยางั่วนำถม|1323~||疑|準=年|君主=Phaya Nguanamthom|關係=Cousin of Lerthai;Son of Ban Muang',
		'/มหาธรรมราชาที่ ๑|1347~||疑|準=年|君主=พระมหาธรรมราชาที่ 1;ลิไทย;Phaya Lithai;Phra Maha Thammaracha I|關係=Cousin of Nguanamthom;Son of Lerthai',
		'/มหาธรรมราชาที่ ๒|1368~||疑|準=年|君主=พระมหาธรรมราชาที่ 2;ลือไทย;Phaya Mahathammaracha II;Phra Maha Thammaracha II|關係=Son of Lithai',
		'/มหาธรรมราชาที่ ๓|1400~||疑|準=年|君主=พระมหาธรรมราชาที่ 3;ไสลือไทย;Sai Lue Thai;Phaya Saileuthai;Phra Maha Thammaracha III|關係=Son of Leuthai',
		'/มหาธรรมราชาที่ ๔|1419~1438||疑|準=年|君主=พระมหาธรรมราชาที่ 4;บรมปาล;Boromapan;Phaya Borommapan;Phra Maha Thammaracha IV|關係=Son of Saileuthai',

		// gettext_config:{"id":"ayutthaya-kingdom","mark_type":"part_of_string"}
		'ราชวงศ์อู่ทอง/รามาธิบดีที่ ๑|1350~||疑|準=年|時期=อาณาจักรอยุธยา|君主=สมเด็จพระรามาธิบดีที่ 1;พระเจ้าอู่ทอง;Somdet Phra Chao Uthong;Somdet Phra Ramathibodi I|生=1314|關係=First King of Ayutthaya',
		'/สมเด็จพระราเมศวร|1369~||疑|準=年|君主=Somdet Phra Ramesuan;king of Ayutthaya|生=1339|卒=1395|關係=Son of Uthong',
		'ราชวงศ์สุพรรณภูมิ/สมเด็จพระบรมราชาธิราชที่ ๑|1370~||疑|準=年|時期=อาณาจักรอยุธยา|君主=สมเด็จพระบรมราชาธิราชที่ 1;ขุนหลวงพะงั่ว;Somdet Phra Borommarachathirat I;Khun Luang Pha Ngua|關係=Husband of Uthong\'s older sister;Usurper;Former Lord of Suphanburi',
		'/สมเด็จพระเจ้าทองลัน|1388~1388||疑|準=年|君主=เจ้าทองจันทร์;Somdet Phra Chao Thong Lan;Chao Thong Chan|關係=Son of Borommarachathirat I',
		'ราชวงศ์อู่ทอง/สมเด็จพระราเมศวร|1388~||疑|準=年|時期=อาณาจักรอยุธยา|君主=Somdet Phra Ramesuan;king of Ayutthaya|生=1339|關係=Former King reclaiming the throne;Son of Uthong',
		'/สมเด็จพระรามราชาธิราช|1395~||疑|準=年|君主=Somdet Phra Rama Ratchathirat|生=1356|關係=Son of Ramesuan',
		'ราชวงศ์สุพรรณภูมิ/สมเด็จพระอินทราชา|1409~||疑|準=年|時期=อาณาจักรอยุธยา|君主=เจ้านครอินทร์;Somdet Phra Intharacha;king of Ayutthaya;Phra Chao Nakhon In|生=1359|關係=Nephew of Borommarachathirat I;Former Lord of Suphanburi, offered crown',
		'/สมเด็จพระบรมราชาธิราชที่ ๒|1424~||疑|準=年|君主=สมเด็จพระบรมราชาธิราชที่ 2;เจ้าสามพระยา;Somdet Phra Borommarachathirat II;Chao Sam Phraya|關係=Son of Intha Racha I',
		'/สมเด็จพระบรมไตรโลกนาถ|1448~||疑|準=年|君主=Somdet Phra Boromma Trailokanat|生=1431|關係=Son of Borommarachathirat II',
		'/สมเด็จพระบรมราชาธิราชที่ ๓|1488~||疑|準=年|君主=สมเด็จพระบรมราชาธิราชที่ 3;Somdet Phra Borommarachathirat III;Intha Racha II|關係=Son of Trailokanat',
		'/สมเด็จพระรามาธิบดีที่ ๒|1491~||疑|準=年|君主=สมเด็จพระรามาธิบดีที่ 2;พระเชษฐา;Somdet Phra Ramathibodi II;Phra Chetthathirat I|生=1473|關係=Younger brother of Borommarachathirat III;Son of Trailokanat',
		'/สมเด็จพระบรมราชาธิราชที่ ๔|1529~||疑|準=年|君主=สมเด็จพระบรมราชาธิราชที่ 4;หน่อพุทธางกูร;Somdet Phra Borommarachathirat IV;Somdet Phra Borommaracha Nor Buddhankoon;Phra Athitawongse|關係=Son of Ramathibodi II',
		'/พระรัษฎาธิราช|1533~1533||疑|準=年|君主=Phra Ratsadathirat|生=1529|關係=Son of Borommarachathirat IV;Child King, reign under regency',
		'/สมเด็จพระไชยราชาธิราช|1533~||疑|準=年|君主=Somdet Phra Chairacha;Somdet Phra Chairacha Thirat;Phra Chai|關係=Uncle of Ratsadathirat;Son of Ramathibodi II;Usurper',
		'/พระยอดฟ้า|1546~||疑|準=年|君主=พระแก้วฟ้า;Phra Yodfa;Phra Keowfa|生=1535|關係=Son of Chairacha',
		'/ขุนวรวงศาธิราช|1548/11/11~||疑|準=年|君主=Khun Worawongsathirat;Khun Chinnarat;Bun Si|關係=Usurper monarch, not accepted by some historians',
		'/สมเด็จพระมหาจักรพรรดิ|1548/12/22~||疑|準=年|君主=พระเจ้าช้างเผือก;Somdet Phra Maha Chakkraphat;Phra Chao Chang Pueak|生=1509|關係=Son of Ramathibodi II;Younger brother of Borommarachathirat IV and Chairacha;Seized the throne from usurper;Became a monk at Pegu (1564-1568)',
		'/สมเด็จพระมหินทราธิราช|1564~||疑|準=年|君主=Somdet Phra Mahinthrathirat|生=1539|關係=Son of Maha Chakkrapat and Queen Suriyothai',
		'ราชวงศ์สุโขทัย/สมเด็จพระมหาธรรมราชาธิราช|1569~||疑|準=年|時期=อาณาจักรอยุธยา|君主=สมเด็จพระสรรเพชญ์ที่ 1;สมเด็จพระมหาธรรมราชาธิราช;Somdet Phra Mahathammarachathirat;king of Ayutthaya;Somdet Phra Sanphet I|生=1517|關係=Former Lord of Phitsanulok;Installed as vassal of Bayinnaung of Burma, declared independence in 1584',
		'/สมเด็จพระนเรศวรมหาราช|1590/7/29~1605/4/7||疑|準=年|君主=สมเด็จพระสรรเพชญ์ที่ 2;สมเด็จพระนเรศวรมหาราช;Somdet Phra Naresuan the Great;Somdet Phra Sanphet II;Phra Naret|生=1555/4/25|關係=Son of Maha  Thamaracha Declaring Idependant from Burmese during the reign of Bayinnaung\'s Son',
		'/สมเด็จพระเอกาทศรถ|1605/4/25~||疑|準=年|君主=สมเด็จพระสรรเพชญ์ที่ 3;สมเด็จพระเอกาทศรถ;Somdet Phra Ekathotsarot;Somdet Phra Sanphet III|生=1557|關係=Brother of Naresuan;Son of Maha Thammarachathirat',
		'/พระศรีเสาวภาคย์|1610~||疑|準=年|君主=สมเด็จพระสรรเพชญ์ที่ 4;สมเด็จพระศรีเสาวภาคย์;Somdet Phra Si Saowaphak;Somdet Phra Sanphet IV|關係=Son of Ekathotsarot',
		'/สมเด็จพระเจ้าทรงธรรม|1611~||疑|準=年|君主=สมเด็จพระบรมราชาที่ 1;สมเด็จพระเจ้าทรงธรรม;Somdet Phra Songtham;Somdet Phra Borommaracha I|生=1590|關係=Son of "Ekathotsarot", invited to take the throne after leaving the Sangha',
		'/สมเด็จพระเชษฐาธิราช|1628/12/12~1629||疑|準=年|君主=สมเด็จพระบรมราชาที่ 2;สมเด็จพระเชษฐาธิราช;Somdet Phra Chettha;Somdet Phra Borommaracha II|生=1613|關係=Son of Songtham',
		'/พระอาทิตยวงศ์|1629~1629||疑|準=年|君主=สมเด็จพระอาทิตยวงศ์;Phra Athittayawong|生=1618|關係=Younger brother of Chetthathirat II;Son of Songtham',
		'ราชวงศ์ปราสาททอง/สมเด็จพระเจ้าปราสาททอง|1629~||疑|準=年|時期=อาณาจักรอยุธยา|君主=สมเด็จพระสรรเพชญ์ที่ 5;สมเด็จพระเจ้าปราสาททอง;Somdet Phra Chao Prasat Thong;Somdet Phra Sanphet V|生=1599|關係=Usurper, formerly the Kalahom;Rumored to be a son of Ekathotsarot',
		'/สมเด็จเจ้าฟ้าไชย|1656~||疑|準=年|君主=สมเด็จพระสรรเพชญ์ที่ 6;สมเด็จเจ้าฟ้าไชย;Somdet Chao Fa Chai;Somdet Phra Sanphet VI|關係=Son of Prasat Thong',
		'/สมเด็จพระศรีสุธรรมราชา|1656/6~||疑|準=年|君主=สมเด็จพระสรรเพชญ์ที่ 7;สมเด็จพระศรีสุธรรมราชา;Somdet Phra Si Suthammaracha;Somdet Phra Sanphet VII|關係=Usurper, Uncle of Chao Fa Chai;Younger brother of Prasat Thong',
		'/สมเด็จพระนารายณ์มหาราช|1656/10/26~1688||疑|準=年|君主=สมเด็จพระรามาธิบดีที่ 3;สมเด็จพระนารายณ์มหาราช;Somdet Phra Narai the Great;Somdet Phra Ramathibodi III|生=1633/2/16|關係=Usurper, nephew of Si Suthammaracha;Son of Prasat Thong;Half-brother of Chao Fa Chai',
		'ราชวงศ์บ้านพลูหลวง/สมเด็จพระเพทราชา|1688/7/11~||疑|準=年|時期=อาณาจักรอยุธยา|君主=Somdet Phra Phetracha|生=1632|關係=Usurper, cousin of Narai;Former commander of the Royal Elephant Corps',
		'/สมเด็จพระสรรเพชญ์ที่ ๘|1703/2~||疑|準=年|君主=สมเด็จพระสรรเพชญ์ที่ 8;สมเด็จพระสุริเยนทราธิบดี;พระเจ้าเสือ;Somdet Phra Suriyenthrathibodi;Somdet Phra Sanphet VIII;Phra Chao Suea|關係=Rumored to be a son of Narai',
		'/สมเด็จพระสรรเพชญ์ที่ ๙|1709~||疑|準=年|君主=สมเด็จพระสรรเพชญ์ที่ 9;สมเด็จพระที่นั่งท้ายสระ;สมเด็จพระเจ้าอยู่หัวท้ายสระ;พระเจ้าท้ายสระ;พระเจ้าภูมินทราชา;Somdet Phra Chao Yu Hua Thai Sa;Somdet Phra Sanphet IX|生=1679|關係=Son of Suriyenthrathibodi',
		'/สมเด็จพระเจ้าอยู่หัวบรมโกศ|1733~||疑|準=年|君主=สมเด็จพระบรมราชาธิราชที่ 3;สมเด็จพระเจ้าอยู่หัวบรมโกศ;Somdet Phra Chao Yu Hua Boromakot|生=1680|關係=Brother of Thai Sa, Former Front Palace;Son of Suriyenthrathibodi',
		// 自此後之日期必須參照泰國佛曆，而非表列日期！
		'/สมเด็จพระเจ้าอุทุมพร|1758~1758||疑|君主=สมเด็จพระบรมราชาธิราชที่ 4;สมเด็จพระเจ้าอุทุมพร / ขุนหลวงหาวัด;Somdet Phra Chao Uthumphon;Somdet Phra Ramathibodi IV;Khun Luang Hawat|卒=1796|關係=Son of Boromakot',
		'/สมเด็จพระที่นั่งสุริยาศน์อัมรินทร์|1758~1767/4/7||疑|君主=สมเด็จพระบรมราชาที่ 3;สมเด็จพระที่นั่งสุริยาศน์อัมรินทร์ / พระเจ้าเอกทัศ;Somdet Phra Chao Ekkathat;Somdet Phra Chao Yu Hua Phra Thinang Suriyat Amarin;Somdet Phra Borommaracha III|卒=1767/4/17|關係=Brother of Uthumphon;Usurper, Former Front Palace;Son of Boromakot',

		// gettext_config:{"id":"thonburi-dynasty","mark_type":"part_of_string"}
		// gettext_config:{"id":"taksin","mark_type":"part_of_string"}
		// gettext_config:{"id":"thonburi-kingdom","mark_type":"part_of_string"}
		// gettext_config:{"id":"coronation","mark_type":"part_of_string"}
		'ราชวงศ์ธนบุรี/สมเด็จพระเจ้ากรุงธนบุรี|1767/11/6~||疑|時期=อาณาจักรธนบุรี|君主名=鄭昭;鄭信|君主=สมเด็จพระบรมราชาที่ 4;สมเด็จพระเจ้าตากสินมหาราช;Somdet Phra Chao Taksin the Great;Phra Chao Krung Thonburi;Somdet Phra Borommaracha IV|生=1734/4/17|卒=1782/4/7|關係=Only King of Thonburi|加冕=1768/12/28',

		// gettext_config:{"id":"chakri-dynasty","mark_type":"part_of_string"}
		// gettext_config:{"id":"rattanakosin-kingdom","mark_type":"part_of_string"}
		'ราชวงศ์จักรี/พระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช|1782/4/6~||疑|時期=อาณาจักรรัตนโกสินทร์|國名=ประเทศไทย;ราชอาณาจักรสยาม;ราชอาณาจักรไทย|君主=พระพุทธยอดฟ้าจุฬาโลก;รัชกาลที่ 1;Maha Chakri Borommanat;Phra Rama I;the Great;Rama I|生=1737/3/20|卒=1809/9/7|關係=First King of Rattanakosin|加冕=1782/6/13',
		'/พระบาทสมเด็จพระพุทธเลิศหล้านภาลัย|1809/9/7~||疑|君主=พระพุทธเลิศหล้านภาลัย;รัชกาลที่ 2;Maha Itsarasunthon;Phra Rama II of Siam;Rama II|生=1767/2/24|卒=1824/7/21|關係=Son of Rama I and Queen Amarindra',
		'/พระบาทสมเด็จพระนั่งเกล้าเจ้าอยู่หัว|1824/7/21~||疑|君主=นั่งเกล้า;พระมหาเจษฎาราชเจ้า;รัชกาลที่ 3;Maha Rama III;Phra Nang Klao Chao Yu Hua;Rama III;Phra Maha Chetsadarat Chao|生=1788/3/31|卒=1851/4/2|關係=Son of Rama II and Princess Consort Sri Sulalai',
		'/พระบาทสมเด็จพระจอมเกล้าเจ้าอยู่หัว|1851/4/2~||疑|君主=มงกุฎ;รัชกาลที่ 4;Maha Mongkut;Phra Chom Klao Chao Yu Hua;Rama IV|生=1804/10/18|卒=1868/10/1|關係=Half-brother of Rama III;Son of Rama II and Queen Sri Suriyendra',
		'/พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว|1868/10/1~||疑|君主=จุฬาลงกรณ์;พระปิยมหาราช;รัชกาลที่ 5;Maha Chulalongkorn;Phra Chula Chom Klao Chao Yu Hua;the Great;Rama V;Phra Piya Maharat|生=1853/9/20|卒=1910/10/23|關係=Son of Rama IV and Queen Debsirindra;Under Regency of Si Suriyawongse from 1868-1873',
		'/พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว|1910/10/23~||疑|君主=วชิราวุธ;พระมหาธีรราชเจ้า;รัชกาลที่ 6;Maha Vajiravudh;Phra Mongkut Klao Chao Yu Hua;Rama VI;Phra Maha Thirarachachao|生=1881/1/1|卒=1925/11/25|關係=Son of Rama V and Queen Saovabha Phongsri',
		'/พระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัว|1925/11/25~||疑|君主=ประชาธิปก;รัชกาลที่ 7;Maha Prajadhipok;Phra Pok Klao Chao Yu Hua;Rama VII|生=1893/11/8|卒=1941/5/30|關係=Younger brother of Rama VI;Son of Rama V and Queen Saovabha Phongsri',
		'/พระบาทสมเด็จพระปรเมนทรมหาอานันทมหิดล|1935/3/2~||疑|君主=อานันทมหิดล;พระบาทสมเด็จพระปรเมนทรมหาอานันทมหิดล พระอัฐมรามาธิบดินทร;พระอัฐมรามาธิบดินทร;รัชกาลที่ 8;Maha Ananda Mahidol;Phra Atthama Ramathibodin;Rama VIII|生=1925/9/20|卒=1946/6/9|關係=Nephew of Rama VII;Grandson of Rama V by Mahidol Adulyadej;Under Regency from 1935-1946',
		'/พระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช|1946/6/9~|:CE|君主=ภูมิพลอดุลยเดช;สมเด็จพระภัทรมหาราช;รัชกาลที่ 9;Maha Bhumibol Adulyadej;the Great;Rama IX;Somdet Phra Phatthara Maharat|生=1927/12/5|卒=2016/10/13|關係=Younger brother of Rama VIII;Grandson of Rama V by Mahidol Adulyadej',
		'/สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรางกูร|2016/10/13~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|君主=มหาวชิราลงกรณ;รัชกาลที่ 10;Somdet Phra Chao Yu Hua;Maha Vajiralongkorn;Bodindradebayavarangkun;Rama X|生=1952/7/28|關係=Only son of Rama IX and Queen Sirikit;2nd child of Rama IX|加冕=2019/5/4'

]).minute_offset = 7 * 60;

// ---------------------------------------------------------------------//
// 緬甸, Myanmar / Burma

// gettext_config:{"id":"myanmar"}
(CeL.era.pass_on.countries['မြန်မာ'] = [

		function() {
			var start = -25 - 1, year = start, calendar = [],
			//
			end = this.last_day.to_Date().to_Myanmar()[0] + 1;

			while (year < end) {
				var month_days = CeL.Myanmar_Date.month_days(year++, {
				// start_month : 0
				});
				calendar.push(
				// 緬曆每年並非從首月一日起始
				'/' + month_days.start_date[1] + '/' + month_days.start_date[2]
						+ '=' + month_days.join(';'));
			}

			return [
					'ME',
					[ CeL.Myanmar_Date.new_year_Date(start),
							CeL.Myanmar_Date.new_year_Date(end) ],
					start + calendar.join('	'), '參照用',
					// 因為無法處理 watat year 時之月名；比起將就，不如不設定；須參照相對應之緬曆。
					// '月名=' +
					// CeL.Myanmar_Date.month_name.en.slice(1).join(';'),
					, '注=Myanmar calendar, Myanmar era' ];
		}.call(CeL.era.pass_on),

		// 出身和關係: 為前任者之～, Relationship with predecessor(s).

		// Upper Burma, Middle Early Pagan
		//
		// http://en.wikipedia.org/wiki/List_of_early_and_legendary_monarchs_of_Burma#Middle_Early_Pagan
		// Reign per Zatadawbon Yazawin, Maha Yazawin, Yazawin Thit, and Hmannan
		// Yazawin
		//
		// http://en.wikipedia.org/wiki/Burmese_calendar
		// 640 CE, King Popa Sawrahan (r. 613–640) recalibrated the calendar,
		// named the new era Kawza Thekkarit (ကောဇာ သက္ကရာဇ် [kɔ́zà θɛʔkəɹɪʔ])
		// with a Year Zero starting date of 22 March 638 CE. It was used as the
		// civil calendar while the Buddhist Era remained in use as the
		// religious calendar.
		'Middle Early Pagan/Popa Sawrahan|Myanmar:-25~|:ME|疑|準=年|時期=Early Pagan|關係=Usurper',
		'/Shwe Ohnthi|Myanmar:2~|:ME|疑|準=年|關係=Son-in-law',
		'/Peit Thon|Myanmar:14~|:ME|疑|準=年|關係=Brother',
		'/Peit Taung|Myanmar:22~|:ME|疑|準=年|關係=Son',
		'/Min Khwe|Myanmar:72~|:ME|疑|準=年|關係=Brother',
		'/Myingyway|Myanmar:78~|:ME|疑|準=年|關係=Usurper',
		'/Theinga|Myanmar:88~|:ME|疑|準=年|關係=Elected by court; of royal blood',
		'/Thein Khun|Myanmar:96~|:ME|疑|準=年|關係=Son',
		'/Shwe Laung|Myanmar:106~|:ME|疑|準=年|關係=Son',
		'/Htun Htwin|Myanmar:115~|:ME|疑|準=年|關係=Son',
		'/Shwe Hmauk|Myanmar:124~|:ME|疑|準=年|關係=Son',
		'/Htun Lut|Myanmar:147~|:ME|疑|準=年|關係=Brother',
		'/Saw Khin Hnit|Myanmar:164~|:ME|疑|準=年|關係=Son',
		'/Khe Lu|Myanmar:191~|:ME|疑|準=年|關係=Son',

		// http://en.wikipedia.org/wiki/Zatadawbon_Yazawin
		// In terms of regnal years, the chronicle is considered "the most
		// accurate of all Burmese chronicles, particularly with regard to the
		// best-known Pagan and Ava kings, many of whose dates have been
		// corroborated by epigraphy."
		'Late Early Pagan/Pyinbya|Myanmar:208~|:ME|準=年|時期=Early Pagan|關係=Brother',
		'/Tannet|Myanmar:238~|:ME|準=年|關係=Son',
		'/Sale Ngahkwe|Myanmar:266~|:ME|準=年|關係=Usurper',
		'/Theinhko|Myanmar:296~|:ME|準=年|關係=Son',
		'/Nyaung-u Sawrahan|Myanmar:318~|:ME|準=年|關係=Usurper',
		'/Kunhsaw Kyaunghpyu|Myanmar:363~|:ME|準=年|關係=Son of Tannet',
		'/Kyiso|Myanmar:383~|:ME|準=年|關係=Son of Nyaung-u Sawrahan',
		'/Sokkate|Myanmar:400~406|:ME|準=年|關係=Brother',

		// http://en.wikipedia.org/wiki/List_of_Burmese_monarchs
		// the chronicle reported order and reign dates. G.H. Luce does not
		// recognize Naratheinkha, and proposes an interregnum of nine years
		// between 1165 and 1174. But Luce's gap has been rigorously questioned.
		// Moreover, Luce proposes that Naratheinga Uzana was king between 1231
		// and 1235 but it too is not universally accepted.
		// http://en.wikipedia.org/wiki/List_of_heirs_to_the_Burmese_thrones
		// gettext_config:{"id":"pagan","mark_type":"part_of_string"}
		'Pagan/Anawrahta|1044/8/11~|:ME|關係=Son of Kunhsaw Kyaunghpyu',
		'/Sawlu|1077/4/11~|:ME|準=年|在位=11 April 1077–c. 21 April 1084|關係=Son',
		'/Kyansittha|1084/4/21~|:ME|準=年|在位=21 April 1084–1112/13|關係=Half-brother',
		'/Sithu I|1112/13~|:ME|準=年|在位=1112/13–1167|關係=Grandson',
		'/Narathu|1167~|:ME|準=年|在位=1167–c. February 1171|關係=Son',
		'/Naratheinkha|1171/2/1~|:ME|準=年|在位=c. February 1171–May 1174|關係=Son',
		'/Sithu II|1174/5/1~|:ME|準=年|在位=May 1174–18 August 1211|關係=Brother',
		'/Htilominlo|1211/8/18~1235/7/18|:ME|關係=Son',
		'/Naratheinga Uzana|1231~|:ME|準=年|在位=c. 1231?/35–19 July 1235|關係=Son',
		'/Kyaswa|1235/7/19~|:ME|準=年|在位=19 July 1235–c. May 1251|關係=Son of Htilominlo',
		'/Uzana|1251/5/1~|:ME|準=年|在位=c. May 1251–c. 6 May 1256|關係=Son',
		'/Narathihapate|1256/5/6~1287/7/1|:ME|關係=Son',
		// Interregnum (1287–1289)
		'/Kyawswa|1289/5/30~1297/12/17|:ME|關係=Son',
		'/Sawhnit|1299/5/8~|:ME|準=年|在位=8 May 1299–1325|關係=Son',
		'/Uzana II|1325~1368|:ME|準=年|關係=Son',

		// Small kingdoms
		// All main chronicles prior to Hmannan Yazawin say that the co-regency
		// ended in 674 ME (1312/13) but Hmannan says it ended in 672 ME
		// (1310/11). Inscriptional evidence shows that the first brother died
		// on 13 April 1310 but the second brother was still alive.
		'Myinsaing/Athinkhaya|1297/12/17~1310/4/13|:ME|關係=Founders|注=Co-Regent: Yazathingyan, Thihathu',
		'/Yazathingyan|1297/12/17~1312|:ME|關係=Co-rulers|注=Co-Regent: Athinkhaya, Thihathu',
		'/Thihathu|1297/12/17~|:ME|關係=Co-rulers|注=Co-Regent: Athinkhaya, Yazathingyan',
		// Most of the dates below are by Than Tun and Gordon Luce who had
		// checked the chronicle reported dates with inscriptions. Myinsaing
		// Sithu does not appear in any of the chronicles.
		'Pinya/Thihathu|1313/2/7~|:ME|準=年|在位=7 February 1313–c. February 1325|關係=Brother of Athinkhaya and Yazathingyan',
		'/Uzana I|1325/2/1~|:ME|準=年|在位=c. February 1325–1 September 1340|關係=Adopted son of Thihathu; Son of Kyawswa of Pagan',
		'/Myinsaing Sithu|1340/9/1~|:ME|關係=Maternal uncle?',
		'/Kyawswa I|1344/3/29~|:ME|關係=Nephew and son-in-law|君主名=Ngarsishin Kyawswa;Thihathu II',
		'/Kyawswa II|1350/12/12~|:ME|關係=Son',
		'/Narathu|1359/3/19~|:ME|準=年|君主名=Thihathu III|在位=19 March 1359–June 1364|關係=Brother',
		'/Uzana II|1364/6/1~1364/9/1|:ME|準=年|在位=June 1364–September 1364|關係=Brother',

		// Most of the dates are by Than Tun and Gordon Luce who had checked the
		// dates provided in the chronicles against the inscriptions. Sawyun's
		// start of reign date and Minbyauk's end of reign date are per Hmannan.
		'Sagaing/Sawyun|1315/5/16~|:ME|關係=Son of Thihathu',
		'/Tarabya I|1327/2/5~|:ME|準=年|在位=5 February 1327–1335|關係=Maternal half-brother',
		'/Shwetaungtet|1335~|:ME|準=年|關係=Son',
		'/Kyaswa of Sagaing|1339~|:ME|準=年|關係=Uncle; Son of Sawyun',
		'/Nawrahta Minye|1348~|:ME|準=年|在位=1348–c. March 1350|關係=Brother',
		'/Tarabya II|1350/3/1~|:ME|準=年|在位=c. March 1350–23 February 1352|關係=Brother',
		'/Minbyauk Thihapate|1352/2/23~|:ME|準=年|在位=23 February 1352–April 1364|關係=Brother-in-law',
		// Different Burmese chronicles give similar but not identical dates for
		// the regnal dates of the Ava period. The following table largely
		// follows the dates given in Hmannan Yazawin and the table of regnal
		// dates given in (Maha Yazawin Vol. 2 2006: 352–355). The regnal dates
		// by G.E. Harvey (Harvey 1925: 366) for the most part are off by a year
		// (a year later) than chronicle and inscriptionally-verified dates.
		'Ava/Thadominbya|1364/4/1~|:ME|準=年|在位=April 1364–c. 5 September 1367|關係=Grandson of Sawyun',
		'/Swasawke|1367/9/5~|:ME|準=年|在位=5 September 1367–April 1400|關係=Grandson of Kyawswa of Pagan and grandnephew ofThihathu',
		'/Tarabya|1400/4/1~|:ME|準=年|在位=April 1400–25 November 1400|關係=Son',
		'/Minkhaung I|1400/11/25~|:ME|準=年|在位=25 November 1400–c. February 1422|關係=Half-brother',
		'/Thihathu|1422/2/1~|:ME|準=年|在位=c. February 1422–August 1425|關係=Son',
		'/Minhlange|1425/8/1~|:ME|準=年|在位=August 1425–November 1425|關係=Son',
		'/Kale Kyetaungnyo|1425/11/1~|:ME|準=年|在位=November 1425–20 May 1426|關係=Uncle',
		'/Mohnyin Thado|1426/5/20~|:ME|準=年|在位=20 May 1426–May 1439|關係=Descended from Kyawswa I of Pinya',
		'/Minyekyawswa|1439/5/1~1442/1/1|:ME|準=年|在位=May 1439–January 1442|關係=Son',
		'/Narapati I|1442/4/25~|:ME|關係=Brother',
		'/Thihathura I|1468/7/24~|:ME|準=年|在位=24 July 1468–c. August 1480|關係=Son',
		'/Minkhaung II|1480/8/1~1501/4/7|:ME|準=年|在位=c. August 1480–7 April 1501|關係=Son',
		'/Thihathura II|1485~1501/3/4|:ME|準=年|在位=1485–4 March 1501|關係=Son',
		'/Narapati II|1501/4/7~|:ME|關係=Son of Minkhaung II',
		'/Thohanbwa|1527/3/14~1542/5/1|:ME|準=年|在位=14 March 1527–May 1542|關係=Son of Sawlon I of Mohnyin',
		'/Hkonmaing|1542/6/1~|:ME|準=年|在位=June 1542–c. September 1545|關係=Saopha of Thibaw',
		'/Narapati III|1545/9/1~|:ME|準=年|在位=c. September 1545–c. October 1551|關係=Son',
		'/Narapati IV|1551/10/1~1555/1/22|:ME|準=年|在位=c. October 1551–22 January 1555|關係=Governor of Salin and Viceroy of Sagaing',

		// http://en.wikipedia.org/wiki/List_of_rulers_of_Prome
		// The following list is per the standard Burmese chronicles Maha
		// Yazawin and Hmannan Yazawin, unless otherwise noted. The Yazawin Thit
		// chronicle reports a slightly different list; most notably, it does
		// not accept that Crown Prince Minye Kyawswa was governor between 1415
		// and 1416.
		'Prome/Thihathu I|1275~1288|:ME|準=年|關係=Appointed|注=In revolt (1287–88)',
		'/Kyaswa|1289~|:ME|準=年|關係=Younger brother|注=Minister Pizzawta, not Kyaswa, was governor according to Yazawin Thit',
		'/Saw Yan Naung|1323~|:ME|準=年|關係=Appointed|注=Son of Thihathu of Prome and elder brother of Swasawke of Ava',
		'/Myet-Hna Shay|1377~|:ME|準=年|關係=Nephew',
		'/Htihlaing|1388~|:ME|準=年|關係=Appointed',
		'/Letya Pyanchi|1393~|:ME|準=年|關係=Appointed',
		'/Sokkate|1415~|:ME|準=年|在位=1415 (3 months)|關係=Appointed',
		'/Minye Kyawswa I|1415/4~|:ME|準=年|關係=Appointed',
		'/Thihathu II|1416~|:ME|準=年|關係=Appointed|注=Minye Kyawswa Saw Shet Khet, not the crown prince, per Yazawin Thit',
		'/Minye Kyawswa II|1419~|:ME|準=年|關係=Appointed|注=aka Saw Shwe Khet',
		'/Min Maha|1425~|:ME|準=年|關係=Appointed|注=Reappointed to be governor of Sagaing',
		'/Thihathu III|1429~|:ME|準=年|在位=1429–25 April 1442|關係=Appointed|注=Later known as King Narapati I of Ava',
		'/Minye Kyawswa III|1442/4/25~|:ME|準=年|在位=25 April 1442–January 1446|關係=Appointed|注=Brother-in-law of Narapati I; Reappointed to be governor of Tharrawaddy',
		'/Mingyi Swa|1446/1/1~|:ME|準=年|在位=January 1446–1482|關係=Appointed',
		// Independent
		'/Thado Minsaw|1482~|:ME|準=年|關係=Son of Narapati of Ava|注=Independent',
		'/Bayin Htwe|1526~|:ME|準=年|在位=1526–c. December 1532|關係=Son|注=Independent',
		'/Narapati|1532/12/1~|:ME|準=年|在位=c. December 1532–c. February 1539|關係=Son|注=Vassal of Confederation of Shan States',
		'/Minkhaung|1539/2/1~|:ME|準=年|在位=c. February 1539–19 May 1542|關係=Brother|注=Vassal of Confederation of Shan States',
		// ↑ Independent
		'/Thado Dhamma Yaza I|1542/5/19~|:ME|關係=Appointed|注=Nanny of Tabinshwehti; In revolt (1550–1551)',
		'/Thado Dhamma Yaza II|1551/8/30~1588/12|:ME|在位=30 August 1551–Nov/Dec 1588|關係=Appointed|注=Younger brother of Bayinnaung',
		'/Thado Dhamma Yaza III|1589/2/28~|:ME|關係=Appointed|注=Son of Nanda; in revolt (1595–97)',
		'/Yan Naing|1597/9/17~1608/7/13|:ME|關係=Usurper|注=Independent; Taken to Ava as POW',
		'/Thado Dhamma Yaza IV|1620/11/2~1628/7/9|:ME|關係=Appointed|注=Later known as King Thalun',
		'/Udein Kyawhtin|1630/6/1~1648|:ME|準=年|在位=June 1630–1648?|關係=Appointed',
		'/Pye Min|1650/9/13~1661/6/3|:ME|關係=Appointed',

		'Hanthawaddy/Wareru|1287/4/4~|:ME|準=年|在位=4 April 1287–January 1307|關係=Founder',
		'/Hkun Law|1307~1311/3/1|:ME|準=年|在位=January 1307–March 1311|關係=Brother',
		'/Saw O|1311/4/10~|:ME|準=年|在位=10 April 1311–September 1323|關係=Nephew',
		'/Saw Zein|1323/9/1~|:ME|準=年|在位=September 1323–April 1330|關係=Brother',
		'/Zein Pun|1330/4/1~|:ME|準=年|在位=April 1330–April 1330|關係=Usurper',
		'/Saw E|1330/4/1~|:ME|準=年|在位=April 1330–May 1330|關係=Nephew of Saw Zein',
		'/Binnya E Law|1330/5/1~|:ME|準=年|在位=May 1330–1348|關係=Uncle; Son of Hkun Law',
		'/Binnya U|1348~|:ME|準=年|在位=1348–2 January 1384|關係=Nephew; Son of Saw Zein',
		'/Razadarit|1384/1/2~|:ME|準=年|在位=2 January 1384–c. February 1421|關係=Son',
		'/Binnya Dhammaraza|1421/2/1~|:ME|準=年|在位=c. February 1421–1424|關係=Son',
		'/Binnya Ran I|1424~|:ME|準=年|關係=Brother',
		'/Binnya Waru|1446~|:ME|準=年|在位=1446–30 May 1451|關係=Nephew',
		'/Binnya Kyan|1451/5/30~|:ME|準=年|在位=30 May 1451–c. June 1453|關係=Cousin; Son of Binnya Dhamaraza',
		'/Leik Munhtaw|1453/6/1~|:ME|準=年|在位=c. June 1453–c. January 1454|關係=Cousin; Son of Binnya Ran',
		'/Shin Sawbu|1454~|:ME|準=年|在位=c. January 1454–1471|關係=Aunt; Daughter of Razadarit',
		'/Dhammazedi|1471~|:ME|準=年|關係=Son in law',
		'/Binnya Ran II|1492~|:ME|準=年|關係=Son',
		'/Takayutpi|1526~1539/1/1|:ME|準=年|在位=1526–c. January 1539|關係=Son',
		// Toungoo rule (1539–1550)
		'/Smim Sawhtut|1550/6/1~|:ME|準=年|在位=June 1550–August 1550|關係=Claimant to throne',
		'/Smim Htaw|1550/8/1~1552/3/12|:ME|準=年|在位=August 1550–12 March 1552|關係=Brother of Takayutpi',

		// http://en.wikipedia.org/wiki/List_of_Burmese_monarchs
		// http://en.wikipedia.org/wiki/List_of_Arakanese_monarchs
		// The reign dates are per the Arakanese chronicle Rakhine Razawin Thit
		// (Sandamala Linkara Vol. 2 1931), converted into Western dates using
		// (Eade 1989). (Some Arakanese chronicles state the foundation of the
		// kingdom a year later, 1430. Moreover, the end of the kingdom is given
		// per Burmese records, 2 January 1785. Arakanese records give a day
		// earlier, 1 January 1785.)
		'Mrauk U/Saw Mon|1429/4/18~|:ME|關係=Founder',
		'/Khayi|1433/5/9~|:ME|準=年|在位=9 May 1433–c. January 1459|關係=Brother',
		'/Ba Saw Phyu|1459/1/1~|:ME|準=年|在位=c. January 1459–5 August 1482|關係=Son',
		'/Dawlya|1482/8/5~|:ME|準=年|在位=5 August 1482–c. February 1492|關係=Son',
		'/Ba Saw Nyo|1492/2/1~|:ME|準=年|在位=c. February 1492–c. January 1494|關係=Uncle',
		'/Ran Aung|1494/1/1~|:ME|準=年|在位=c. January 1494–c. July 1494|關係=Nephew',
		'/Salingathu|1494/7/1~|:ME|準=年|在位=c. July 1494–February 1502|關係=Maternal uncle',
		'/Raza|1502/2/1~|:ME|準=年|在位=February 1502–c. November 1513|關係=Son',
		'/Gazapati|1513/11/1~|:ME|準=年|在位=c. November 1513–January 1515|關係=Son',
		'/Saw O|1515/1/1~|:ME|準=年|在位=January 1515–July 1515|關係=Granduncle; brother of Salingathu',
		'/Thazata|1515/7/1~|:ME|準=年|在位=July 1515–c. April 1521|關係=Son of Dawlya',
		'/Minkhaung|1521/4/1~|:ME|準=年|在位=c. April 1521–27 May 1531|關係=Brother',
		'/Min Bin|1531/5/27~|:ME|關係=Son of Min Raza',
		'/Dikkha|1554/1/11~|:ME|關係=Son',
		'/Saw Hla|1556/3/6~|:ME|關係=Son',
		'/Sekkya|1564/7/24~|:ME|關係=Brother',
		'/Min Phalaung|1572/2/7~|:ME|關係=Son of Min Bin|君主名=Min Phalaung;မင်းဖလောင်း;Min Hpalaung',
		'/Razagri|1593/7/4~|:ME|關係=Son',
		'/Khamaung|1612/7/4~|:ME|關係=Son',
		'/Thiri Thudhamma|1622/5/14~|:ME|關係=Son',
		'/Sanay|1638/5/29~|:ME|關係=Son',
		'/Narapati|1638/6/17~|:ME|關係=Great grandson of Min Bin',
		'/Thado|1645/12/13~|:ME|準=年|在位=13 December 1645–c. May 1652|關係=Son',
		'/Sanda Thudhamma|1652/5/1~|:ME|準=年|在位=c. May 1652–11 June 1674|關係=Son',
		'/Thiri Thudhamma|1674/6/11~|:ME|關係=Son',
		'/Wara Dhammaraza|1685/4/16~|:ME|關係=Brother|君主名=Wara Dhamma',
		'/Muni Thudhammaraza|1692/6/20~|:ME|關係=Elder brother|君主名=Mani Dhamma',
		'/Sanda Thuriya I|1694/12/20~|:ME|關係=Brother',
		'/Nawrahta|1696/8/4~|:ME|關係=Son',
		'/Mayuppiya|1696/8/18~1697/5/13|:ME|關係=Usurper|君主名=Mayonpiya',
		'/Kalamandat|1697/5/16~|:ME|關係=Usurper|君主名=Kalagandat',
		'/Naradipati I|1698/6/5~|:ME|關係=Son of Sanda Thuriya|君主名=Naradipadi I',
		'/Sanda Wimala I|1700/6/18~1707/3/30|:ME|關係=Grandson of Thado',
		'/Sanda Thuriya II|1707/4/3~1710/9/1|:ME|準=年|在位=3 April 1707–September 1710|關係=Grandson of Sanda Thudhamma',
		// Interregnum ~2 months
		'/Sanda Wizaya I|1710/11/1~|:ME|準=年|在位=November 1710–April 1731|關係=Usurper',
		'/Sanda Thuriya III|1731/4/1~|:ME|準=年|在位=April 1731–1734|關係=Son-in-law',
		'/Naradipati II|1734~|:ME|準=年|關係=Son|君主名=Naradipadi II',
		'/Narapawara|1735~|:ME|準=年|在位=1735–September 1737|關係=Usurper',
		'/Sanda Wizaya II|1737/9/1~1738/3/25|:ME|準=年|在位=September 1737–25 March 1738|關係=Cousin',
		'/Madarit|1738/3/28~|:ME|關係=Brother',
		'/Nara Apaya|1743/2/6~|:ME|關係=Uncle',
		'/Thirithu|1761/10/28~|:ME|關係=Son',
		'/Sanda Parama|1762/2/3~|:ME|關係=Brother',
		'/Apaya|1764/5/1~|:ME|關係=Brother-in-law',
		'/Sanda Thumana|1774/1/17~|:ME|關係=Brother-in-law',
		'/Sanda Wimala II|1777/5/6~|:ME|關係=Usurper',
		'/Sanda Thaditha|1777/6/5~|:ME|關係=Usurper',
		'/Maha Thammada|1782/12/2~1785/1/2|:ME|關係=Usurper',

		// http://en.wikipedia.org/wiki/List_of_Burmese_monarchs
		// https://en.wikipedia.org/wiki/List_of_heirs_to_the_Burmese_thrones
		// http://en.wikipedia.org/wiki/List_of_rulers_of_Toungoo
		// gettext_config:{"id":"toungoo","mark_type":"part_of_string"}
		'Toungoo/Thawun Gyi|1279/4/21~|:ME|準=年|在位=21 April 1279–1317|關係=Son of Thawun Letya|注=Vassal of Pagan (1279–1287); independent (1287–1317); assassinated',
		'/Thawun Nge|1317~|:ME|準=年|關係=Brother|注=Independent (1317–1322); Vassal of Pinya (1322–1324)',
		'/Saw Hnit|1324~|:ME|準=年|關係=Son|注=Vassal of Pinya; assassinated',
		'/Kayin Ba|1325~|:ME|準=年|關係=No relations; usurper|注=Vassal of Pinya',
		'/Letya Sekkya|1342~|:ME|準=年|關係=Son-in-law|注=Vassal of Pinya; assassinated',
		'/Htauk Hlayga|1344~|:ME|準=年|關係=Brother; usurper|注=Vassal of Pinya; assassinated',
		'/Theinkhaba|1346~|:ME|準=年|在位=1346–29 March 1367|關係=No relations; usurper|注=Independent/in rebellion (1358–1366)',
		'/Pyanchi I|1367/3/29~|:ME|準=年|在位=29 March 1367–1375|關係=Son|注=Vassal of Ava; assassinated',
		'/Ma Sein|1375~|:ME|準=年|關係=Usurper|在位=1375 (7 months)|注=In rebellion/vassal of Hanthawaddy Pegu; assassinated',
		'/Pyanchi II|1375/8~|:ME|準=年|關係=Son of Pyanchi I|注=Vassal of Ava; assassinated',
		'/Sokkate|1379~|:ME|準=年|關係=Brother-in-law|注=Vassal of Ava; assassinated',
		'/Phaungga|1383~|:ME|準=年|關係=Usurper|注=Vassal of Ava',
		'/Saw Oo I|1397~|:ME|準=年|關係=Son|注=Removed from office',
		'/Min Nemi|1399~|:ME|準=年|在位=1399–1408|關係=No relations|注= appointed',
		'/Letya Zeya Thingyan|1408~|:ME|準=年|關係=Appointed|注=Moved to become governor ofPyinsi',
		'/Thinkhaya I|1412~|:ME|準=年|關係=Appointed',
		'/Thinkhaya II|1415~1418|:ME|準=年|關係=Appointed|注=Assassinated',
		// No office holder (1418–1419)
		'/Pantaung|1419~|:ME|準=年|關係=Appointed|注=Removed from office',
		'/Thinkhaya III|1420~|:ME|準=年|關係=Appointed|注=Independent/in rebellion (1426–1435)',
		'/Uzana|1435~|:ME|準=年|關係=Son-in-law; Appointed|注=Independent/in rebellion; Vassal of Hanthawaddy; Removed from office by Binnya Ran I',
		'/Saw Oo II|1436~|:ME|準=年|關係=Son of Thinkhaya III|注=Independent/in rebellion; killed in action',
		'/Tarabya|1440~|:ME|準=年|在位=1440–2 January 1446|關係=Appointed|注=Vassal of Ava',
		'/Minkhaung I|1446/1/2~|:ME|準=年|在位=2 January 1446–1451|關係=Son|注=Vassal of Ava; assassinated',
		'/Minye Kyawhtin of Toungoo|1451~|:ME|準=年|關係=Usurper; son of Crown Prince Minyekyawswa|注=Independent/in rebellion (1451–1459); assassinated',
		'/Thiri Zeya Thura|1459~|:ME|準=年|關係=Appointed|注=Removed from office',
		'/Letya Zala Thingyan|1466~|:ME|準=年|關係=Appointed|注=Independent/in revolt (1470); deposed',
		'/Sithu Kyawhtin|1470~|:ME|準=年|關係=Appointed|注=Vassal of Ava; died in action',
		'/Min Sithu|1481~|:ME|準=年|在位=1481–c. April 1485|關係=Son|注=Vassal of Ava; assassinated',
		// Independent
		'/Mingyinyo|1485/4/1~|:ME|準=年|在位=c. April 1485–24 November 1530|關係=Nephew|注=Declared independence from Ava in 1510/10/16',
		'/Tabinshwehti|1530/11/24~|:ME|準=年|在位=24 November 1530–1540|關係=Son|注=Moved seat of government to Pegu(Bago) in 1539',
		'/Minye Thihathu I|1540~|:ME|準=年|在位=1540–March 1549|關係=Appointed; father of Bayinnaung',
		'/Minkhaung II|1549/3/1~1551/1/11|:ME|準=年|在位=March 1549–11 January 1551|關係=Appointed|注=Independent/in rebellion (1550–1551); Minkhaung resisted for four months but finally surrendered on 11 January 1551.',
		'/=|1552/6/6~|:ME|關係=Younger brother; re-appointed|注=viceroy of Toungoo',
		'/Minye Thihathu II|1584/6/1~|:ME|準=年|在位=June 1584–11 August 1609|關係=Son|注=Independent/in rebellion (1597–1609)|注=Viceroy of Toungoo: June 1584 – c. February 1597; King of Toungoo: – 11 August 1609',
		'/Natshinnaung|1609/8/11~1610/9/4|:ME|關係=Son; appointed 1610–1612|注=Independent/in rebellion (1609–1610); King of Toungoo; Coronation: 6th waning of Wagaung 971 ME, 1609/8/21',
		// King of Burma and dominions
		// On 30 April 1550, Tabinshwehti was assassinated by his own bodyguards
		// on the order of Smim Sawhtut, one of the king's close advisers.[
		'/Bayinnaung|1550/4/30~|:ME|關係=Brother-in-law',
		'/Nanda|1581/10/10~|:ME|關係=Son; nephew of Tabinshwehti',
		'/Nyaungyan Min|1599/12/19~|:ME|關係=Half-brother',
		'/Anaukpetlun|1605/11/5~|:ME|關係=Son',
		'/Minye Deibba|1628/7/9~|:ME|關係=Son',
		'/Thalun|1629/8/19~|:ME|關係=Uncle',
		'/Pindale|1648/8/27~|:ME|關係=Son',
		'/Pye|1661/6/3~|:ME|關係=Brother',
		'/Narawara|1672/4/14~|:ME|關係=Son',
		'/Minye Kyawhtin|1673/2/27~|:ME|關係=Nephew',
		'/Sanay|1698/5/4~|:ME|關係=Son',
		'/Taninganway|1714/9/12~|:ME|關係=Son',
		'/Mahadhammaraza Dipadi|1733/12/12~1752/3/23|:ME|關係=Son',

		// Restored Hanthawaddy Kingdom
		'Restored Hanthawaddy/Smim Htaw Buddhaketi|1740/11/1~|:ME|準=年|在位=November 1740–December 1747|關係=Cousin of Mahadhammaraza Dipadi',
		'/Binnya Dala|1747/12/1~1757/5/6|:ME|準=年|在位=December 1747–6 May 1757|關係=Elected',

		// gettext_config:{"id":"konbaung","mark_type":"part_of_string"}
		'ကုန်းဘောင်ခေတ်/Alaungpaya|1752/2/29~|:ME|關係=Founder',
		'/Naungdawgyi|1760/5/11~|:ME|關係=Son',
		'/Hsinbyushin|1763/11/28~|:ME|關係=Brother',
		'/Singu|1776/6/10~|:ME|關係=Son',
		'/Phaungka|1782/2/6~|:ME|關係=Cousin; Son of Naungdawgyi',
		"/Bodawpaya|1782/2/11~|:ME|關係=Uncle; Alaungpaya's fourth son",
		// 英屬緬甸存在於1824年至1948年。
		'/Bagyidaw|1819/6/5~|:ME|關係=Grandson',
		'/Tharrawaddy|1837/4/15~|:ME|關係=Brother',
		'/Pagan|1846/11/17~|:ME|關係=Son',
		'/Mindon|1853/2/18~|:ME|關係=Brother',
		'/Thibaw Min|1878/10/1~|:ME|關係=Son',
		//
		'Konbaung exiled/=|1885/11/29~|:CE',
		'/Myat Paya Lat|1916/12/19~|:CE|疑|關係=Daughter',
		'/Myat Phaya|1956/4/4~|:CE|疑|關係=Younger sister',
		'/Taw Phaya|1962/7/21~|:CE|疑|生=1924/3/22|卒=2019/1/12|關係=second son of Princess Myat Phaya Galay',
		'/Soe Win|2019/1/12~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|疑|關係=Second son|注=不清楚王位繼承人是 Taw Phaya 的兒子 Richard Taw Phaya Myat Gyi 還是他的表弟 Soe Win。',

		// https://en.wikipedia.org/wiki/President_of_Myanmar
		'British Burma|1824/3/5~1948/1/3|:CE|注=First Anglo-Burmese War: 1824/3/5. From 31 January 1862 to 1 May 1897, British Burma was headed by a Chief Commissioner.',

		// https://ja.wikipedia.org/wiki/%E3%83%93%E3%83%AB%E3%83%9E%E3%81%AE%E6%88%A6%E3%81%84
		'Japanese occupation of Burma|1942/3/8~1945/5/2|:CE|注=3月8日首都ラングーンを占領した。...開戦時には日本軍はビルマの全面占領までは意図しておらず、第15軍は軍政部を持っていなかった。那須義雄大佐を長とする軍政部が設置されたのはラングーン占領後である。|注=イギリス軍は5月2日にラングーンを奪回した。',

		// https://en.wikipedia.org/wiki/List_of_Presidents_of_Myanmar
		// https://zh.wikipedia.org/wiki/%E7%BC%85%E7%94%B8%E6%80%BB%E7%BB%9F
		// https://my.wikipedia.org/wiki/%E1%80%95%E1%80%BC%E1%80%8A%E1%80%BA%E1%80%91%E1%80%B1%E1%80%AC%E1%80%84%E1%80%BA%E1%80%85%E1%80%AF%E1%80%99%E1%80%BC%E1%80%94%E1%80%BA%E1%80%99%E1%80%AC%E1%80%94%E1%80%AD%E1%80%AF%E1%80%84%E1%80%BA%E1%80%84%E1%80%B6%E1%80%90%E1%80%B1%E1%80%AC%E1%80%BA%E1%81%8F_%E1%80%9E%E1%80%99%E1%80%B9%E1%80%99%E1%80%90%E1%80%99%E1%80%BB%E1%80%AC%E1%80%B8
		'Union of Burma/စဝ်ရွှေသိုက်|1948/1/4~|:CE|時期=Post-independence Burma|君主名=Sao Shwe Thaik',
		'/ဘဦး|1952/3/16~|:CE|君主名=Ba U;Ba Oo',
		'/မန်းဝင်းမောင်|1957/3/13~|:CE|君主名=Mahn Win Maung',
		'/နေဝင်း|1962/3/2~|:CE|君主名=Ne Win',
		'Socialist Republic of the Union of Burma/=|1974/3/2~|:CE|時期=Military rule',
		'/စန်းယု|1981/11/9~|:CE|君主名=San Yu',
		'/စိန်လွင်|1988/7/27~|:CE|君主名=Sein Lwin|注=1988年7月26日任緬甸社會主義綱領黨主席，次日繼任緬甸總統',
		'/အေးကို|1988/8/12~|:CE|君主名=Aye Ko',
		'/မောင်မောင်|1988/8/19~|:CE|君主名=Maung Maung',
		'/စောမောင်|1988/9/18~|:CE|君主名=Saw Maung',
		'Late Union of Burma/=|1988/9/23~|:CE|時期=Military rule',
		'Union of Myanmar/=|1989/6/18~|:CE|時期=Military rule|注=1989年6月18日緬甸軍人政府將緬甸的英文寫法「Burma」改為「Myanmar」。',
		'/သန်းရွှေ|1992/4/23~|:CE|君主名=Than Shwe|注=1997年11月15日起改任國家和平與發展委員會主席(State Law and Order Restoration Council→State Peace and Development Council)',
		// gettext_config:{"id":"republic-of-the-union-of-myanmar","mark_type":"part_of_string"}
		'မြန်မာပြည်/=|2010/10/21~|:CE|國名=Republic of the Union of Myanmar|時期=Democratic reforms',
		'/သိန်းစိန်|2011/3/30~' + CeL.era.pass_on.last_day
				+ '|:CE|君主名=Thein Sein'

]).minute_offset = 6.5 * 60;

// ---------------------------------------------------------------------//
// 印度年表, ancient India
// https://en.wikipedia.org/wiki/List_of_Indian_monarchs

// gettext_config:{"id":"india"}
(CeL.era.pass_on.countries["India"] = [

		// मगध (Magadha empire, c. 1200 BCE–322 BCE)
		// https://en.wikipedia.org/wiki/Magadha
		// 摩揭陀王國

		// Haryanka dynasty (Middle of 6th century BCE–413 BCE) 訶黎王朝
		// Bhattiya
		'Haryanka/Bimbisara|-544~||疑|準=年|生=558|卒=491|時期=मगध|君主名=頻毘娑羅;बिम्बिसारः',
		'/Ajātasattu|-492~||疑|準=年|君主名=Ajātaśatru;Ajatasatru',
		'/Udayin|-460~-440||疑|準=年|君主名=Udayabhadra',
		// Anuruddha
		// Munda
		'/Nagadasaka|-437~||疑|準=年|君主名=Nāgadāsaka',

		// Shishunaga dynasty (413–345 BCE) 童龍王朝;幼龍王朝
		'Shishunaga/Shishunaga|-413~||疑|準=年|時期=मगध|君主名=Shusunaga',
		'/Kakavarna Kalashoka|-395~||疑|準=年',
		'/Mahanandin|-367~||疑|準=年',

		// Nanda Dynasty (345–321 BCE) 難陀王朝
		'Nanda/Mahapadma Nanda|-345~||疑|準=年|時期=मगध|君主名=摩訶帕德摩·難陀;大紅蓮·難陀',
		// Pandhuka
		// Panghupati
		// Bhutapala
		// Rashtrapala
		// Govishanaka
		// Dashasidkhaka
		// Kaivarta
		'/धनानन्द|-329~||疑|準=年|君主名=Dhana Nanda',

		// 波斯人與希臘人的入侵。摩訶帕德摩死後﹐馬其頓帝國亞歷山大大帝攻入印度河平原。

		// Maurya Empire, Mauryan Empire, 孔雀王朝
		// 常用語言 梵文
		// https://en.wikipedia.org/wiki/Maurya_Empire
		// https://en.wikipedia.org/wiki/List_of_Mauryan_rulers
		'Maurya/Candragupta Maurya|-324~||疑|準=年|朝代=मौर्यसाम्राज्यम्|君主名=Chandragupta Maurya;旃陀羅笈多;月護王',
		'/Bindusara|-297~-273||疑|準=年|君主名=Bindusara Maurya;賓頭娑羅',
		'/Ashoka|-268~||疑|準=年|君主名=अशोक;Ashoka Maurya;Aśoka;阿育王;無憂王',
		'/Dasharatha|-232~||疑|準=年|君主名=Dasharatha Maurya',
		'/Samprati|-224~||疑|準=年|君主名=Samprati Maurya',
		'/Shalishuka|-215~||疑|準=年|君主名=Shalishuka Maurya;Śāliśuka',
		'/Devavarman|-202~||疑|準=年|君主名=Devavarman Maurya;Devadharman',
		'/Satadhanvan|-195~||疑|準=年|君主名=Satadhanvan Maurya;Shatadhanvan;Shatadhanus',
		'/Bṛhadratha Maurya|-187~-180||疑|準=年|君主名=Brihadratha Maurya',

		// https://en.wikipedia.org/wiki/Indo-Greek_Kingdom#List_of_the_Indo-Greek_kings_and_their_territories
		// The Indo-Greek Kingdom or Graeco-Indian Kingdom
		// https://en.wikipedia.org/wiki/Timeline_of_Indo-Greek_kingdoms
		'ګندارا‎/Ἀπολλόδοτος Α΄ ὁ Σωτήρ|-180~-160||疑|準=年|君主名=Apollodotus I;Apollodotus I Soter;महरजस अपलदतस त्रतरस|朝代=Gandhāra;Gandhara|時期=Indo-Greek',
		// TODO
		'Punjab/Στράτων B΄ ὁ Σωτήρ|-25~-10||疑|準=年|君主名=Strátōn B΄ ho Sotḗr;Strato II;Strato II "Soter"|時期=Indo-Greek',

		// The Śuṅga Empire (Sanskrit: शुङ्ग) 巽伽王朝
		// https://en.wikipedia.org/wiki/Shunga_Empire#List_of_Shunga_Emperors
		// https://sa.wikipedia.org/wiki/शुङ्गवंशः
		'Shunga/Puṣyamitra Śuṅga|-185~||疑|準=年|朝代=शुङ्ग;शुङ्गवंशः|君主名=Pushyamitra Shunga;पुष्यमित्रः शुङ्गः',
		'/Agnimitra|-149~||疑|準=年|君主名=अग्निमित्र;अग्निमित्रः',
		'/Vasujyeshtha|-141~||疑|準=年|君主名=वसुज्येष्ठः',
		'/Vasumitra|-131~||疑|準=年|君主名=Sumitra;वसुमित्रः',
		'/Andhraka|-124~||疑|準=年|君主名=अन्ध्रकः',
		'/Pulindaka|-122~-119||疑|準=年|君主名=पुलिन्दकः',
		// Ghosha घोषः शुङ्गः
		// Vajramitra वज्रमित्रः
		'/Bhagabhadra|-110~||疑|準=年|君主名=भागभद्रः|注=c. 110 BCE',
		'/Devabhuti|-83~-73||疑|準=年|君主名=देवभूतिः',

		// The Kanva or Kanvayana Dynasty is a Brahmin Dynasty replaced the
		// Sunga dynasty in Magadha
		// 甘婆王朝/甘華王朝
		// https://en.wikipedia.org/wiki/Kanva_dynasty#Rulers
		'Kanva/Vasudeva|-75~||疑|準=年|朝代=काण्ववंशः|君主名=Vasudeva Kanva;वसुदेवः',
		'/Bhumimitra|-66~||疑|準=年|君主名=भूमिमित्रः',
		'/Narayana|-52~||疑|準=年|君主名=नारायणः',
		'/Susharman|-40~-30||疑|準=年|君主名=सुशर्मन्',

		/**
		 * The Mahameghavahana dynasty (Oriya: ମହାମେଘବାହନ; Mahā-Mēgha-Bāhana, c.
		 * 250s BC to 400s AD) was an ancient ruling dynasty of Kalinga after
		 * the decline of the Maurya Empire.
		 * 
		 * @see https://en.wikipedia.org/wiki/Mahameghavahana_dynasty
		 */
		/**
		 * <code>Reign	c. first or second century BCE
		'ମହାମେଘବାହନ/ଖାରବେଳ|-193~-170||疑|準=年|朝代=Mahāmēghabāhana;Maha-Meghavahana;Mahameghavahana|君主名=ଖାରେବଳ;खारवेल;Khārabēḷa;Khāravēla;Kharavela|注=the third and greatest emperor of the Mahameghavahana dynasty of Kalinga (present-day Odisha).',
		</code>
		 */

		// The Gupta Empire (Sanskrit: गुप्तसाम्राज्यम्, Gupta Sāmrājya) was an
		// ancient Indian empire
		// https://en.wikipedia.org/wiki/Gupta_Empire
		// https://en.wikipedia.org/wiki/Template:Gupta_Empire_Infobox
		'Gupta/Śri Gupta|240~||疑|準=年|朝代=गुप्तसाम्राज्यम्|朝代=गुप्ता राजवंश;Gupta;笈多王朝|君主名=Sri Gupta;श्रीगुप्तः',
		'/Ghatotkacha|280~||疑|準=年|君主名=घटोत्कचः',
		// https://en.wikipedia.org/wiki/Gupta_era
		// Gupta era: begins from 318-319 CE
		'/Chandragupta I|320~||疑|準=年|君主名=旃陀羅·笈多一世;चन्द्रगुप्तःI',
		'/Samudragupta|336~||疑|準=年|君主名=Mahārājādhirāja;समुद्रगुप्तः',
		'/Ramagupta|380~380||疑|準=年|君主名=रामगुप्तः',
		'/Chandragupta II|380~||疑|準=年|君主名=Chandragupta Vikramaditya;चन्द्रगुप्तविक्रमादित्यः',
		'/Kumaragupta I|415~||疑|準=年|君主名=Shakraditya;कुमारगुप्तःI',
		'/Skandagupta|455~||疑|準=年|君主名=स्कन्दगुप्तः',
		'/Purugupta|467~||疑|準=年|君主名=पुरुगुप्त;पुरुगुप्तः',
		'/Kumaragupta II|473~||疑|準=年|君主名=कुमारगुप्त द्वितीय;कुमारगुप्तःII',
		'/Budhagupta|476~||疑|準=年|君主名=बुधगुप्त;बुधगुप्तः',
		'/Narasimhagupta|495~||疑|準=年|君主名=Narasimhagupta Baladitya;नरसिंहगुप्तः|注=495 – ? CE',
		// 505: 隨便選, 495~510
		'/Vainyagupta|505~||疑|準=年|君主名=वैन्यगुप्त;वैण्यगुप्तः|注=c. ? – c. 507 CE',
		// 510: 隨便選, 507~510
		'/Bhanugupta|510~||疑|準=年|君主名=नुगुप्तः|注=c. 510 – c. ? CE',
		'/Kumaragupta III|530~||疑|準=年|君主名=कुमारगुप्तःIII|注=? – 540 CE',
		'/Vishnugupta|540~550||疑|準=年|君主名=विष्णुगुप्त;विष्णुगुप्तः',

// IST (UTC+05:30)
]).minute_offset = 5.5 * 60;

// ---------------------------------------------------------------------//
// Mesopotamian
// https://en.wikipedia.org/wiki/List_of_Mesopotamian_dynasties

// gettext_config:{"id":"mesopotamian"}
(CeL.era.pass_on.countries["Mesopotamian"] = [

		// https://en.wikipedia.org/wiki/Early_Dynastic_Period_(Mesopotamia)

		// ------------------------------------------------

		// Fourth dynasty of Kish, 基什第三王朝
		// https://en.wikipedia.org/wiki/Sumerian_King_List#Fourth_dynasty_of_Kish
		// http://www.historyfiles.co.uk/KingListsMiddEast/MesopotamiaKish.htm
		/**
		 * <code>
		'Kish IV/Nanniya|-2366~|:CE|疑|精=年|準=年|注=He ruled in Kish for 7 years. Then Kish was defeated and the kingship was taken to Unug (Uruk).',
		</code>
		 */

		// ------------------------------------------------
		// 精準至百年。
		// 3rd Dynasty of Uruk, Third dynasty of Uruk, 烏魯克第三王朝
		// https://en.wikipedia.org/wiki/Uruk#Early_dynastic,_Akkadian,_and_Neo-Sumerian_rulers
		'Uruk III/Lugalzagesi|-2359~|:CE|疑|精=年|準=年|傳說|ruler=Lugal-zage-si|注=c. 2294 - 2270 BC short chronology|注=Then Unug was defeated and the kingship was taken to Agade (Akkad).',

		// ------------------------------------------------
		// http://www.aina.org/aol/kinglist
		// https://en.wikipedia.org/wiki/List_of_Assyrian_kings
		// Assyria

		// Akkadian Empire, 阿卡德帝國
		// https://en.wikipedia.org/wiki/Akkadian_Empire
		'Akkadian/Sargon I|-2334~|:CE|疑|精=年|準=年|傳說|ruler=Sargon of Akkad|注=United Mesopotamia (Sumer & Akkad)',
		'/Rimush|-2278~|:CE|疑|精=年|準=年|傳說|注=Conquers Elam and Marhashi (Central Iran)',
		'/Manishtushu|-2269~|:CE|疑|精=年|準=年|傳說|注=Renovates Temple of Ishtar',
		'/Naram-Sin|-2254~|:CE|疑|精=年|準=年|傳說|注=Arrogates god-like status to himself',
		'/Shar-Kali-Shari|-2217~|:CE|疑|精=年|準=年|傳說|注=Akkadian kingship begins to weaken',
		'/Igigi|-2192~-2192|:CE|疑|精=年|準=年|傳說',
		'/Nanium|-2192~|:CE|疑|精=年|準=年|傳說',
		'/Imi|-2191~|:CE|疑|精=年|準=年|傳說',
		'/Elul-dan|-2190~|:CE|疑|精=年|準=年|傳說',
		'/Dudu|-2189~|:CE|疑|精=年|準=年|傳說',
		'/Shu-Turul|-2168~-2154|:CE|疑|精=年|準=年|傳說',

		// The Third Dynasty of Ur, the Neo-Sumerian Empire, 烏爾第三王朝
		'Neo-Sumerian/Ur-Nammu|-2112~|:CE|疑|精=年|準=年|傳說|注=Establishes the Third Dynasty of Ur',
		"/Shulgi|-2094~|:CE|疑|精=年|準=年|傳說|注=Extends father's empire to all of Assyria",
		'/Amar-Sin|-2046~|:CE|疑|精=年|準=年|傳說',
		'/Shu-Sin|-2037~|:CE|疑|精=年|準=年|傳說',
		'/Ibbi-Sin|-2028~-2004/12/31|:CE|疑|精=年|準=年|傳說',

		// https://en.wikipedia.org/wiki/Timeline_of_the_Assyrian_Empire
		// Old Assyrian Empire, 古亞述時期
		// https://en.wikipedia.org/wiki/Old_Assyrian_Empire
		'Old Assyrian/Erishum II|-1920~-1900/12/31|:CE|疑|精=年|準=年|傳說|時期=Assyrian',
		'/Shamshi-Adad I|-1813~|:CE|疑|精=年|準=年|傳說|注=Unites all independent Assyrian city-states',
		'/Ishme-Dagan I|-1780~-1741|:CE|疑|精=年|準=年|傳說|注=Contemporary with Hammurabi of Babylon',
		//
		'/Ashur-Bel-Nisheshu|-1417~-1409/12/31|:CE|疑|精=年|準=年|傳說',

		// Middle Assyrian Empire, 中亞述帝國
		// https://en.wikipedia.org/wiki/Middle_Assyrian_Empire
		'Middle Assyrian/Ashur-Uballit I|-1363~|:CE|疑|精=年|準=年|傳說|注=Gains Assyrian Independecne from Mittani|時期=Assyrian',
		'/Enlil-Nirari|-1327~|:CE|疑|精=年|準=年|傳說',
		'/Arik-Den-Ili|-1317~|:CE|疑|精=年|準=年|傳說',
		'/Adad-Nirari I|-1305~|:CE|疑|精=年|準=年|傳說|注=Mittani falls to Assyria',
		'/Shalmaneser I|-1273~|:CE|疑|精=年|準=年|傳說|注=Urarti falls to Assyria',
		'/Tukulti-Ninurta I|-1243~|:CE|疑|精=年|準=年|傳說|注=Sacks Babylon, killed by his own son',
		'/Ashur-Nadin-Apli|-1206~|:CE|疑|精=年|準=年|傳說|注=Assyrin power is weakened',
		'/Ashur-Nirari III|-1202~|:CE|疑|精=年|準=年|傳說',
		'/Enlil-Kudurri-Usur|-1196~|:CE|疑|精=年|準=年|傳說',
		'/Ninurta-Apal-Ekur|-1191~|:CE|疑|精=年|準=年|傳說',
		'/Ashur-Dan I|-1178~|:CE|疑|精=年|準=年|傳說|注=Elam captures Babylonia',
		'/Ashur-Resha-Ishi I|-1132~|:CE|疑|精=年|準=年|傳說|注=Nebuchadnezzar I of Babylon captures Elam',
		'/Ninurta-Tukulti-Ashur|-1115~-1114|:CE|疑|精=年|準=年|傳說',
		'/Mutakkil-Nusku|-1115~|:CE|疑|精=年|準=年|傳說',
		'/Tiglath-Pileser I|-1114~-1076|:CE|疑|精=年|準=年|傳說|注=In defending Assyria, defeats Nebuchadnezzar',
		// Asharid-Pal-Ekur II: Limited to Nineveh,Irbil, & Ashur province
		'/Ashur-Bel-Kala|-1076~-1057|:CE|疑|精=年|準=年|傳說',
		//
		'/Shamshi-Adad IV|-1053~-1049|:CE|疑|精=年|準=年|傳說',
		// 5 Unknown Rulers: Reigned 39 years
		'/Ashur-Rabi II|-1010~|:CE|疑|精=年|準=年|傳說|注=Isreal & Judah under David & Solomon',
		'/Ashur-Resh-Ishi II|-969~|:CE|疑|精=年|準=年|傳說',
		'/Tiglath-Pilasar II|-966~|:CE|疑|精=年|準=年|傳說',
		'/Ashur-Dan II|-934~|:CE|疑|精=年|準=年|傳說',

		// Neo-Assyrian Empire, 新亞述帝國
		// 亞述人統治巴比倫時期
		// https://en.wikipedia.org/wiki/Neo-Assyrian_Empire
		// https://en.wikipedia.org/wiki/List_of_Assyrian_kings#Neo-Assyrian_Period
		// gettext_config:{"id":"neo-assyrian","mark_type":"part_of_string"}
		'Neo-Assyrian/Adad-nirari II|-911~|:CE|精=年|準=年|時期=Assyrian',
		'/Tukulti-Ninurta II|-891~|:CE|精=年|準=年',
		'/Ashur-nasir-pal II|-883~|:CE|精=年|準=年|ruler=Ashurnasirpal II',
		'/Shalmaneser III|-859~|:CE|精=年|準=年',
		'/Shamshi-Adad V|-824~|:CE|精=年|準=年',
		'/Sammu-ramat|-811~-808|:CE|精=年|準=年|ruler=Shammuramat|君主性別=女',
		'/Adad-nirari III|-811~|:CE|精=年|準=年|ruler=Adad-narari',
		'/Shalmaneser IV|-783~|:CE|精=年|準=年',
		'/Ashur-dan III|-772~|:CE|精=年|準=年',
		'/Ashur-nirari V|-755~|:CE|精=年|準=年',
		'/Tiglath-Pileser III|-745~|:CE|精=年|準=年|ruler=Mukin-zēri',
		'/Shalmaneser V|-727~|:CE|精=年|準=年|ruler=Šulmanu-ašarid',
		'/Marduk-apla-iddina II|-722~-710|:CE|精=年|準=年|ruler=Merodach-Baladan;Marduk-Baladan',
		'/Sargon II|-722~|:CE|精=年|準=年|ruler=Šarru-ukin',
		'/Sennacherib|-705~-681|:CE|精=年|準=年|ruler=Sîn-ahhī-erība',
		'/Marduk-apla-iddina II|-703~|:CE|精=年|準=年',
		'/Bel-ibni|-702~|:CE|精=年|準=年',
		'/Ashur-nadin-shumi|-700~|:CE|精=年|準=年',
		'/Nergal-ushezib|-694~|:CE|精=年|準=年|ruler=Shuzub',
		'/Mushezib-Marduk|-693~-689|:CE|精=年|準=年',
		'/Esarhaddon|-681~|:CE|精=年|準=年|ruler=Aššur-ahu-iddin',
		'/Shamash-shum-ukin|-668~|:CE|精=年|準=年',
		'/Kandalānu|-648~-626/4/4|:CE|精=年|準=年|ruler=Kandalanu|注=Succeeded by Nabopolassar',
		'/Ashurbanipal|-668~-627|:CE|精=年|準=年|ruler=Aššur-bāni-apli',
		'/Ashur-etil-ilani|-631~|:CE|精=年|準=年',
		'/Sin-shumu-lishir|-626~|:CE|精=年|準=年|ruler=Sin-shum-lishir',

		// ------------------------------------------------

		// Urartu (Akkadian Uraštu; Hebrew Ararat; Kingdom of Van; Biainele)
		// 古代美索不達米亞 烏拉爾圖
		// https://en.wikipedia.org/wiki/List_of_kings_of_Urartu
		'Urartu/Arame|-858~|:CE|精=年|準=年|ruler=Aramu;Արամե',
		'/Lutipri|-844~|:CE|精=年|準=年',
		'/Sarduri I|-834~|:CE|精=年|準=年|ruler=Սարդուրի Ա;Sarduris I',
		'/Ishpuini|-834~|:CE|精=年|準=年|ruler=Ishpuinis;Išpuine',
		'/Menua|-810~|:CE|精=年|準=年|ruler=Մենուա;Minua',
		'/Argishti I|-785~|:CE|精=年|準=年|ruler=Արգիշտի;Argište I',
		'/Sarduri II|-764~|:CE|精=年|準=年|ruler=Sardure II',
		'/Rusa I|-735~|:CE|精=年|準=年',
		'/Argishti II|-714~|:CE|精=年|準=年|ruler=Արգիշտի;Argište II',
		'/Rusa II|-680~|:CE|精=年|準=年',
		'/Sarduri III|-639~|:CE|精=年|準=年|ruler=Sardure III',
		'/Erimena|-635~|:CE|精=年|準=年',
		'/Rusa III|-629~|:CE|精=年|準=年',
		'/Sarduri IV|-615~|:CE|精=年|準=年|ruler=Sardure IV',
		'/Rusa IV|-590~-585|:CE|精=年|準=年',

		// https://en.wikipedia.org/wiki/Babylonia
		// https://en.wikipedia.org/wiki/List_of_kings_of_Babylon
		// From this point on, the Babylonian chronology is securely known via
		// Ptolemy's Canon of Kings and other sources.
		//
		// https://en.wikipedia.org/wiki/8th_century_BC
		// February 26, 747 BC: Nabonassar becomes king of Babylon.
		// gettext_config:{"id":"babylonian-dynasty-of-e","mark_type":"part_of_string"}
		// gettext_config:{"id":"babylon","mark_type":"part_of_string"}
		'Babylonian Dynasty of E/Nabonassar|-747~|:CE|精=年|準=年|時期=Babylon|ruler=Nabû-nāṣir',
		'/Nabu-nadin-zeri|-734~|:CE|精=年|準=年|ruler=Nabû-nādin-zēri',
		'/Nabu-suma-ukin II|-732~|:CE|精=年|準=年|ruler=Nabû-šuma-ukîn II|注=king of Babylon for one month and two days during 732 BC before he was swept aside by his successor, Nabû-mukin-zēri.',
		'/Nabu-mukin-zeri|-732/2~-729|:CE|精=年|準=年|ruler=Nabû-mukin-zēri',

		// ------------------------------------------------

		// Babylonian Calendar Converter (626 BCE to 75 CE)
		// http://www.staff.science.uu.nl/~gent0113/babylon/babycal_converter.htm
		// https://en.wikipedia.org/wiki/Babylonian_calendar
		'Babylonian|-626/4/5~76/3/24|-626/=3px 3o6 4m7g58r 4g9 4sba5dx 3sfg49m 431 3kk640m 4y3w5n9 4eq 4so65aq 48a 445 3mmu3pp855y 5r7 41ue4gk 5e2 	29;30;29;30;29;30;閏6=28;30;30;30;29;29;30	3mi 4lh23zp 4l0656y 54bw5sh 4a9 3b5847q 46j 3pa445x 5ca 5u1 3zxi59m 3quk4za 4uz 3kcc45x 4nz059g 5sk 4osm59w 4g9o3me 58r 3wsc4g5 5dx 4h0 5e2 4o2e37x83zq 5kb 4kvw4dm 59l 3rcc48c 3a9846t 3pss55y 5r7 3yos4gi 5e2 4h6 3qna571 4kws55j 46d 3z304gk 5aw 57u 4fd24fcs3mi 4zu 51v05u1 	30;29;29;29;30;29;30;30;30;29;29;31	4sra47p 42j 3lx23zp 4y1o5l6 5rd 4oj059m 44a 3l464vh 3m4c46d 5cy 57bg5sy 	29;30;29;29;30;30;29;31;29;29;29;30	4hqe57a 4lf05jv 55h 53sc5r9 47o 4oly3p1 3mi 4lgs579 3wvw4gi 5ea 3sx84a1 3quk4z1 45y 53lo45p 58q 4rpo5ro 50a 3mx24vq 4bjg4yy 5r9 3z304hw 5es 4okc3oq 4m9o40e 4vb 3vl85yd 59h 3quk43e 40t 374m40m 4m7058y 5si 408c5aq 489 3mng4yz 3pa455h 5qi 5d244es 59w 4g9o3ei 4z1 3pb04yy 4ofg5e1 4a0 4pm43px 3oq 4m7w423 4nng58q 5s9 3yr057e 431 3koc4t7 40d 4lek58y 4sp85ec 4a2 3nos505 4yz 3pa44dh 4r4s5ck 5sk 4o643ml 3la 4l0s563 46b 4oeu4h5 3ep8489 3p1 37x842e 58r 3yd84g9 4sh85d6 47q 3mp84v1 4t2 50fg5n9 47m 4oqu5as 4gnw3fu 4fxo577 56t 5s5 3z304h0 4rrw46l 40q 4y4c3zh 562 548c5rd 489 3a9247p 3l2k42z 42d 4nz05cy 5u9 3z8s59m 4g4s566 55n 3p3045x 590 55ek3tg 510 4cba3fa 4f3g56z 479 4sd85e1 49x 39zw431 3kd840m 5kb 3vzw4ei 59l 3qy448a 439 3knq42u 4nzg5r7 4gy 4sp85ea 596 4f58565 3vmk55m 5qt 3yr047t 3p1 380s3mj 	30;30;29;31;29;30;29;29;30;29;30;29	4f2u56y 554c5sh 4h5 3e7g47p 42j 3lx845p 4qxo58q 5sa 3z9o50q 4vu 49yk4vf 45x 4nrq59g 55qk5us 59m 4g643me 563 3pa44dh 4r6k59l 47p 3mp8419 3zq 4lf0577 47d 4pba5ap 3sx84a2 46l 3m584d2 5qr 3ygs4gi 4rpo5dg 50a 4bzw3e5 4yi 50oc5r9 49w 4osm5as 4okc3or 3m5 4noc58m 5s5 3z4s4k9 3q2443a 40r 3jjw40l 56y 55bg5si 4aa 3ns647q 3mng563 45x 4r4s5ci 5ua 4ojw59o 4fdo3li 55n 3pa446h 59l 3r8c489 3pp 31p23o6 4nsc5qj 4g5 4sdo5e1 49h 3pv04vp 3kkc4t2 5l9 3wws47m 59w 4gng50q 4vp 3mmu4yy 54z05s5 4gy 4spo47h 3oa 4lh83zh 4kws562 5rd 3z8s4a1 3q1 38h842z 40l 3yhi58y 56wc5ua 4i2 3quk47q 4yj 3p3045x 4nrw579 47m 4oss59w 50q 4bzg56z 479 4riu5dw 57do49x 3sd 39i440m 5kb 3vzw4dm 4oj059u 47u 4c6k439 40q 4z3g5nn 4gy 4so65ea 3sy459m 4z1 4eos55i 5ql 4nrw4gk 4ot83p1 3fg 4fdo3md 562 550s5s9 4i0 4t5i47p 3a0c46j 45p 4noc5qi 5zd 3z8s59m 4fgs4vu 4t7 3kkc42t 59e 55qk5us 5as 3rd257a 4lf0563 4d1 53rw5np 4gk 4om43p1 378c40q 565 3pss4eq 5e9 3sx84a1 3px 39zq42e 53l85qj 4ga 554c5re 57e 3pv04vq 4bjg4yy 5n9 3z4s4h4 5es 4iho3oq 505 4m6u58m 5bcc5z9 4km 3quk46t 419 3jks3zq 4lek576 5si 3zfw5aq 489 3mwc4yz 46d 4qxi5qq 5d984gk 59m 4g643lm 55p 3pb04ye 4ofg59l 488 4ot83px 3my 4muk58r 4g5 4sdi5s9 3z584gq 46t 3m5o4t7 3zh 4lek56y 4sp85as 48a 3mwc506 4ve 4rl85s5 5cy 4u9y5t0 4okc3ob 3la 4kx855n 45x 4o0s57t 3eb047t 3n9 37x842d 51m 56p861d 4i1 4i3q47p 3pv04yl 45q 53ks5n7 47m 4ojw59w 4g9o3fe 4vp 3pss479 5dx 3z304h0 5ec 4ok63oa 4lh83zh 55y 548c5rd 49l 3a98439 3koc417 42h 4nz04gy 5e9 3tpo4h6 47p 3peu55j 3p304d1 58y 55cs47o 50s 4c7w3ee 4f3g56z 47e 3zx84i1 49v 3a7g431 42e 4ns65qj 3yd84eq 59l 3qy444a 4t9'
				// 月名: https://en.wikipedia.org/wiki/Babylonian_calendar
				// In year 17 of 19-year cycle,
				// the intercalary month was named Araḫ Ulūlu.
				// @see https://en.wikipedia.org/wiki/Iranian_calendars
				+ "|參照用"
				// gettext_config:{"id":"babylonian-calendar","mark_type":"part_of_string"}
				+ "|曆法=Babylonian calendar|據=Parker & Dubberstein (1971)|月名=Nisānu;Āru;Simanu;Dumuzu;Abu;Ulūlu;Tišritum;Samna;Kislimu;Ṭebētum;Šabaṭu;Addaru;Makaruša Addari",

		// Median dynasty, Medes, 米底王國
		// https://en.wikipedia.org/wiki/List_of_rulers_of_the_pre-Achaemenid_kingdoms_of_Iran#Median_dynasty,_726%E2%80%93521_BC
		'Median/Deioces|-727~|:CE|疑|精=年|準=年|ruler=Dia—oku;Dēiokēs Δηιόκης|注=可疑',
		'/Xšaθrita I|-675~|:CE|疑|精=年|準=年|ruler=Phraortes;𐎳𐎼𐎺𐎼𐎫𐎡𐏁;Φραόρτης|注=君主姓名可疑',
		'/Madius|-628~|:CE|疑|精=年|準=年|ruler=Madyes;Madya|注=斯基泰人統治時期 Scythian rule',
		'/Cyaxares|-625~|:CE|疑|精=年|準=年|ruler=𐎢𐎺𐎧𐏁𐎫𐎼',
		'/Astyages|-585~-550|:CE|疑|精=年|準=年|ruler=Ἀστυάγης|注=把女兒下嫁給當時隸屬於米底的波斯部落的阿契美尼德家族的岡比西斯一世，後來生下王子 Cyrus II；前553年—前550年，Cyrus II 起兵反叛米底，在帕薩爾加德戰役打敗自己的外公 Astyages，建立阿契美尼德王朝，米底王國結束。',
		'/Cyaxares II|-549~-521/5|:CE|疑|精=年|準=年|注=希臘歷史學家色諾芬描述的米底王國君主。沒在希羅多德和凱蒂西亞的歷史中提到，許多學者懷疑他存在。',

		'Neo-Assyrian/Sin-shar-ishkun|Babylonian-626~|:Babylonian|疑|準=年|ruler=Sinsharishkun',
		'/Ashur-uballit II|Babylonian-612~Babylonian-608|:Babylonian|疑|準=年',

		// Dynasty XI of Babylon (Neo-Babylonian or Chaldean Dynasty)
		// gettext_config:{"id":"neo-babylonian","mark_type":"part_of_string"}
		'Neo-Babylonian/Nabopolassar|Babylonian-626~|:Babylonian|疑|準=年|時期=Babylon|ruler=Nabû-apla-uṣur',
		'/Nebuchadnezzar II|Babylonian-605~|:Babylonian|疑|準=年|ruler=Nabû-kudurri-usur',
		'/Amel-Marduk|Babylonian-562~|:Babylonian|疑|準=年|ruler=Amēl-Marduk',
		'/Neriglissar|Babylonian-560~|:Babylonian|疑|準=年|ruler=Nergal-šar-uṣur',
		'/Labashi-Marduk|Babylonian-556~|:Babylonian|疑|準=年',
		'/Nabonidus|Babylonian-556/4~-539|:Babylonian|疑|準=年|ruler=Nabû-naʾid',
		'/Belshazzar|Babylonian-553~-539|:Babylonian|疑|準=年|ruler=Bēl-šarra-uṣur',

		// Cyrus II: founder of the Achaemenid Empire (𐎱𐎠𐎼𐎿, 阿契美尼德王朝),
		// King of Kings of Persia, Kings of Anshan
		// should use Zoroastrian calendar?
		// @see https://en.wikipedia.org/wiki/Iranian_calendars
		// gettext_config:{"id":"persia","mark_type":"part_of_string"}
		'Persia/Cyrus II|Babylonian-559~|:Babylonian|疑|準=年|ruler=𐎤𐎢𐎽𐎢𐏁;کوروش بزرگ;Kūruš;Cyrus the Great',
		'/Cambyses II|Babylonian-530~|:Babylonian|疑|準=年|ruler=کمبوجيه دوم',
		'/Bardiya|Babylonian-522~|:Babylonian|疑|準=年|ruler=𐎲𐎼𐎮𐎡𐎹;Bardia;Σμέρδις;Smerdis',
		'/Darius I|Babylonian-522/7~|:Babylonian|疑|準=年|ruler=𐎭𐎠𐎼𐎹𐎺𐎢𐏁;𐎭𐎠𐎼𐎹𐎢𐏁;Darius the Great',
		'/Xerxes I|Babylonian-486/8~|:Babylonian|疑|準=年|ruler=Xšaya-ṛšā;𐎧𐏁𐎹𐎠𐎼𐏁𐎠',
		'/Artaxerxes I|Babylonian-465/6~|:Babylonian|疑|準=年|ruler=اردشیر یکم|注=The last inscription mentioning Artaxerxes I being alive can be dated to December 24, 424 BC.',
		'/Xerxes II|-423~-423/2|:Babylonian|疑|準=年|ruler=خشايارشا دوم|注=wiki:阿契美尼德王朝: 在位45天被妃嬪之子暗殺',
		'/Sogdianus|-423~-423/6|:Babylonian|疑|準=年|ruler=سغدیانوس|注=He reigned for six months and fifteen days before being captured by his half-brother, Ochus, who rebelled against him.',
		'/Darius II|-423~|:Babylonian|疑|準=年|ruler=داريوش دوم‎|注=The first inscription of Ochus as Darius II can be dated to January 10, 423 BC.',
		'/Artaxerxes II|Babylonian-404~|:Babylonian|疑|準=年|ruler=𐎠𐎼𐎫𐎧𐏁𐏂𐎠;Artaxerxes II Memnon',
		'/Artaxerxes III|Babylonian-359/12~|:Babylonian|疑|準=年|ruler=اردشير سوم;𐎠𐎼𐎫𐎧𐏁𐏂𐎠;Artaxerxes III Ochus',
		'/Artaxerxes IV|Babylonian-338/8~|:Babylonian|疑|準=年|ruler=اردشيرچهارم‎;Artaxerxes (Artaxšacā) IV Arses;Artaxerxes IV Arses',
		// Babylonian “Astronomical Diary” mentioning a lunar eclipse on 13
		// Ulūlu in the 5th year of Darius III [20 September 331 BCE], ten days
		// before the battle of Gaugamela (British Museum)
		'/Darius III|Babylonian-335~|:Babylonian|疑|準=年|ruler=Artashata;Codomannus',
		'/Bessus|Babylonian:-330~-329/7|:Babylonian|疑|準=年|ruler=Artaxerxes V',

		// https://en.wikipedia.org/wiki/List_of_people_known_as_The_Great
		// Ἀργεάδαι, Argead dynasty
		// gettext_config:{"id":"macedon","mark_type":"part_of_string"}
		'Μακεδονία/Alexander III|Babylonian-336/4~-323/6/10|:Babylonian|疑|準=年|ruler=Ἀλέξανδρος ὁ Μέγας;Alexander the Great|生=-356/7/20 or 21|卒=-323/6/10 or 11',
		'/Philip III|-323/6/11~-317/12/25|:Babylonian|疑|準=年|ruler=Philip III Arrhidaeus;Φίλιππος Γ΄ ὁ Ἀρριδαῖος|卒=-317/12/25|注=reigned as king of Macedonia from after June 11, 323 BC until his death, December 25, 317 BC.',
		'/Alexander IV|Babylonian-323/5~-309|:Babylonian|疑|準=年|ruler=Ἀλέξανδρος Δ΄;Alexander IV Aegus|生=-323/8',

		/**
		 * 塞琉古紀元，是一套塞琉古帝國以及之後受希臘化文明影響的古代國家所採用的紀年方式。
		 * 
		 * The Seleucid era or Anno Graecorum (literally "year of the Greeks" or
		 * "Greek year"), sometimes denoted "AG", was a system of numbering
		 * years in use by the Seleucid Empire and other countries among the
		 * ancient Hellenistic civilizations.
		 * 
		 * The natives of the empire used the Babylonian calendar, in which the
		 * new year falls on 1 Nisanu (3 April in 311 BC)
		 * 
		 * The Macedonian court adopted the Babylonian calendar (substituting
		 * the Macedonian month names ) but reckoned the new year to be in the
		 * autumn (the exact date is unknown).
		 * 
		 * @see https://en.wikipedia.org/wiki/Seleucid_era
		 */
		/**
		 * 古代馬其頓曆 The Macedonian calendar was in essence the Babylonian calendar
		 * with the substitution of Macedonian names for the Babylonian ones.
		 * 
		 * Under the Seleucid Empire, the Macedonians adopted the Seleucid era.
		 * The year beginning on the 1st of Dios during what we call October 312
		 * BCE was declared to be the year one of the Seleucid era.
		 * 
		 * @see https://en.wikipedia.org/wiki/Ancient_Macedonian_calendar
		 */
		/**
		 * His return to Babylon was afterwards officially regarded as the
		 * beginning of the Seleucid Empire and that year as the first of the
		 * Seleucid era.
		 * 
		 * @see https://en.wikipedia.org/wiki/Seleucus_I_Nicator
		 */
		/**
		 * Hallock (1969, p. 74) maintains that the Old Persian calendar
		 * followed the same system of intercalation as the Babylonian calendar.
		 * Hartner’s interpretation differs: “The Old Persian and the Babylonian
		 * calendars will then have had different systems of intercalation. The
		 * latter we have seen operated with irregular, empirical Ulūlu and
		 * Addāru intercalations down to 527, then passed over to the octaëteris
		 * and finally, when in the 19th year of Darius the beginning of the
		 * year coincided with spring equinox, to the 19-year cycle” (1985, p.
		 * 747).
		 * 
		 * Alex­ander probably used the Macedonian calendar, but the Achaemenid
		 * system seems not to have been abolished. In the time of Seleucus I
		 * (321-281 B.C.) the Babylonian calendar was adopted, but the original
		 * names of the months were replaced by the Macedonian names, in which
		 * Nīsannu corresponded to Artemisios and so on (cf. Bickerman, 1980, p.
		 * 20). The Arsacid kings fol­lowed the same practice, but it appears
		 * from material discovered at Nisa (2nd-1st century B.C.) and Avroman
		 * (1st cent. a.d.) that the Zoroastrian solar calendar (see below) was
		 * also used.
		 * 
		 * @see http://www.iranicaonline.org/articles/calendars
		 */
		'Seleucid era|Babylonian-311~76/3/24|:Babylonian|疑|準=年',
		// Seleucid Empire
		// gettext_config:{"id":"seleucid","mark_type":"part_of_string"}
		'Σελευκιδών/Seleucus I|Babylonian-306~|:Babylonian|疑|準=年|ruler=Seleucus I Nicator;Σέλευκος Α΄ Νικάτωρ',
		// he was assassinated by Ptolemy Keraunos near Lysimachia September
		// (281 BC).
		'/Antiochus I|Babylonian-281/7~|:Babylonian|疑|準=年|ruler=Antiochus I Soter;Ἀντίοχος Α΄ ὁ Σωτήρ',
		// He succeeded his father Antiochus I Soter in the winter of 262–61 BC.
		'/Antiochus II|Babylonian-262/10~|:Babylonian|疑|準=年|ruler=Antiochus II Theos;Ἀντίοχος Β΄ ὁ Θεός',
		'/Seleucus II|Babylonian-246~|:Babylonian|疑|準=年|ruler=Seleucus II Callinicus Pogon;Σέλευκος Β΄ ὁ Καλλίνικος ὁ Πώγων',
		'/Seleucus III|Babylonian-225~|:Babylonian|疑|準=年|ruler=Seleucus III Soter;Seleucus Ceraunus;Σέλευκος Γ΄ ὁ Σωτήρ, ὁ Κεραυνός',
		'/Antiochus III|Babylonian-222~|:Babylonian|疑|準=年|ruler=Ἀντίoχoς Μέγας',
		'/Seleucus IV|Babylonian-187~|:Babylonian|疑|準=年|ruler=Seleucus IV Philopator;Σέλευκος Δ΄ Φιλοπάτωρ',
		'/Antiochus IV|Babylonian-175~|:Babylonian|疑|準=年|ruler=Antiochus IV Epiphanes;Ἀντίοχος Δ΄ ὁ Ἐπιφανής',
		"/Antiochus V|Babylonian-164~|:Babylonian|疑|準=年|ruler=Antiochus V Eupator;Αντίοχος Ε' Ευπάτωρ",
		'/Demetrius I|Babylonian-161~|:Babylonian|疑|準=年|ruler=Demetrius I Soter;Δημήτριος Α`',
		'/Alexander Balas|Babylonian-150~|:Babylonian|疑|準=年|ruler=Ἀλέξανδρoς Bάλας',
		'/Demetrius II|Babylonian-146~-137|:Babylonian|疑|準=年|ruler=Demetrius II Nicator;Δημήτριος Β`',
		'/Antiochus VI|Babylonian-145~|:Babylonian|疑|準=年|ruler=Antiochus VI Dionysus|卒=-142 or -141',
		'/Diodotus Tryphon|Babylonian-142~|:Babylonian|疑|準=年|ruler=Διόδοτος Τρύφων',
		'/Antiochus VII|Babylonian-138~|:Babylonian|疑|準=年|ruler=Antiochus VII Euergetes;Antiochus VII Sidetes',
		'/Demetrius II|Babylonian-129~-126|:Babylonian|疑|準=年',
		'/Alexander II|Babylonian-128~-123|:Babylonian|疑|準=年|ruler=Alexander II Zabinas;Ἀλέξανδρoς Zαβίνας',
		'/Cleopatra Thea|-125~-121|:Babylonian|疑|準=年|ruler=Κλεοπάτρα Θεά',
		'/Antiochus IX|Babylonian-114~|:Babylonian|疑|準=年|ruler=Antiochus IX Cyzicenus;Antiochus IX Eusebes',
		'/Antiochus X|-95~-83|:Babylonian|疑|準=年|ruler=Antiochus X Eusebes Philopator',
		'/Antiochus VIII|-125~|:Babylonian|疑|準=年|ruler=Antiochus VIII Grypus;Antiochus VIII Epiphanes/Callinicus/Philometor',
		'/Seleucus VI|Babylonian-96~|:Babylonian|疑|準=年|ruler=Seleucus VI Epiphanes Nikator;Σέλευκος ΣΤ΄',
		'/Demetrius III|Babylonian-95~-95|:Babylonian|疑|準=年|ruler=Demetrius III Eucaerus',
		'/Philip I|Babylonian-95~-83|:Babylonian|疑|準=年|ruler=Philip I Philadelphus',
		'/Antiochus XI|Babylonian-95~-92|:Babylonian|疑|準=年|ruler=Antiochus XI Epiphanes',
		'/Antiochus XII|-87~|:Babylonian|疑|準=年|ruler=Antiochus XII Dionysus (Epiphanes/Philopator/Callinicus)',
		'/Seleucus VII|Babylonian-83~|:Babylonian|疑|準=年|ruler=Seleucus VII Philometor;Σέλευκος Ζ΄;Tigranes the Great;Tigranes II of Armenia',
		'/Antiochus XIII|Babylonian-69~|:Babylonian|疑|準=年|ruler=Antiochus XIII Philadelphus;Asiaticus',
		'/Philip II|Babylonian-65~-63|:Babylonian|疑|準=年|ruler=Philip II Philorhomaeus;Φίλιππος Β΄ ὁ Φιλορωμαῖος;Barypous',

		// ------------------------------------------------

		// https://en.wikipedia.org/wiki/List_of_rulers_of_Elam
		// Neo-Elamite Period, 新埃蘭時期
		// Humban-Tahrid (Neo-Elamite) dynasty
		'Elam/Humban-Tahrah I|-821~|:CE|疑|精=年|準=年|title=king of Elam',
		'/Humban-Nikash I|-743~|:CE|疑|精=年|準=年|title=king of Elam|關係=son of Humban-Tahrah I',
		'/Shutur-Nahhunte II|-717~|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son (Ruhushak) of Humban-Nikash I',
		'/Hallushu-Inshushinak|-699~|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=brother of Shutur-Nahhunte II',
		'/Kutir-Nahhunte III|-693/10~|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Hallushu-Inshushinak',
		'/Humban-Numena III|-692/7~|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Hallushu-Inshushinak',
		'/Humban-Haltash I|-688/2~|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Humban-Numena III (?)',
		'/Humban-Haltash II|-681/10~|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Humban-Haltash I',
		'/Urtak|-675/9~|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=brother of Humban-Haltash II',
		'/Teumman|-663~|:CE|疑|精=年|準=年|title=king of Anshan & Susa',
		'/Humban-Nikash II|-653/9~|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Urtak',
		'/Tammaritu II|-652~|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Humban-Hapua son of Urtak',
		'/Indabibi|-649~|:CE|疑|精=年|準=年|title=king of Anshan & Susa',
		'/Humban-Haltash III|-648/7~-644|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Atta-hamiti-Inshushinak',
		'/Tammaritu II|-647~-647|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Humban-Hapua son of Urtak',
		'/Humban-Nikash III|-647~-647|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Atta-Merra-Halki',
		'/Umhuluma|-647~-647|:CE|疑|精=年|準=年|title=king of Anshan & Susa',
		'/Indattu-Inshushinak IV|-647~-646/10|:CE|疑|精=年|準=年|title=king of Anshan & Susa',
		'/Humban-Hapua|-647~-647|:CE|疑|精=年|準=年|title=king of Anshan & Susa',
		"/Pa'e|-646/8~-644|:CE|疑|精=年|準=年|title=king of Anshan & Susa",
		'/Shutur-Nahhunte III|-646/8~-600/12|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Indattu-Inshushinak IV',
		'/Açina|-522/10~|:CE|疑|精=年|準=年|title=king of Elam|關係=son of Upadrama',
		'/Ummanunu II|-522/12/10~|:CE|疑|精=年|準=年|title=king of Elam|注=Ummanunu II or Humban-Nikash IV (Ummaniš)',
		'/Atta-hamiti-Inshushinak|-521/2~-519|:CE|疑|精=年|準=年|title=king of Anshan & Susa|關係=son of Hutran-Temti',

]).minute_offset = 3 * 60;

// ---------------------------------------------------------------------//
// Ancient Greece 古希臘
// https://en.wikipedia.org/wiki/Lists_of_rulers_of_Greece

// gettext_config:{"id":"greece"}
(CeL.era.pass_on.countries["Greece"] = [

		// Ancient Greek: Athens
		// https://en.wikipedia.org/wiki/List_of_kings_of_Athens

		// Erechtheid dynasty
		// gettext_config:{"id":"classical-athens","mark_type":"part_of_string"}
		'Erechtheid/Cecrops I|-1556~|:CE|傳說|精=年|準=年|時期=Ἀθῆναι',
		'/Cranaus|-1506~|:CE|傳說|精=年|準=年',
		'/Amphictyon|-1497~|:CE|傳說|精=年|準=年',
		'/Erichthonius|-1487~|:CE|傳說|精=年|準=年',
		'/Pandion I|-1437~|:CE|傳說|精=年|準=年',
		'/Erechtheus|-1397~|:CE|傳說|精=年|準=年',
		"/Cecrops II|-1347~|:CE|傳說|精=年|準=年|注=Omitted in Heraclides' epitome of Aristotle's Constitution of the Athenians",
		'/Pandion II|-1307~|:CE|傳說|精=年|準=年',
		'/Aegeus|-1282~|:CE|傳說|精=年|準=年|注=Construction of Trojan Walls by Poseidon, Apollo and the mortal Aeacus (c. 1282 BC)',
		'/Theseus|-1234~|:CE|傳說|精=年|準=年',
		'/Menestheus|-1205~|:CE|傳說|精=年|準=年|注=Trojan War and the Sack of Troy (c. 1183 BC)',
		'/Demophon|-1183~|:CE|傳說|精=年|準=年',
		'/Oxyntes|-1150~|:CE|傳說|精=年|準=年',
		'/Apheidas|-1136~|:CE|傳說|精=年|準=年',
		'/Thymoetes|-1135~-1127|:CE|傳說|精=年|準=年',

		// Melanthid dynasty
		'Melanthid/Melanthus|-1126~|:CE|傳說|精=年|準=年|時期=Ἀθῆναι',
		'/Codrus|-1089~-1068|:CE|傳說|精=年|準=年',

		// ------------------------------------------------

		// Ancient Greek: Sparta
		// https://en.wikipedia.org/wiki/List_of_kings_of_Sparta
		// Agiad dynasty
		// gettext_config:{"id":"sparta","mark_type":"part_of_string"}
		'Agiad/Eurysthenes|-930~|:CE|傳說|精=年|準=年|時期=Σπάρτη|注=Return of the Heracleidae',
		'/Agis I|-930~|:CE|傳說|精=年|準=年|注=Subjugated the Helots',
		'/Echestratus|-900~|:CE|傳說|精=年|準=年|注=Expelled the Cynurensians[n 4] that were in power.',
		'/Labotas[n 5]|-870~|:CE|傳說|精=年|準=年',
		'/Doryssus|-840~|:CE|傳說|精=年|準=年',
		'/Agesilaus I|-820~|:CE|傳說|精=年|準=年',
		'/Archelaus|-790~|:CE|傳說|精=年|準=年',
		'/Teleclus|-760~|:CE|傳說|精=年|準=年|注=Killed by the Messenians',
		'/Alcamenes|-758~|:CE|傳說|精=年|準=年|注=First Messenian War begins',
		'/Polydorus|-741~|:CE|傳說|精=年|準=年|注=Second Messenian War begins; Killed by Athenian Archon Polemarchus[5]',
		'/Eurycrates|-665~|:CE|傳說|精=年|準=年',
		'/Anaxander|-640~|:CE|傳說|精=年|準=年',
		'/Eurycratides|-615~|:CE|傳說|精=年|準=年',
		'/Leon|-590~|:CE|傳說|精=年|準=年',
		'/Anaxandridas II|-560~|:CE|傳說|精=年|準=年|注=Battle of the Fetters',
		'/Cleomenes I|-520~|:CE|傳說|精=年|準=年|注=Greco-Persian Wars begins',
		'/Leonidas I|-490~|:CE|傳說|精=年|準=年|注=Battle of Thermopylae',
		'/Pleistarchus|-480~|:CE|傳說|精=年|準=年|注=First Peloponnesian War begins',
		'/Pleistoanax|-459~|:CE|傳說|精=年|準=年|注=Second Peloponnesian War begins',
		'/Pausanias|-409~|:CE|傳說|精=年|準=年|注=Helped restore democracy in Athens; Spartan hegemony',
		'/Agesipolis I|-395~|:CE|傳說|精=年|準=年|注=Corinthian War begins',
		'/Cleombrotus I|-380~|:CE|傳說|精=年|準=年',
		'/Agesipolis II[n 6]|-371~|:CE|傳說|精=年|準=年',
		'/Cleomenes II|-369~|:CE|傳說|精=年|準=年|注=Third Sacred War begins',
		'/Areus I|-309~|:CE|傳說|精=年|準=年|注=Killed in battle against Aristodemus, the tyrant of Megalopolis',
		'/Acrotatus II|-265~|:CE|傳說|精=年|準=年',
		'/Areus II[6]|-262~|:CE|傳說|精=年|準=年',
		'/Leonidas II|-254~|:CE|傳說|精=年|準=年|注=Briefly deposed while in exile avoiding trial',
		'/Cleombrotus II|-242~|:CE|傳說|精=年|準=年',
		'/Leonidas II|-241~|:CE|傳說|精=年|準=年',
		'/Cleomenes III|-235~-222|:CE|傳說|精=年|準=年',

		// Eurypontid dynasty
		'Eurypontid/Procles|-930~|:CE|傳說|精=年|準=年|時期=Σπάρτη|注=Return of the Heracleidae',
		'/Soos[n 7][7]|-890~|:CE|傳說|精=年|準=年|注=Son of Procles and father of Eurypon.',
		'/Eurypon|-890~|:CE|傳說|精=年|準=年',
		'/Prytanis|-860~|:CE|傳說|精=年|準=年',
		'/Polydectes|-830~|:CE|傳說|精=年|準=年',
		'/Eunomus|-800~|:CE|傳說|精=年|準=年',
		'/Charilaus|-780~|:CE|傳說|精=年|準=年|注=Ward, pupil, and nephew of the Spartan reformer Lycurgus; War with the Argives and destroyed the border-town of Aegys; Battle of Tegea.',
		'/Nicander|-750~|:CE|傳說|精=年|準=年|注=First Messenian War begins.',
		'/Theopompus|-725~|:CE|傳說|精=年|準=年|注=Second Messenian War begins.',
		// Currently known two lists of kings
		'/Anaxandridas I|-675~|:CE|傳說|精=年|準=年',
		'/Zeuxidamus|-645~|:CE|傳說|精=年|準=年',
		'/Anaxidamus|-625~|:CE|傳說|精=年|準=年',
		'/Archidamus I|-600~|:CE|傳說|精=年|準=年',
		'/Agasicles|-575~|:CE|傳說|精=年|準=年|注=Contemporary with Leonidas I; End of the Messenian Wars.',
		// ↑ Currently known two lists of kings
		'/Ariston|-550~|:CE|傳說|精=年|準=年|注=Battle of the Fetters.',
		'/Demaratus|-515~|:CE|傳說|精=年|準=年|注=Greco-Persian Wars begins.',
		'/Leotychidas|-491~|:CE|傳說|精=年|準=年',
		'/Archidamus II|-469~|:CE|傳說|精=年|準=年|注=First Peloponnesian War; Second Peloponnesian War begins',
		'/Agis II|-427~|:CE|傳說|精=年|準=年|注=Spartan hegemony; Attacked Epidaurus, Leuctra,[n 9] Caryao, Orchomenos, and Mantinela; Invaded the Argolis; Council of war[n 10] formed to check his powers.',
		'/Agesilaus II|-401~|:CE|傳說|精=年|準=年|注=Corinthian War begins',
		'/Archidamus III|-360~|:CE|傳說|精=年|準=年|注=Third Sacred War begins',
		'/Agis III|-338~|:CE|傳說|精=年|準=年',
		'/Eudamidas I|-331~|:CE|傳說|精=年|準=年',
		'/Archidamus IV|-305~|:CE|傳說|精=年|準=年',
		'/Eudamidas II|-275~|:CE|傳說|精=年|準=年',
		'/Agis IV|-245~|:CE|傳說|精=年|準=年',
		'/Eudamidas III|-241~|:CE|傳說|精=年|準=年',
		'/Archidamus V|-228~|:CE|傳說|精=年|準=年',
		'/Eucleidas|-227~-221|:CE|傳說|精=年|準=年|注=Actually an Agiad; installed by Cleomenes III[n 11] in place of Archidamus V.',

		// Republic monarchy
		// Sparta was a republic from 221 to 219 BC.
		// The dual monarchy was restored in 219 BC.
		'Republic Sparta/Agesipolis III|-219~-215|:CE|傳說|精=年|準=年|時期=Σπάρτη|注=last Agiad, deposed by Lycurgus',
		'/Lycurgus|-219~|:CE|傳說|精=年|準=年',
		'/Pelops|-210~-206|:CE|傳說|精=年|準=年|注=son of Lycurgus and last king from either of the old dynasties',

		// Tyrants
		'Tyrants Sparta/Machanidas|-210~-207|:CE|傳說|精=年|準=年|時期=Σπάρτη|注=regent for Pelops',
		'/Nabis|-206~|:CE|傳說|精=年|準=年|注=first regent for Pelops, then usurper, claiming descent from the Eurypontid king Demaratus',
		'/Laconicus|-192~-192|:CE|傳說|精=年|準=年|注=last known king of Sparta from Heraclid dynasty',
// The Achaean League annexed Sparta in 192 BC.

// ------------------------------------------------

]).minute_offset = 3 * 60;

// ---------------------------------------------------------------------//
// Egypt 古埃及
// https://en.wikipedia.org/wiki/Ancient_Egypt
// https://en.wikipedia.org/wiki/List_of_ancient_Egyptian_dynasties
// https://en.wikipedia.org/wiki/Egyptian_chronology
// https://en.wikipedia.org/wiki/List_of_pharaohs

/**
 * A Chronological Survey of Precisely Dated Demotic and Abnormal Hieratic
 * Sources, Version 1.0 (February 2007)
 * 
 * @see http://www.trismegistos.org/top.php
 */

// gettext_config:{"id":"egypt"}
(CeL.era.pass_on.countries["Egypt"] = [

		// Joann Fletcher. (2016).
		// The Story of Egypt: The Civilization that Shaped the World
		// (Pegasus Books)

		// 1st Dynasty
		'Dynasty I/Narmer|-3100~|:CE|疑|精=年|準=年|時期=Early Dynastic',
		'/Aha|-3085~|:CE|疑|精=年|準=年',
		'/Djer|-3040~|:CE|疑|精=年|準=年',
		'/Djet|-2990~|:CE|疑|精=年|準=年',
		'/Merneith|-2965~|:CE|疑|精=年|準=年',
		'/Den|-2960~|:CE|疑|精=年|準=年',
		'/Anedjib|-2925~|:CE|疑|精=年|準=年',
		'/Semerkhet|-2900~|:CE|疑|精=年|準=年',
		'/Qaa|-2890~|:CE|疑|精=年|準=年',

		// 2nd Dynasty
		'Dynasty II/Hetepsekhemwy|-2890~|:CE|疑|精=年|準=年|時期=Early Dynastic',
		'/Nebra|-2865~|:CE|疑|精=年|準=年',
		'/Peribsen|-2700~|:CE|疑|精=年|準=年',
		'/Khasekhemwy|-2686~|:CE|疑|精=年|準=年',

		// 3rd Dynasty
		'Dynasty III/Nebka|-2686~|:CE|疑|精=年|準=年|時期=Old Kingdom',
		'/Djoser|-2667~|:CE|疑|精=年|準=年',
		'/Sekhemkhet|-2648~|:CE|疑|精=年|準=年',
		'/Khaba|-2640~|:CE|疑|精=年|準=年',
		'/Huni|-2637~|:CE|疑|精=年|準=年',

		// 4th Dynasty
		'Dynasty IV/Snefru|-2613~|:CE|疑|精=年|準=年|時期=Old Kingdom',
		'/Khufu|-2589~|:CE|疑|精=年|準=年',
		'/Djedefra|-2566~|:CE|疑|精=年|準=年',
		'/Khafra|-2558~|:CE|疑|精=年|準=年',
		'/Menkaura|-2532~|:CE|疑|精=年|準=年',
		'/Khentkawes I|-2503~|:CE|疑|精=年|準=年',
		'/Shepseskaf|-2503~-2498|:CE|疑|精=年|準=年',

		// 5th Dynasty
		'Dynasty V/Userkaf|-2494~|:CE|疑|精=年|準=年|時期=Old Kingdom',
		'/Sahura|-2487~|:CE|疑|精=年|準=年',
		'/Neferirkara|-2475~|:CE|疑|精=年|準=年',
		'/Khentkawes II|-2455~|:CE|疑|精=年|準=年',
		'/Shepseskara|-2455~|:CE|疑|精=年|準=年',
		'/Raneferef|-2448~|:CE|疑|精=年|準=年',
		'/Niuserra|-2445~|:CE|疑|精=年|準=年',
		'/Menkauhor|-2421~|:CE|疑|精=年|準=年',
		'/Djedkara|-2414~|:CE|疑|精=年|準=年',
		'/Unas|-2375~|:CE|疑|精=年|準=年',

		// 6th Dynasty
		'Dynasty VI/Teti|-2345~|:CE|疑|精=年|準=年|時期=Old Kingdom',
		'/Userkara|-2323~|:CE|疑|精=年|準=年',
		'/Pepi I|-2321~|:CE|疑|精=年|準=年',
		'/Merenra|-2287~|:CE|疑|精=年|準=年',
		'/Pepy II|-2278~|:CE|疑|精=年|準=年',
		'/Nerntyemsaf|-2184~|:CE|疑|精=年|準=年',
		'/Neitikrety|-2184~-2181|:CE|疑|精=年|準=年|君主性別=女',

		// 11th Dynasty (Thebes)
		'Dynasty XI/Intef I|-2125~|:CE|疑|精=年|準=年|時期=First Intermediate',
		'/Intef II|-2112~|:CE|疑|精=年|準=年',
		'/Intef III|-2063~|:CE|疑|精=年|準=年',
		// 11th Dynasty (all Egypt)
		'/Montuhotep II|-2055~|:CE|疑|精=年|準=年',
		'/Sankhkara|-2004~|:CE|疑|精=年|準=年|ruler=Montuhotep III',
		'/Montuhotep IV|-1992~|:CE|疑|精=年|準=年',

		// 12th Dynasty
		'Dynasty XII/Amenemhat I|-1985~-1955|:CE|疑|精=年|準=年|時期=Middle Kingdom',
		'/Sesostris I|-1965~-1921|:CE|疑|精=年|準=年',
		'/Amenemhat II|-1922~-1878|:CE|疑|精=年|準=年',
		'/Sesostris II|-1880~|:CE|疑|精=年|準=年',
		'/Sesostris III|-1874~|:CE|疑|精=年|準=年',
		'/Amenemhat III|-1855~|:CE|疑|精=年|準=年',
		'/Amenemhat IV|-1808~|:CE|疑|精=年|準=年',
		'/Sobeknefru|-1799~-1795|:CE|疑|精=年|準=年|君主性別=女',

		// 17th Dynasty
		'Dynasty XVII/Sobekemsaf|-1570~|:CE|疑|精=年|準=年|時期=Second Intermediate',
		// Intef VI
		// Tao I
		'/Seqenra|-1560~|:CE|疑|精=年|準=年|ruler=Tao II',
		'/Kamose|-1555~|:CE|疑|精=年|準=年',

		// 18th Dynasty
		'Dynasty XVIII/Ahmose I|-1550~|:CE|疑|精=年|準=年|時期=New Kingdom',
		'/Amenhotep I|-1525~|:CE|疑|精=年|準=年',
		'/Tuthmosis I|-1504~|:CE|疑|精=年|準=年',
		'/Tuthmosis II|-1492~|:CE|疑|精=年|準=年',
		'/Tuthmosis III|-1479~-1425|:CE|疑|精=年|準=年',
		'/Hatshepsut|-1473~-1458|:CE|疑|精=年|準=年|君主性別=女',
		'/Amenhotep II|-1427~|:CE|疑|精=年|準=年',
		'/Tuthmosis IV|-1400~|:CE|疑|精=年|準=年',
		'/Amenhotep III|-1390~|:CE|疑|精=年|準=年',
		'/Amenhotep IV|-1352~-1336|:CE|疑|精=年|準=年|君主=Akhenaten',
		'/Smenkhkara|-1338~|:CE|疑|精=年|準=年|君主=Nefernefruaten;Neferneferuaten;Nefertiti|君主性別=女|注=由於斯門卡瑞在位時候短，又正好接續在阿肯那頓之後，因此有些考古學家認為斯門卡瑞就是阿肯那頓的皇后娜芙蒂蒂，因為娜芙蒂蒂的名字幾乎是在同一時期在埃及史上消失，考古學家認為可能是她改了名字當上法老。',
		'/Tutankhamen|-1336~|:CE|疑|精=年|準=年',
		'/Ay|-1327~|:CE|疑|精=年|準=年',
		'/Horemheb|-1323~|:CE|疑|精=年|準=年',

		// 19th Dynasty
		'Dynasty XIX/Ramses I|-1295~|:CE|疑|精=年|準=年|時期=New Kingdom',
		'/Seti I|-1294~|:CE|疑|精=年|準=年',
		'/Ramses II|-1279~|:CE|疑|精=年|準=年',
		'/Merenptah|-1213~|:CE|疑|精=年|準=年',
		'/Amenmesse|-1203~|:CE|疑|精=年|準=年',
		'/Seti II|-1200~|:CE|疑|精=年|準=年',
		'/Siptah|-1194~|:CE|疑|精=年|準=年',
		'/Tawosret|-1188~|:CE|疑|精=年|準=年|君主性別=女',

		// 20th Dynasty
		'Dynasty XX/Sethnakht|-1186~|:CE|疑|精=年|準=年|時期=New Kingdom',
		'/Ramses III|-1184~|:CE|疑|精=年|準=年',
		'/Ramses IV|-1153~|:CE|疑|精=年|準=年',
		'/Ramses V|-1147~|:CE|疑|精=年|準=年',
		'/Ramses VI|-1143~|:CE|疑|精=年|準=年',
		'/Ramses VII|-1136~|:CE|疑|精=年|準=年',
		'/Ramses VIII|-1129~|:CE|疑|精=年|準=年',
		'/Ramses IX|-1126~|:CE|疑|精=年|準=年',
		'/Ramses X|-1108~|:CE|疑|精=年|準=年',
		'/Ramses XI|-1099~|:CE|疑|精=年|準=年',

		// 21st Dynasty (Tanis)
		'Dynasty XXI/Smendes|-1069~|:CE|疑|精=年|準=年|時期=Third Intermediate',
		'/Amenemnisu|-1043~|:CE|疑|精=年|準=年',
		'/Psusennes I|-1039~-991|:CE|疑|精=年|準=年',
		'/Amenemope|-993~|:CE|疑|精=年|準=年',
		'/Osorkon the Elder|-984~|:CE|疑|精=年|準=年',
		'/Siamen|-978~|:CE|疑|精=年|準=年',
		'/Psusennes II|-959~|:CE|疑|精=年|準=年',

		// 22nd Dynasty (Bubastite/Libyan)
		'Dynasty XXII/Sheshonq I|-945~|:CE|疑|精=年|準=年|時期=Third Intermediate',
		'/Osorkon I|-924~-889|:CE|疑|精=年|準=年',
		'/Sheshonq II|-890~|:CE|疑|精=年|準=年',
		'/Takeloth I|-889~|:CE|疑|精=年|準=年',
		'/Osorkon II|-874~|:CE|疑|精=年|準=年',
		'/Takelot III|-850~|:CE|疑|精=年|準=年',
		'/Sheshonq III|-825~|:CE|疑|精=年|準=年',
		'/Pimay|-773~|:CE|疑|精=年|準=年',
		'/Sheshonq V|-767~|:CE|疑|精=年|準=年',
		'/Osorkon IV|-730~-715|:CE|疑|精=年|準=年',

		// 23rd Dynasty (Tanite/Libyan)
		'Dynasty XXIII/Pedubastis I|-818~-793|:CE|疑|精=年|準=年|時期=Third Intermediate',
		'/Sheshonq IV|-780~|:CE|疑|精=年|準=年',
		'/Osorkon III|-777~-749|:CE|疑|精=年|準=年',

		// 24th Dynasty
		'Dynasty XXIV/Bakenrenef|-727~-715|:CE|疑|精=年|準=年|時期=Third Intermediate',

		/**
		 * <code>

		'25th Dynasty (Kushite)/Piye|-747~|:CE|疑|精=年|準=年|時期=Late Period',
		'/Shabaqa|-716~|:CE|疑|精=年|準=年',
		'/Shabitqa|-702~|:CE|疑|精=年|準=年',
		'/Taharqa|-690~|:CE|疑|精=年|準=年',
		'/Tantamen|-664~-656|:CE|疑|精=年|準=年',

		'26th Dynasty (Saite)/Necho I|-672~|:CE|疑|精=年|準=年|時期=Late Period',
		'/Psammetichus I|-664~|:CE|疑|精=年|準=年',
		'/Necho II|-610~|:CE|疑|精=年|準=年',
		'/Psammetichus II|-595~|:CE|疑|精=年|準=年',
		'/Apries|-589~|:CE|疑|精=年|準=年',
		'/Ahmose II|-570~|:CE|疑|精=年|準=年',
		'/Psammetichus III|-526~|:CE|疑|精=年|準=年',

		'27th Dynasty (First Persian Period)/Cambyses|-525~|:CE|疑|精=年|準=年|時期=Late Period',
		'/Darius I|-522~|:CE|疑|精=年|準=年',
		'/Xerxes I|-486~|:CE|疑|精=年|準=年',
		'/Artaxerxes I|-465~|:CE|疑|精=年|準=年',
		'/Darius II|-424~|:CE|疑|精=年|準=年',
		'/Artaxerxes II|-405~-359|:CE|疑|精=年|準=年',

		'28th Dynasty/Amyrtaios|-404~|:CE|疑|精=年|準=年|時期=Late Period',

		'29th Dynasty/Nepherites I|-399~|:CE|疑|精=年|準=年|時期=Late Period',
		'/Hakor|-393~|:CE|疑|精=年|準=年',
		'/Nepherites II|-380~|:CE|疑|精=年|準=年',

		'30th Dynasty/Nectanebo I|-380~|:CE|疑|精=年|準=年|時期=Late Period',
		'/Teos|-362~|:CE|疑|精=年|準=年',
		'/Nectanebo II|-360~|:CE|疑|精=年|準=年',

		'Second Persian Period/Artaxerxes III|-343~|:CE|疑|精=年|準=年|時期=Late Period',
		'/Arses|-338~|:CE|疑|精=年|準=年',
		'/Darius III|-336~|:CE|疑|精=年|準=年',

		'Macedonian Dynasty/Alexander the Great|-332~|:CE|疑|精=年|準=年|時期=Ptolemaic Period',
		'/Philip Arrhidaios|-323~-317|:CE|疑|精=年|準=年',
		'/Alexander IV|-323~-310|:CE|疑|精=年|準=年',

		'Ptolemaic Dynasty/Ptolemy I|-305~-282|:CE|疑|精=年|準=年|時期=Ptolemaic Period|注=共治者:王后 Berenike I;Berenice I of Egypt',
		'/Ptolemy II|-285~-246|:CE|疑|精=年|準=年|注=共治者:王后 Arsinoe I',
		'/Arsinoe II|-275~-268|:CE|疑|精=年|準=年|君主性別=女',
		'/Ptolemy III|-246~-222|:CE|疑|精=年|準=年',
		'/Berenike II|-246~|:CE|疑|精=年|準=年|君主性別=女',
		'/Ptolemy IV|-221~|:CE|疑|精=年|準=年|注=共治者:王后 Arsinoe III',
		'/Ptolemy V|-205~-180|:CE|疑|精=年|準=年',
		'/Kleopatra I|-194~-176|:CE|疑|精=年|準=年|君主性別=女',
		'/Ptolemy VI|-180~-145|:CE|疑|精=年|準=年',
		'/Kleopatra II|-176~-116|:CE|疑|精=年|準=年|君主性別=女',
		'/Ptolemy VII|-145~|:CE|疑|精=年|準=年',
		'/Ptolemy VIII|-145~-116|:CE|疑|精=年|準=年',
		'/Kleopatra III|-142~-101|:CE|疑|精=年|準=年|君主性別=女|注=共治者: Kleopatra IV (-116 to -115: Kleopatra III に追放され)',
		'/Ptolemy IX|-116~|:CE|疑|精=年|準=年',
		'/Ptolemy X|-107~-88|:CE|疑|精=年|準=年',
		'/Berenike III|-101~-80|:CE|疑|精=年|準=年|君主性別=女',
		'/Ptolemy IX|-88~|:CE|疑|精=年|準=年',
		'/Ptolemy XI|-80~|:CE|疑|精=年|準=年',
		'/Ptolemy XII (Auletes)|-80~|:CE|疑|精=年|準=年',
		'/Kleopatra V|-58~-57|:CE|疑|精=年|準=年|君主性別=女|注=可能和 Kleopatra VI 是同一人。',
		'/Berenike IV|-58~|:CE|疑|精=年|準=年|君主性別=女|注=共治者: Kleopatra VI',
		'/Ptolemy XII (Auletes)|-55~|:CE|疑|精=年|準=年',
		'/Kleopatra VII|-51~-30|:CE|疑|精=年|準=年|君主性別=女',
		'/Ptolemy XIII|-51~|:CE|疑|精=年|準=年|注=共治者: 王后 Kleopatra VII|注=與 Arsinoe IV 相爭',
		'/Ptolemy XIV|-47~|:CE|疑|精=年|準=年',
		'/Ptolemy XV (Caesarion)|-44~-30|:CE|疑|精=年|準=年',

		 */

		// ----------------------------------//
		(function() {
			// Egyptian year (has year 0) = -26
			var epochal_year = CeL.Egyptian_Date.reform_epochal_year - 1,
			// assert: start_year < epochal_year < 0
			// -746/2/26
			start_year = -747,
			// assert: end_year > epochal_year
			end_year = 306,
			//
			month_days = CeL.Egyptian_Date.month_days.join(';'),
			//
			circle_month_days = new Array(3).fill(month_days);
			circle_month_days.push(CeL.Egyptian_Date.leap_month_days.join(';'));
			month_days = new Array(epochal_year - start_year + 1)
					.fill(month_days);
			Array.prototype.push.apply(month_days, new Array(Math
					.ceil((end_year - epochal_year) / 4))
					.fill(circle_month_days.join('	')));

			return [ 'Egyptian', [ String(start_year).to_Date('Egyptian'),
			// +1: period_end
			String(end_year + 1).to_Date('Egyptian') ],
			//
			start_year + '/=' + month_days.join('	'), '參照用',
			// Egyptian calendar
			'曆法=Egyptian',
			//
			'月名=' + CeL.Egyptian_Date.month_name.Greek.slice(1).join(';') ];
		})(),

		// https://en.wikipedia.org/wiki/Twenty-fifth_Dynasty_of_Egypt
		// Year 21 of Piye (Piankhi)
		// BC 726 Feb 21 – 725 Feb 20
		//
		// http://www.trismegistos.org/daht/detail.php?tm=46106
		// BC 726 Mar 30 (Piye (Pianchi), year 21, Phaophi 08)
		'Egypt Dynasty XXV/Piye|Egyptian-747~|:Egyptian|疑|準=年|時期=Third Intermediate|ruler=Pianchi',
		// http://www.trismegistos.org/text/46121
		// BC 703 May 10 ((Shabaka), year 13, Hathyr 25)
		'/Shabaka|Egyptian-716~|:Egyptian|疑|準=年',
		'/Shebitku|Egyptian-702~|:Egyptian|疑|準=年',
		// BC 665 Sep 16 ((Taharqa), year 26, Pharmouthi 14)
		'/Taharqa|Egyptian-691~|:Egyptian|疑|準=年',
		'/Tantamani|Egyptian:-665~-656|:Egyptian|疑|準=年',

		// BC 660 Jan 12 ([Psammetichus 1], year 04, Mesore 13)
		'Egypt Dynasty XXVI/Psammetichus I|Egyptian-665~|:Egyptian|疑|準=年|時期=Late Period|ruler=Psamtik I',
		'/Necho II|Egyptian-611~|:Egyptian|疑|準=年',
		'/Psammetichus II|Egyptian-596~|:Egyptian|疑|準=年',
		'/Apries|Egyptian:-590~|:Egyptian|疑|準=年',
		// 若以下兩筆紀錄皆為真，可推測 Apries 死於 20年中，或許是 Payni 10 之後。
		// 而 Amasis II 於年中登基，並稱元年。
		// BC 570 Oct 19 (Apries, year 20, Pauni 10) Type: contract loan (money)
		// BC 569 Feb 12 - Mar 12 (Amasis, year 02, Phaophi)
		'/Amasis II|Egyptian-571/11~|:Egyptian|疑|準=年',
		'/Psamtik III|Egyptian:-527~-526/5|:Egyptian|疑|準=年|注=Psamtik III was defeated by Cambyses II of Persia in the battle of Pelusium in the eastern Nile delta in May 525 BCE.',

		// modified form Achaemenid Empire listed above.
		'First Achaemenid Period/Cambyses II|Egyptian:-530~-523/9|:Egyptian|疑|準=年|朝代=Egypt Dynasty XXVII;First Egyptian Satrapy|時期=Late Period',
		'/Seheruibre Padibastet|Egyptian:-523~-520|:Egyptian|疑|準=年|ruler=Petubastis III|注=There also exists a document that has been dated to 522 BCE, which was the first year of his reign.|注=Certainly Egypt was pacified by 518 BCE when Darius arrived and authorised the codification of local Egyptian laws.',
		// TM 48872: BC 519 Jan 30 - Feb 28? (Darius 1, year 03, Phaophi?)
		'/Darius I|Egyptian-522~|:Egyptian|疑|準=年',
		// TM 46738: BC 486 Jun 7 ((Darius 1), year 36, Mecheir 17)
		// TM 46432: BC 485 Feb 21 - Mar 21 (Psammetichus 4, year 02, Hathyr)
		// TM 46431: BC 485 Mar 22 - Apr 20 (Psammetichus 4, year 02, Choiak)
		// TM 46428: BC 485 Apr 21 - May 20 (Psammetichus 4, year 02, Tybi)
		'/Psammetichus IV|Egyptian-487/7~|:Egyptian|疑|準=年|注=proposed ancient Egyptian ruler',
		'/Xerxes I|Egyptian-486/6~|:Egyptian|疑|準=年',
		// TM 81436: BC 443 Nov 7 - Dec 6 (Artaxerxes 1, year 22, Mesore)
		'/Artaxerxes I|Egyptian-465~|:Egyptian|疑|準=年',
		// TM 81485: BC 422 Jun 5 - Jul 4 (Darius 2, year 02, Phamenoth)
		'/Darius II|Egyptian-424/2~|:Egyptian|疑|準=年',
		'/Artaxerxes II|Egyptian:-405/6~-402|:Egyptian|疑|準=年',

		'Egypt Dynasty XXVIII/Amyrtaeus|Egyptian-405/2~|:Egyptian|疑|準=年|時期=Late Period|ruler=Amenirdisu',

		'Egypt Dynasty XXIV/Nepherites I|Egyptian-400/12~|:Egyptian|疑|準=年|時期=Late Period',
		// TM 81525: BC 393 Mar 29 - Apr 27? (Nepherites 1, year 07, Tybi?)
		// TM 54648: BC 394 Nov 30 - 393 Nov 28 (Hakoris, year 01)
		'/Hakor/first reign|Egyptian-394/6~|:Egyptian|疑|準=年|ruler=Hagar;Achoris;Hakoris;Akoris',
		// TM 51551: BC 388 Jun 26 - Jul 25 (Psammuthis, year 01, Pharmouthi)
		'/Psammuthes/|Egyptian-389~|:Egyptian|疑|準=年|ruler=Psammuthis',
		'/Hakor/second reign|Egyptian-388~|:Egyptian|疑|準=年',
		'/Nepherities II/|Egyptian-382/9~|:Egyptian|疑|準=年|ruler=Nefaarud II|注=He was deposed and likely killed by Nectanebo I after ruling Egypt for only 4 months.',

		// TM 46406: BC 380 Jun 23? (Nectanebo 1, year 01, Phamenoth 30)
		'Egypt Dynasty XXX/Nectanebo I|Egyptian-381~|:Egyptian|疑|準=年|ruler=Kheperkare Nakhtnebef|時期=Late Period',
		'/Teos|Egyptian-365~|:Egyptian|疑|準=年|ruler=Τέως;Tachos;Τάχως;Djedhor;Irmaatenre',
		'/Nectanebo II|Egyptian-361~-344|:Egyptian|疑|準=年|ruler=Senedjemibra Setepeninhur;Nakhthorheb;Nektanebo II',

		'Second Achaemenid Period/Artaxerxes III|Egyptian-359/12~|:Egyptian|疑|準=年|朝代=Egypt Dynasty XXXI|時期=Late Period',
		'/Khabash|Egyptian-338~-335|:Egyptian|疑|準=年|ruler=Khababash;Khabbash;Chababash',
		'/Darius III|Egyptian-337~|:Egyptian|疑|準=年',

		// 時期=Ptolemaic (Hellenistic)
		'Argead Dynasty/Alexander III|Egyptian-332~|:Egyptian|疑|準=年|時期=Ptolemaic|朝代=Egypt Dynasty XXXII',
		'/Philip III|-323/6/11~|:Egyptian|疑|準=年|ruler=Philippus Arrhidaeus',
		'/Alexander IV|-317/12/25~|:Egyptian|疑|準=年',

		'Ptolemaic Dynasty/Ptolemy I|Egyptian-305~|:Egyptian|疑|準=年|ruler=Ptolemy I Soter|時期=Ptolemaic|注=共治者:王后 Berenike I;Berenice I of Egypt',
		/**
		 * Ever since Pestman, Chronologie, p. 18, it has been assumed that
		 * originally Ptolemy II Philadelphos counted his Egyptian regnal years
		 * from the death of his father (283 / 282 BC), but switched to another
		 * system, taking into account his coregency (starting in 285 / 284 BC),
		 * in the middle of his reign. Supposedly he skipped years 17 and 18,
		 * which were at that time unattested in Demotic or Greek sources.
		 * Recently Muhs has argued that this change of counting basis is in
		 * fact imaginary and that the two regnal years are indeed attested.
		 * Although the last word has not yet been said about this chronological
		 * problem, I have followed Muhs's reconstruction.
		 */
		// TM 43764: BC 284 Aug 29 - Sep 27 (P01, year 21, Epeiph)
		'/Ptolemy II|Egyptian-285/12~|:Egyptian|疑|準=年|ruler=Ptolemy II Philadelphos|注=共治者:王后 Arsinoe I',
		// TM 49771: BC 247 Dec 28 ((P02), year 39, Hathyr 06 ; cf. DBL)
		// TM 53665: BC 246 Feb 21? ((P02?), year 39, Tybi 01)
		// TM 8527: BC 246 Mar 14 (P03, year 01, Tybi 22)
		'/Ptolemy III|Egyptian-247/5/15~|:Egyptian|疑|準=年|ruler=Ptolemy III Euergetes I',
		'/Ptolemy IV|Egyptian-222/5~|:Egyptian|疑|準=年|ruler=Ptolemy IV Philopator|注=共治者:王后 Arsinoe III',
		'/Hugronaphor|Egyptian:-205/1/15~-192|:Egyptian|疑|準=年|ruler=Haronnophris;Chaonnophris',
		'/Ptolemy V|Egyptian-205/1/15~|:Egyptian|疑|準=年|ruler=Ptolemy V Epiphanes',
		'/Ptolemy VI|Egyptian:-181~-146/11/14|:Egyptian|疑|準=年|ruler=Ptolemy VI Philometor',
		'/Ptolemy VIII|Egyptian:-170~-164|:Egyptian|疑|準=年|ruler=Ptolemy VIII Euergetes II',
		'/Ptolemy VIII|Egyptian:-146/11/15~-117/11|25/=:Egyptian|疑|準=年',
		'/Kleopatra II|Egyptian:-132/12~-131|:Egyptian|疑|準=年|注=or Harsiesis?|君主性別=女',
		'/Kleopatra III|Egyptian:-117/12~-101|:Egyptian|疑|準=年|君主性別=女|注=共治者: Kleopatra IV (-116 to -115: Kleopatra III に追放され)',
		'/Ptolemy IX|Egyptian:-117/12~-107|:Egyptian|疑|準=年|ruler=Ptolemy IX Soter II',
		'/Ptolemy IX|Egyptian:-89~-82|29/=:Egyptian|疑|準=年|ruler=Ptolemy IX Soter II',
		'/Ptolemy X|Egyptian:-114~-88|:Egyptian|疑|準=年|ruler=Ptolemy X Alexander I',
		'/Kleopatra Berenike III|Egyptian:-82~-81|:Egyptian|疑|準=年|君主性別=女',
		'/Ptolemy XII|Egyptian:-81~-52|:Egyptian|疑|準=年|ruler=Ptolemy XII Neos Dionysos',
		'/Berenike IV|Egyptian:-59~-56|:Egyptian|疑|準=年|君主性別=女|注=共治者: Kleopatra VI',
		'/Kleopatra VII|Egyptian-52~|:Egyptian|疑|準=年|ruler=Kleopatra VII Philopator|君主性別=女',

		// https://en.wikipedia.org/wiki/List_of_Roman_emperors
		'Roman Empire/Augustus|Egyptian-30~|:Egyptian|疑|準=年',
		'/Tiberius|Egyptian:14~37|:Egyptian|疑|準=年',
		'/Caligula|Egyptian36/8~|:Egyptian|疑|準=年',
		'/Claudius|Egyptian40/6~|:Egyptian|疑|準=年',
		'/Nero|Egyptian54/3~|:Egyptian|疑|準=年',
		'/Galba|Egyptian67/11~|:Egyptian|疑|準=年',
		'/Vespasianus|Egyptian68/6~|:Egyptian|疑|準=年',
		'/Titus|Egyptian79/11~|:Egyptian|疑|準=年',
		'/Domitian|Egyptian81/11~|:Egyptian|疑|準=年',
		'/Traianus|Egyptian97~|:Egyptian|疑|準=年',
		'/Hadrianus|Egyptian116/12~|:Egyptian|疑|準=年',
		'/Antoninus Pius|Egyptian137/11~|:Egyptian|疑|準=年',
		// Year 21 of Marcus Aurelius (= Commodus) AD 180 Aug 29 – 181 Aug 28
		'/Marcus Aurelius|Egyptian160~|:Egyptian|疑|準=年',
		// Year 19 of Septimius Severus (= Caracalla) AD 210 Aug 29 – 211 Aug 28
		'/Septimius Severus|Egyptian192/9~|:Egyptian|疑|準=年',
		'/Macrinus|Egyptian216/9~|:Egyptian|疑|準=年',
		'/Elegabalus|Egyptian217/11~|:Egyptian|疑|準=年',
		'/Severus Alexander|Egyptian221/8~|:Egyptian|疑|準=年',
		'/Gordianus|Egyptian:237~240|:Egyptian|疑|準=年',
		'/Maximinus Thrax|Egyptian240~|:Egyptian|疑|準=年',
		'/Philippus Arabs|Egyptian243~|:Egyptian|疑|準=年',
		'/Gallus|Egyptian250~|:Egyptian|疑|準=年',
		'/Valerianus|Egyptian:253~259|:Egyptian|疑|準=年',
		'/Gallienus|Egyptian:253~268|:Egyptian|疑|準=年',
		// Macrinus and Quietus, as emperors
		'/Macrianus Minor|Egyptian:260~261|:Egyptian|疑|準=年',
		'/Quietus|Egyptian:260~261|:Egyptian|疑|準=年',
		'/Aurelianus|Egyptian269~|:Egyptian|疑|準=年',

		/**
		 * The Era of the Martyrs (Latin: anno martyrum or AM), also known as
		 * the Diocletian era (Latin: anno Diocletiani)
		 * 
		 * @see https://en.wikipedia.org/wiki/Era_of_Martyrs
		 */

		'/Diocletianus|Egyptian:284~|:Egyptian|疑|準=年',

		// 305~452 ディオクレティアヌス紀元または殉教紀元（じゅんきょうきげん）
		'Diocletian era|Egyptian:305~306|23/=:Egyptian|疑|準=年|注=殉道時期 (The Era of the Martyrs, 殉教紀元) 沿用古埃及曆，並於亞歷山大科普特正教會行用至今；請參照之。'

]).minute_offset = 2 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"hittite"}
(CeL.era.pass_on.countries["Hittite"] = [

		// Trevor Bryce. (2002).
		// Life and society in the Hittite world. OUP Oxford.
		// page. xi : List of Hittite Kings

		// 西臺君主列表 https://en.wikipedia.org/wiki/List_of_Hittite_kings
		// https://web.archive.org/web/20130729215948/http://www.hittites.info/history.aspx?text=history%2FMiddle+Empire.htm

		// 舊王國 (西臺)（Old Hittite Kingdom）哈圖沙成為首都。
		'Old Kingdom/Hattusili I|-1650~|:CE|疑|精=年|準=年',
		'/Mursili I|-1620~|:CE|疑|精=年|準=年|關係=grandson, adopted son',
		'/Hantili I|-1590~|:CE|疑|精=年|準=年|關係=brother-in-law|ruler=Ḫattušili I',
		'/Zidanta I|-1560~|:CE|疑|精=年|準=年|關係=son-in-law',
		'/Ammuna|-1550~|:CE|疑|精=年|準=年|關係=son',
		'/Huzziya I|-1530~|:CE|疑|精=年|準=年|關係=brother of Ammuna’s daughter in-law',
		'/Telipinu|-1525~-1500/1/1|:CE|疑|精=年|準=年|關係=brother-in-law',

		// 中王國 (西臺)（Middle Hittite Kingdom）
		// 關於中王國，沒有任何資料保存下來。但有的研究者將古王國的最後6位君主列為中王國時期的統治者。
		// 有些研究者認為並無以下6人。
		// 'Middle Kingdom/Alluwamna|-1500~|:CE|疑|精=年|準=年|關係=son-in-law',
		// '/Tahurwaili|-~|:CE|疑|精=年|準=年|關係=interloper',
		// '/Hantili II|-~|:CE|疑|精=年|準=年|關係=son of Alluwamna?',
		// '/Zidanta II|-1480~|:CE|疑|精=年|準=年|關係=son?',
		// '/Huzziya II|-~-1450|:CE|疑|精=年|準=年|關係=son?',
		// '/Muwatalli I|-~|:CE|疑|精=年|準=年|關係=interloper',

		// 新王國 (西臺)（New Hittite Kingdom）
		// 蘇皮盧利烏瑪斯一世征服敘利亞、穆瓦塔利（Muwatalli）進攻埃及卡疊石（Kadesh）。
		// https://en.wikipedia.org/wiki/Short_chronology
		'New Kingdom/Tudḫaliya II|-1400~|:CE|疑|精=年|準=年|關係=grandson of Huzziya II?|注=Includes period of coregency',
		'/Arnuwanda I|-1380~|:CE|疑|精=年|準=年|關係=son-in-law, adopted son',
		'/Hattusili II|-1370~|:CE|疑|精=年|準=年|關係=son?|注=Hattusili II?',
		'/Tudhaliya III|-1360~|:CE|疑|精=年|準=年|關係=son?',
		'/Suppiluliuma I|-1344~|:CE|疑|精=年|準=年|關係=son',
		'/Arnuwanda II|-1322~|:CE|疑|精=年|準=年|關係=son',
		'/Mursili II|-1321~|:CE|疑|精=年|準=年|關係=brother',
		'/Muwatalli II|-1295~|:CE|疑|精=年|準=年|關係=son',
		'/Urhi-Tesub|-1272~|:CE|疑|精=年|準=年|關係=son|ruler=Mursili III',
		'/Hattusili III|-1267~|:CE|疑|精=年|準=年|關係=uncle',
		'/Tudhaliya IV|-1237~|:CE|疑|精=年|準=年|關係=son',
		'/Kurunta|-1228~|:CE|疑|精=年|準=年|關係=cousin',
		'/Tudhaliya IV|-1227~|:CE|疑|精=年|準=年|關係=cousin|注=2nd period as king 復位',
		'/Arnuwanda III|-1209~|:CE|疑|精=年|準=年|關係=son',
		'/Suppiluliuma II|-1207~-1178|:CE|疑|精=年|準=年|關係=brother',

]).minute_offset = 2 * 60;

// ---------------------------------------------------------------------//

// 法國皇室 法國君主列表
// https://fr.wikipedia.org/wiki/Liste_des_monarques_de_France
// https://www.timetoast.com/timelines/les-monarques-de-france
// https://fr.wikipedia.org/wiki/Liste_des_reines_et_imp%C3%A9ratrices_de_France

// https://en.wikipedia.org/wiki/Unicode_subscripts_and_superscripts
// https://github.com/gtoubiana/acte
// gettext_config:{"id":"france"}
(CeL.era.pass_on.countries["France"] = [

		// Clovis Iᵉʳ ˢᵗ
		'Mérovingiens/Clovis Ier|481~|:CE|ruler=Clovis Iᵉʳ|朝代=Dynastie Mérovingienne;Merovingian dynasty|曆法=France',
		// TODO: 資料還存有錯誤
		'/Clodomir|511/11/27~524/6/25|:CE',
		'/Thierry Ier|511/11/27~|:CE|準=年|ruler=Theuderic I',
		'/Thibert Ier|534~|:CE|準=年',
		'/Thibaut|548~555|:CE|準=年',
		'/Childebert Ier|511~558/12/12|:CE|準=年',
		'/Clotaire Ier|511~|:CE|準=年',
		'/Caribert Ier|561/11/29~567/3/5|:CE',
		'/Sigebert Ier|561~575/12|:CE',
		'/Chilpéric Ier|561~584/9|:CE|準=年',
		'/Gontran|561~592/3/28|:CE|準=年',
		'/Childebert II|575~596/3|:CE|準=年',
		'/Thibert II|595~612|:CE|準=年',
		'/Thierry II|595~|:CE|準=年',
		'/Sigebert II|613~613/10/10|:CE|準=年',
		'/Clotaire II|584~629/10/18|:CE|準=年',
		'/Dagobert Ier|623~639/1/19|:CE|準=年',
		'/Caribert II|629~632/4/8|:CE|準=年',
		'/Sigebert III|639~656/2/1|:CE|準=年',
		'/Clovis II|639~657/10/31|:CE|準=年|ruler=Clovis II « le Fainéant »',
		'/Childebert|656~662/10/18|:CE|準=年|ruler=Childebert « l\'Adopté »',
		'/Clotaire III|657~673|:CE|準=年',
		'/Childéric II|662~|:CE|準=年',
		'/Thierry III|675~691|:CE|準=年',
		'/Clovis III|675~|:CE|準=年',
		'/Dagobert II|676~679/12/23|:CE|準=年',
		'/Clovis IV|691~|:CE|準=年',
		'/Childebert IV|695~|:CE|準=年|ruler=Childebert III',
		'/Dagobert III|711~|:CE|準=年',
		'/Chilpéric II|715~721|:CE|準=年',
		'/Clotaire IV|717~719|:CE|準=年',
		'/Thierry IV|721~737|:CE|準=年',

		'/Interrègne de Childéric III|743~|:CE|準=年',

		'Carolingiens/Pépin le Bref|751/11~|:CE|朝代=Dynastie Carolingienne|ruler=Pépin « le Bref »;Pépin III, dit le Bref',
		'/Carloman Ier|768/9/24~771/12/4|:CE',
		'/Charlemagne|768/9/24~|:CE|ruler=Charles Ier;Charles Ier « le Grand »',
		'/Louis Ier|814/1/28~|:CE|ruler=Louis Ier « le Pieux »;Louis Ier « le Débonnaire »',
		'/Charles II|840/6/20~|:CE|ruler=Charles II « le Chauve »',
		'/Louis II|877/10/6~|:CE|ruler=Louis II « le Bègue »',
		'/Louis III|879/4/11~882/8/5|:CE',
		'/Carloman II|879/4/11~884/12/6|:CE',
		'/Charles|885/6~887/11|:CE|ruler=Charles « le Gros »',
		'/Eudes|888/2/29~|:CE',
		'/Charles III|898/1/1~|:CE|ruler=Charles III « le Simple »',
		'/Robert Ier|922/6/29~|:CE',
		'/Raoul|923/6/15~936/1/15|:CE|ruler=Raoul de Bourgogne',
		'/Louis IV|936/9/19~|:CE',
		'/Lothaire|954/9/10~|:CE|ruler=Lothaire (roi des Francs)',
		'/Louis V|986/3/2~987/5/21|:CE|ruler=Louis V « le Fainéant »',

		'Capétiens directs/Hugues Capet|987/6/3~|:CE',
		'/Robert II|996/10/24~|:CE|ruler=Robert II « le Pieux »',
		'/Henri Ier|1031/7/10~|:CE',
		'/Philippe Ier|1060/8/4~|:CE',
		'/Louis VI|1108/7/29~|:CE|ruler=Louis VI « le Gros »',
		'/Louis VII|1137/8/1~|:CE|ruler=Louis VII « le Jeune »',
		'/Philippe II|1180/9/18~|:CE|ruler=Philippe II « Auguste »',
		'/Louis VIII|1223/7/14~|:CE|ruler=Louis VIII « le Lion »',
		'/Louis IX|1226/11/8~|:CE|ruler=Louis IX « Saint Louis »',
		'/Philippe III|1270/8/25~|:CE|ruler=Philippe III « le Hardi »',
		'/Philippe IV|1285/10/5~|:CE|ruler=Philippe IV « le Bel »',
		'/Louis X|1314/11/29~|:CE|ruler=Louis X « le Hutin »',
		'/Jean Ier|1316/11/15~|:CE|ruler=Jean Ier « le Posthume »',
		'/Philippe V|1316/11/19~|:CE|ruler=Philippe V « le Long »',
		'/Charles IV|1322/1/3~1328/2/1|:CE|ruler=Charles IV « le Bel »',

		'Valois/Philippe VI|1328/4/1~|:CE|朝代=Maison capétienne de Valois',
		'/Jean II|1350/8/22~|:CE|ruler=Jean II « le Bon »',
		'/Charles V|1364/4/8~|:CE|ruler=Charles V « le Sage »',
		'/Charles VI|1380/9/16~|:CE|ruler=Charles VI « le Bien-Aimé »;Charles VI « le Fol »',
		'/Charles VII|1422/10/22~|:CE|ruler=Charles VII « le Victorieux »;Charles VII « le Bien Servi »',
		'/Louis XI|1461/7/22~|:CE|ruler=Louis XI « le Prudent »',
		'/Charles VIII|1483/8/30~|:CE|ruler=Charles VIII « l\'Affable »',
		'/Louis XII|1498/4/7~|:CE|ruler=Louis XII « le Père du Peuple »',
		'/François Ier|1515/1/1~|:CE|ruler=François d\'Orléans;François Ier « le Père et Restaurateur des Lettres »',
		'/Henri II|1547/3/31~|:CE',
		'/François II|1559/7/10~|:CE',
		'/Charles IX|1560/12/5~|:CE',
		'/Henri III|1574/3/30~|:CE',

		'Bourbon/Henri IV|1589/8/2~|:CE|ruler=Henri IV « le Grand »;Henri IV « le Vert-Galant »|朝代=Maison capétienne de Bourbon;Dynastie des Bourbons',
		'/Louis XIII|1610/5/14~|:CE|ruler=Louis XIII « le Juste »',
		'/Louis XIV|1643/5/14~|:CE|ruler=Louis XIV « le Grand »;Louis XIV « le Roi-Soleil »',
		'/Louis XV|1715/9/1~|:CE|ruler=Louis XV « le Bien-Aimé »',
		'/Louis XVI|1774/5/10~1792/8/10|:CE',

		// Ere Bonaparte
		'Bonaparte/Napoléon Ier|1804/5/18~|:CE',
		// Ere des Bourbons
		'Bourbons/Louis XVIII|1814/4/6~|:CE|ruler=Louis XVIII « le Désiré »',
		'Bonaparte/Napoléon Ier|1815/3/20~1815/6/22|12/=:CE',
		'Bourbons/Louis XVIII|1815/7/8~|:CE|ruler=Louis XVIII « le Désiré »',
		'/Charles X|1824/9/16~1830/8/2|:CE',
		// Ere Orléans
		'Orléans/Louis-Philippe Ier|1830/8/9~1848/2/24|:CE|朝代=Quatrième maison d\'Orléans|ruler=Louis-Philippe Ier « le Roi-Citoyen »',
		'Bonaparte/Napoléon III|1852/12/2~1870/9/4/|:CE'

]).minute_offset = 1 * 60;

// ---------------------------------------------------------------------//
// 英國君主列表

// gettext_config:{"id":"british"}
(CeL.era.pass_on.countries["British"] = [
		// https://en.wikipedia.org/wiki/List_of_monarchs_of_Wessex
		// The Kingdom of the Gewissae
		'Cerdicing dynasty/Cerdic|519~|:CE|時期=Wessex|精=年|準=年|注=Possibly Celtic, Brythonic, name.|曆法=Great Britain',
		'/Cynric|534~|:CE|精=年|準=年|注=Son, or according to some sources grandson, of Cerdic.',
		'/Ceawlin|560~|:CE|精=年|準=年|注=Son of Cynric. Possibly Celtic, Brythonic, name.',
		'/Ceol|591~|:CE|精=年|準=年|注=Nephew of Ceawlin, grandson of Cynric.',
		'/Ceolwulf|597~|:CE|精=年|準=年|注=Brother of Ceol, grandson of Cynric.',
		'/Cynegils|611~|:CE|精=年|準=年|注=Sources derive him from Cynric, but name different dynasty members as his father. Possibly Celtic, Brythonic, name',
		'/Cenwalh|642~|:CE|精=年|準=年|注=Son of Cynegils. Possibly Celtic, Brythonic, name; Deposed',
		'Mercian dynasty/Penda|645~|:CE|時期=Wessex|精=年|準=年|注=King of Mercia, expelled Cenwalh.',
		'Cerdicing dynasty/Cenwalh|648~674|:CE|時期=Wessex|精=年|準=年|注=Restored; reigned jointly with his wife Queen Seaxburh 672 to 674.',
		'/Seaxburh|672~|:CE|精=年|準=年|注=Reigned jointly with her husband Cenwalh until his death 674',
		'/Æscwine|674~|:CE|精=年|準=年|注=Son of Cenfus.',
		'/Centwine|676~|:CE|精=年|準=年|注=Traditionally son of Cynegils, but this is disputed. Deposed by Cædwalla',
		'/Cædwalla|685~|:CE|精=年|準=年|注=Perhaps descendant of Ceawlin. Usurper; abdicated, possibly of British origin.',
		'/Ine|688~|:CE|精=年|準=年|注=Descendant of Ceawlin. Abdicated',
		'/Æthelheard|726~|:CE|精=年|準=年|注=Perhaps brother-in-law of Ine.',
		'/Cuthred|740~|:CE|精=年|準=年|注=Relative, possibly brother, of Æthelheard.',
		'/Sigeberht|756~|:CE|精=年|準=年|注=Distant relative of Cuthred. Deposed (and killed?) by Cynewulf',
		'/Cynewulf|757~|:CE|精=年|準=年|注=Assassinated by Cyneheard, brother of Sigeberht',
		'/Beorhtric|786~|:CE|精=年|準=年',
		"/Ecgberht|802~|:CE|精=年|準=年|注=Descendant of Ine's brother.",
		'/Æthelwulf|839~|:CE|精=年|準=年|注=Son of Ecgberht.',
		'/Æthelbald|858~|:CE|精=年|準=年|注=Son of Æthelwulf.',
		'/Æthelberht|860~|:CE|精=年|準=年|注=Son of Æthelwulf.',
		'/Æthelred|865~|:CE|精=年|準=年|注=Son of Æthelwulf.',
		'/Alfred the Great|871/4/23~|:CE|注=Son of Æthelwulf. The only Anglo-Saxon monarch to be given the epithet "the Great".',
		'/Edward the Elder|899/10/26~|:CE|注=Son of Alfred. Died 17 July 924',
		'/Ælfweard|924/7/17~924/8/2|:CE|疑|精=年|準=年|注=Second son of Edward the Elder. Died 2 August 924, only 16 days after his father. Only referred to as king in late sources.',
		'/Æthelstan|925~927|:CE|精=年|準=年|注=First son of Edward the Elder. Became King of the English in 927 when the Northumbrians accepted his lordship.',
		//
		'/Cwichelm|626~636|:CE|疑|精=年|準=年|注=Co-ruler with Cynegils, perhaps his son of this name.',
		'/Cenfus|674~674|:CE|疑|精=年|準=年|注=(Disputed) Perhaps reigned between Seaxburh and his son Æscwine. Given a remote descent from Cynric.',

		// TODO
		// https://en.wikipedia.org/wiki/List_of_English_monarchs
		// https://en.wikipedia.org/wiki/List_of_Scottish_monarchs
		// https://en.wikipedia.org/wiki/Monarchy_of_Ireland
		// https://zh.wikipedia.org/wiki/%E5%A5%B3%E6%80%A7%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8

		// https://en.wikipedia.org/wiki/List_of_British_monarchs
		'House of Stuart/Anne|1707/5/1~|:CE|君主性別=女|配偶=1683/7/28 George of Denmark|時期=British',
		'House of Hanover/George I|1714/8/1~|:CE|配偶=1682/11/21 Sophia Dorothea of Celle|時期=British',
		'/George II|1727/6/11~|:CE|配偶=1705/8/22 Caroline of Ansbach',
		'/George III|1760/10/25~|:CE|配偶=1761/9/8 Charlotte of Mecklenburg-Strelitz',
		'/George IV|1820/1/29~|:CE|配偶=1785/9/15 Maria Fitzherbert;1795/4/8 Caroline of Brunswick',
		'/William IV|1830/6/26~|:CE|配偶=1818/7/13 Adelaide of Saxe-Meiningen',
		'/Victoria|1837/6/20~|:CE|配偶=1840/2/10 Albert, Prince Consort|君主性別=女',
		'Houses of Saxe-Coburg and Gotha/Edward VII|1901/1/22~|:CE|配偶=1863/3/10 Alexandra of Denmark|時期=British',
		'House of Windsor/George V|1910/5/6~|:CE|配偶=1893/7/6 Mary of Teck|注=House of Windsor since 1917|時期=British',
		'/Edward VIII|1936/1/20~|:CE|配偶=1937/6/3 Wallis Simpson',
		'/George VI|1936/12/11~|:CE|配偶=1923/4/26 Queen Elizabeth The Queen Mother',
		'/Elizabeth II|1952/2/6~|:CE|生=1926/4/21|卒=2022/9/8 15:10 UTC+1|君主性別=女|配偶=1947/11/20 Prince Philip, Duke of Edinburgh',
		'/Charles III|2022/9/8~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|生=1948/11/14|配偶=1981/7/29–1996 Diana Spencer; 2005/4/9 Camilla Parker Bowles'

]).minute_offset = 0 * 60;

// ---------------------------------------------------------------------//
// 西班牙君主列表

// gettext_config:{"id":"españa"}
(CeL.era.pass_on.countries["España"] = [
		// TODO:
		// https://es.wikipedia.org/wiki/Anexo:Monarcas_de_Arag%C3%B3n
		// https://en.wikipedia.org/wiki/List_of_Aragonese_monarchs
		// https://es.wikipedia.org/wiki/Anexo:Monarcas_de_Castilla
		// https://es.wikipedia.org/wiki/Anexo:Monarcas_de_Le%C3%B3n
		// https://es.wikipedia.org/wiki/Anexo:Monarcas_de_Asturias

		// https://es.wikipedia.org/wiki/Anexo:Reyes_de_Espa%C3%B1a
		// Sobrenombre 綽號
		'Casa de Trastámara/Isabel I de Castilla|1474/12/13~1504/11/25|:CE|Sobrenombre=la Católica|時期=España|君主性別=女',
		'/Fernando II de Aragón|1475/1/15~|:CE|Sobrenombre=el Católico|配偶=Isabel I de Castilla',
		'/Juana I de Castilla|1504/11/26~1555/4/12|:CE|Sobrenombre=la Loca|配偶=Felipe I de Castilla|君主性別=女',
		'/Felipe I de Castilla|1506/7/12~1506/9/25|:CE|Sobrenombre=el Hermoso',
		'Casa de Austria/Carlos I|1516/3/14~|:CE|Sobrenombre=el César|配偶=Isabel de Portugal|時期=España',
		'/Felipe II|1556/1/16~|:CE|Sobrenombre=el Prudente|配偶=María I de Inglaterra;Isabel de Valois (1546-1568);Ana de Austria (1549-1580)',
		'/Felipe III|1598/9/13~|:CE|Sobrenombre=el Piadoso|配偶=Margarita de Austria-Estiria;Margarita de Austria',
		'/Felipe IV|1621/3/31~|:CE|Sobrenombre=el Grande;el Rey Planeta|配偶=Isabel de Borbón (reina de España);Isabel de Borbón;Mariana de Austria',
		'/Carlos II|1665/9/17~1700/11/1|:CE|Sobrenombre=el Hechizado|配偶=María Luisa de Orleans;Mariana de Neoburgo',
		'/Archiduque Carlos|1703/9/12~1715/7/2|:CE|配偶=Isabel Cristina de Brunswick-Wolfenbüttel',
		// 卡佩王朝波旁分支
		'Casa de Borbón/Felipe V|1700/11/16~|:CE|Sobrenombre=el Animoso|配偶=María Luisa Gabriela de Saboya;Isabel de Farnesio|時期=España',
		'/Luis I|1724/1/15~1724/8/31|:CE|Sobrenombre=el Bien Amado;el Liberal|配偶=Luisa Isabel de Orleans',
		'/Felipe V|1724/9/6~|:CE|Sobrenombre=el Animoso|配偶=Isabel de Farnesio',
		'/Fernando VI|1746/7/9~|:CE|Sobrenombre=el Prudente;el Justo|配偶=Bárbara de Braganza',
		'/Carlos III|1759/8/10~|:CE|Sobrenombre=el Político;el Mejor Alcalde de Madrid|配偶=María Amalia de Sajonia',
		'/Carlos IV|1788/12/14~|:CE|Sobrenombre=el Cazador|配偶=María Luisa de Parma',
		'/Fernando VII|1808/3/19~1808/5/6|:CE|Sobrenombre=el Deseado;el Rey Felón',
		'Casa de Bonaparte/José I|1808/6/6~1813/12/11|:CE|Sobrenombre=Pepe Botella;Pepe Plazuelas|配偶=Julia Clary|時期=España',
		// primera restauración
		'Casa de Borbón/Fernando VII|1808/3/19~1808/5/6|:CE|Sobrenombre=el Deseado;el Rey Felón|配偶=María Isabel de Braganza;María Josefa de Sajonia;María Cristina de Borbón|時期=España',
		'/Fernando VII|1814/5/4~|:CE|Sobrenombre=el Deseado;el Rey Felón|配偶=María Isabel de Braganza;María Josefa de Sajonia;María Cristina de Borbón',
		'/Isabel II|1833/9/29~1868/9/30|:CE|Sobrenombre=la de los Tristes Destinos;la Reina Castiza|配偶=Francisco de Asís de Borbón|君主性別=女',
		'Casa de Saboya/Amadeo I|1870/11/16~1873/2/11|:CE|Sobrenombre=el Rey Caballero;el Electo|配偶=María Victoria dal Pozzo|時期=España',
		// segunda restauración
		'Casa de Borbón/Alfonso XII|1874/12/29~1885/11/25|:CE|Sobrenombre=el Pacificador|配偶=María de las Mercedes de Orleans;María Cristina de Habsburgo-Lorena|時期=España',
		'/Alfonso XIII|1886/5/17~1931/4/13|:CE|Sobrenombre=el Africano|配偶=Victoria Eugenia de Battenberg',
		// tercera restauración
		'Casa de Borbón/Juan Carlos I|1975/11/22~|:CE|配偶=Sofía de Grecia|時期=España',
		'/Felipe VI|2014/6/19~' + CeL.era.pass_on.last_day
				+ '|:CE|配偶=Letizia Ortiz'

// 西班牙橫跨UTC-1和UTC兩個時區，但是使用UTC+1為標準時間。
]).minute_offset = 1 * 60;

// ---------------------------------------------------------------------//
// 瑪雅文明, pre-Columbian Maya civilization
// https://en.wikipedia.org/wiki/Category:Maya_rulers

// gettext_config:{"id":"maya"}
(CeL.era.pass_on.countries["Maya"] = [
		// http://www.mesoweb.com/palenque/resources/rulers/rulers_table.html
		// http://research.famsi.org/whos_who/pm_index.php
		// http://www.criscenzo.com/jaguarsun/dynasty.html
		// https://en.wikipedia.org/wiki/Palenque

		// Birth - Accession - Period-ending - Death
		// gettext_config:{"id":"palenque","mark_type":"part_of_string"}
		"Palenque/K'uk' B'ahlam I|Maya:8.19.15.3.4 1 K'an 2 K'ayab'~|:CE|君主名=Bahlum-K'uk';Quetzal;Kuk|生=Maya:8.18.0.13.6 5 Kimi 14 K'ayab'",
		'/"Casper"|Maya:8.19.19.11.17 2 Kab\'an 10 Xul~|:CE|君主名=11 Rabbit;Manatee|生=Maya:8.19.6.8.8 11 Lamat 6 Xul',
		"/B'utz'aj Sak Chiik|Maya:9.2.12.6.18 3 Etz'nab' 11 Xul~|:CE|君主名=Butz'ah Sak Chik;Manik;Sak-Chik|生=Maya:9.1.4.5.0 12 Ahaw 13 Sak",
		"/Ahkal Mo' Nahb' I|Maya:9.3.6.7.17 5 Kab'an 0 Sotz'~|:CE|君主名=Akul Anab;Chaacal;Cauac-Uinal;Chaac|生=Maya:9.1.10.0.0 5 Ahaw 3 Sek|卒=Maya:9.4.10.4.17 5 Kab'an 5 Mak",
		"/K'an Joy Chitam I|Maya:9.4.14.10.4 5 K'an 12 K'ayab'~|:CE|君主名=K'an Hoy Chitam;K'an Hok' Chitam;Kan-Xul;Hok|生=Maya:9.2.15.3.8 12 Lamat 6 Wo|卒=Maya:9.6.11.0.16 7 Kib' 4 K'ayab'",
		"/Ahkal Mo' Nahb' II|Maya:9.6.11.5.1 1 Imix 4 Sip~|:CE|君主名=Akul Anab;Chaacal;Chaac;Cauac-Uinal|生=Maya:9.4.9.0.4 7 K'an 17 Mol|卒=Maya:9.6.16.10.7 9 Manik' 5 Yaxk'in",
		"/Kan B'ahlam I|Maya:9.6.18.5.12 10 Eb' 0 Wo~|:CE|君主名=Chan-Bahlum;Bahlum|生=Maya:9.4.10.1.5 11 Chikchan 13 Ch'en|卒=Maya:9.7.9.5.5 11 Chikchan 3 K'ayab'",
		"/Lady Yohl Ik'nal|Maya:9.7.10.3.8 9 Lamat 1 Muwan~|:CE|君主名=Ix Yohl Ik'nal;Lady Olnal;Lady Kan-Ik;Lady Ik;Lady K'anal-Ik'al|卒=Maya:9.8.11.6.12 2 Eb' 0 Mak",
		"/Aj Ne' Yohl Mat|Maya:9.8.11.9.10 8 Ok 18 Muwan~|:CE|君主名=Ajen Yohl Mat;Ah Neh Yohl Mat;Ah Ne Ohl Mat;Ah Lawal Mat;Aahc-Kan;Ah K'an;Ac-Kan|卒=Maya:9.8.19.4.6 2 Kimi 14 Mol",
		"/Muwaan Mat|Maya:9.8.19.7.18 9 Etz'nab' 6 Keh~|:CE",
		"/K'inich Janahb' Pakal|Maya:9.9.2.4.8 5 Lamat 1 Mol~|:CE|君主名=Pacal;Hanab Pakal;Pacal II;Pacal the Great;Lord Shield Pacal;Subject A;Sunshield;Sun-Shield;Lady 8 Flower|生=Maya:9.8.9.13.0 8 Ahaw 13 Pop|卒=Maya:9.12.11.5.18 6 Etz'nab' 11 Yax",
		// heir designation 9.10.8.9.3 9 Ak'b'al 6 Xul
		"/K'inich Kan B'ahlam II|Maya:9.12.11.12.10 8 Ok 3 K'ayab'~|:CE|君主名=Chan Bahlum|生=Maya:9.10.2.6.6 2 Kimi 19 Sotz'|卒=Maya:9.13.10.1.5 6 Chikchan 3 Pop",
		// captured 9.13.19.13.3 13 Ak'b'al 16 Yax
		// dedicates Palace House A-D 9.14.8.14.15 9 Men 3 Yax
		"/K'inich K'an Joy Chitam II|Maya:9.13.10.6.8 5 Lamat 6 Xul~|:CE|君主名=K'an Hoy Chitam;K'an Hok' Chitam;Kan-Xul;Subject B;Hok';Xul;K'an-Hok-Xul|生=Maya:9.10.11.17.0 11 Ahaw 8 Mac",
		"/K'inich Ahkal Mo' Nahb' III|Maya:9.14.10.4.2 9 Ik' 5 K'ayab'~|:CE|君主名=Akul Anab;Chaacal;Lord Chaac;Subject C|生=Maya:9.12.6.5.8 3 Lamat 6 Sak|卒=Post 9.15.5.0.0 10 Ahaw 8 Ch'en",
		// invests K'an Tok official 9.15.10.10.13 8 B'en 16 Kumk'u
		"/K'inich Janahb' Pakal II|742/1/23~|:CE|疑|君主名=U Pakal K'inich Janahb' Pakal",
		// first katun anniversary 9.17.13.0.7 7 Manik' 0 Pax
		"/K'inich K'uk' B'ahlam II|Maya:9.16.13.0.7 9 Manik' 15 Wo~|:CE|君主名=Kuk",
		"/Wak Kimi Janahb' Pakal|Maya:9.18.9.4.4 7 K'an 17 Muwan~9.18.10.4.4|疑|:CE|君主名=Wak Kimi Hanab Pakal;6 Kimi Pakal;Cimi-Pacal"

]).minute_offset = -6 * 60;

// ---------------------------------------------------------------------//

// TODO: 阿拉伯

// ---------------------------------------------------------------------//
// example.

if (false) {
	parse_era([
	// ------------------------
	// 準確指定。
	'朝代/君主(帝王)/紀年名稱|[parser:]標準時間(如UTC+8) 起訖時間' + '|曆數(月分資料)[|其他附加屬性名稱=值|..]',
	// e.g.,
	'西漢/平帝/元始|1/2/11~6/2/16',

	// inherited 繼承
	'/君主(帝王)/紀年|起訖時間',
	// e.g.,
	'/孺子嬰/居攝|~8/12/16',

	// inherited 繼承
	'/紀年|起訖時間',
	// e.g.,
	'/初始|9/1/6~',

	// ------------------------
	// 準確指定。
	'朝代/君主(帝王)|起訖時間',
	// inherited 繼承
	'/君主(帝王)|起訖時間',

	// ------------------------
	// 準確指定。
	'朝代兼紀年|起訖時間' ]);

	// ------------------------

	// parser:
	// (省略) : 預設為 CE。

	// ------------------------

	// 起訖時間: [起時間][訖時間]

	// 起時間:
	// "y/m/d" : start date
	// "y/m/干支" : start date
	// (省略) : 接續上一筆紀年，從上一筆紀年的下一日/下一秒起

	// 訖時間:
	// "~y/m/d" : 指定 end date
	// "~m/d" : 指定 end date
	// "~" : 省略後續 end date，持續至下一筆紀年或持續至今
	// "+d" : 持續日數

	// ------------------------

	// 曆數(月分資料):
	// 日期次/年月日次: 除非設置(歲首)，否則一般等於日期名。

	// type 1:
	// [日期次=]:parser or reference (參照曆數之國家或紀元來源)

	// type 2:
	// 藉此可農曆 → 公元紀年。
	// 年與年以 pack_era.year_separator 分隔。
	// 月與月以 pack_era.month_separator 分隔。
	// 當曆法接著將起始的年次/月次/起始日碼=當月之日數 data;
	'2/1/2=29;30;29';
	// 可使用之指定法: 月,年/,/日,/月/日,年/月/,年/月/日. e.g.,
	// =日數 data; : 1年/1月/1日起始
	'=29;30;29';
	// 月次=日數 data; : 1年/月次/1日起始
	'2=29;30;29;30';
	// 年次/=日數 data; : 年次/1月/1日起始
	'2/=30;2=29;閏2=30;3=29;';
	// /日次=日數 data; : 1年/1月/日次起始
	'/2=30;';
	// 年次/月次/=日數 data; : 年次/月次/1日起始
	'2/1/=30;2=29;閏2=30;3=29;' + ';11=30;12=29;11=30;12=29;後12=29	1=29;';
	// /月名/起始日碼=日數 data; : 接續年次/月次/起始日碼次
	'/1/2=28;30;29';
	// 日數 data; : 省略起始的年月日次，當作接續上一個紀年的月分日期。若沒有可接續者，則預設為當曆法之
	// 1/1。
	'29;30;29';

	// 編碼壓縮法:(這邊為簡化版。實際上會 padding 到 12個月。)
	'1=30;2=29;閏2=30;3=29'
	//
	== '30;29;閏2=30;29'
	// 按月排，最前面加上 1 以避免 0 起頭、得處理長度不足問題。
	// 最後添上 4 閏月 index（並非月號！），1011 → [11] 為閏月。
	// 因此，長度為 13 或 14 + 4*閏月數。

	// 1 個閏月。0/1 定義見 MONTH_DAYS。
	// 30 29 30 29 → 0101
	// 閏2 @ index [2] → 0010(base 2)
	== '1 0101 0010'
	// parseInt('101010010', 2).toString(PACK_RADIX);
	== '9e';

	// 無閏月之12個月。0/1 定義見 MONTH_DAYS。
	'1101100101010'
	// parseInt('1101100101010',
	// 2).toString(PACK_RADIX);
	// 填滿至長度 4。見 YEAR_CHUNK_SIZE。
	== '5d6 ';

	// TODO: 由於農曆通常是大小月相間，應該以此壓縮。

	// ------------------------

	// 其他附加屬性名稱=值|attribute name=value
	// 注=.+ : 註解/note。
	// 參照用
	// 歲首=\d+
	// 閏月名=.+
	// 月名=第n(次數n=1~12)個月:第幾個月月名;第幾個月:第幾個月月名
	// 準=年|月|日|疑|傳說: 準確度
	// 精=年: 精密度
	//
	// 其他具特殊功能之附加屬性，請參照上述範例。
	//
	// TODO:
	// id=
	// 據=_URL_ : source/依據/憑據/根據/參考文獻來源/出典考據。
	// URL=_URL_ : 當紀年之資料。

}

// ---------------------------------------------------------------------//

CeL.era.pass_on.step = function() {
	// 還需要等待載入的國家。
	var queue = CeL.era.load_queue,
	// 因為載入時間較長，使用此功能可降低反應倦怠感，改善體驗。
	loaded = typeof CeL.env.era_data_load === 'function'
			&& CeL.env.era_data_load;

	if (Array.isArray(queue) && queue.length > 0) {
		var country = queue.shift();
		// console.info(country);

		CeL.era.set(this.countries[country], {
			國家 : country
		});
	}

	if (queue.length > 0) {
		if (loaded) {
			// CeL.log('Era data of country [' + country + '] loaded.');
			loaded(country, queue);
		}

		setTimeout(this.step, 0);
		return;
	}

	// done. 已載入曆數資料。
	CeL.era.loaded = true;

	if (loaded)
		loaded(country);

	// Release memory. 釋放被占用的記憶體.
	// this.CeL_era_data = this.step = this.queue = null;

	try {
		// delete this.CeL_era_data;
		// delete this.step;
		// delete this.queue;
		delete CeL.era.pass_on;
		delete CeL.era.load_queue;
	} catch (e) {
		// IE10 不允許 <code>delete this.*;</code>。
		// Error 445 [TypeError] (facility code 10): 物件不支援此動作
	}

}.bind(CeL.era.pass_on);

if (typeof CeL === 'function') {
	CeL.run('data.date.era', function() {
		// delete this.CeL_era_data.data;

		// 準備開始載入曆數資料。
		CeL.era.loaded = false;

		var queue = CeL.era.load_queue = [];
		// 國家
		for ( var country in this.countries)
			queue.push(country);

		if (typeof CeL.env.era_data_load === 'function') {
			// 第一次呼叫 callback。
			// 在載入era模組之前設定好，可以用來篩選需要載入的國家。
			CeL.env.era_data_load(this.countries, queue);
		}
		// console.log('Load ' + queue.join(', '));

		setTimeout(this.step, 0);

	}.bind(CeL.era.pass_on));

} else {
	CeL.era.pass_on.step();
}
