// Localized messages in 紀年轉換工具.
'use strict';
if (typeof CeL === 'function')
	CeL.gettext.set_text({
		'中國' : '中国',
		'한국' : '朝鮮',
		'Việt Nam' : 'ベトナム',
		'Maya' : 'マヤ',

		'取得紀年' : '暦日',
		'之' : 'の',
		'輸出格式:' : '出力形式:',
		'中文數字' : '漢数字:',

		'測試範例' : '入力例',
		'輸入紀錄' : '入力記録',
		'使用說明' : 'ご利用方法',
		'紀年線圖' : '時系列軸',
		// 階層
		'資料圖層' : '情報レイヤ',
		'曆譜' : '暦日表',
		'批次轉換' : '一括変換',
		'標注文本' : '古文書標注',
		'曆數處理' : '開発ツール',
		'問題回報' : '問題報告',

		'前綴' : '接頭辞',

		'增加此欄' : 'この列を追加する',
		'除去此欄' : 'この列を削除する',
		//
		'曆注' : '暦注',
		'Year numbering' : '紀年法',
		'Gregorian reform' : 'グレゴリオ改暦',

		'calendar' : '暦法',

		'Before Present' : '何年前',
		'Holocene calendar' : '人類紀元',
		'Unix time' : 'Unix時間',

		'伊斯蘭曆' : 'ヒジュラ暦',
		'希伯來曆' : 'ユダヤ暦',
		'傣曆' : 'タイ暦',
		'印度國定曆' : 'インド国定暦',
		'巴哈伊曆' : "バハイ暦",
		'科普特曆' : 'コプト暦',
		'衣索比亞曆' : 'エチオピア暦',
		'共存紀年' : '共存の紀年',
		// 仏滅紀元
		'佛曆' : '仏暦',
		'民國' : '民国',
		'黃帝紀元' : '黄帝紀元',
		'泰國佛曆' : 'タイ仏暦',
		'長紀曆' : 'マヤ長期暦',
		"Maya Tzolk'in" : 'マヤ神聖暦',
		"Maya Haab'" : 'マヤ文化暦',
		'羅馬建城' : 'ローマ建国紀元',
		// http://suchowan.at.webry.info/201407/article_8.html
		'塞琉古紀元' : 'セレウコス紀元',

		// region
		'Italy' : 'イタリア',
		'Spain' : 'スペイン',
		'Portugal' : 'ポルトガル',
		'Poland' : 'ポーランド',
		'France' : 'フランス',
		'Luxembourg' : 'ルクセンブルク',
		'Netherlands' : 'オランダ',
		'Bavaria' : 'バイエルン',
		'Austria' : 'オーストリア',
		'Switzerland' : 'スイス',
		'Hungary' : 'ハンガリー',
		'Germany' : 'ドイツ',
		'Norway' : 'ノルウェー',
		'Denmark' : 'デンマーク',
		'Great Britain' : 'イギリス',
		'Sweden' : 'スウェーデン',
		'Finland' : 'フィンランド',
		'Japan' : '日本',
		'China' : '中国',
		'Bulgaria' : 'ブルガリア',
		'Soviet Union' : 'ソ連',
		'Serbia' : 'セルビア',
		'Romania' : 'ルーマニア',
		'Greece' : 'ギリシャ',
		'Turkey' : 'トルコ',
		'Egypt' : 'エジプト',

		'朝代紀年日期' : '紀年/元号暦日',
		'Gregorian calendar' : 'グレゴリオ暦',
		'Julian calendar' : 'ユリウス暦',
		// Julian Day Number : ユリウス日数
		// http://members.jcom.home.ne.jp/ino-kei/jdtoasyu.htm
		// http://www.e-yakushiyo.net/Calendario_Maya_Dias.htm
		'JDN' : 'ユリウス通日',
		'JD' : 'ユリウス日',
		'Julian Day Number' : 'ユリウス通日',
		'Julian Date' : 'ユリウス日',
		// http://www.funaba.org/calendar-conversion
		'年日期' : '年日付',
		'週日期' : '週日付',
		'公元' : '西暦',
		'星期' : '曜日',
		// 干支年
		'歲次' : '年の干支',
		'月干支' : '月の干支',
		// 干支日
		'日干支' : '日の干支',

		'公元日期' : '西暦日付',
		'四柱八字' : '四柱',

		'導覽列：' : 'ナビゲーション バー：',
		'所有國家' : '全ての国家',

		// 判別困難
		'難辨識時段：' : '見づらい紀年：',
		'紀年線圖選項：' : '時系列軸の設定：',
		'合併歷史時期' : '時代区分を結合する',
		// 全般通用
		'general' : '全般',

		'請選擇所欲載入之資料圖層。' : 'お求めになる情報レイヤを選んでください。',
		// データの情報源
		'資料來源' : '参照元',
		'已載入 %1 筆資料。' : '%1 件のデータを読み込みました。',

		'請注意：本欄僅供開發人員使用。' : '開発者向け機能なので、ご使用の際はお気をつけください。',

		'訊息提示與紀錄欄' : 'メッセージや情報の記録帳',
		'紀年轉換工具' : '紀年変換ツール'
	}, 'ja-JP');